{
  "title": "Uvodne riječi",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "uvodne-rijeci",
  "tags": [
    "Službeno"
  ],
  "posts": {
    "5": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "## Dobrodošli na Studoše!\n\nTrenutno je forum u izgradnji, tj. podešavaju se neke stvari, treba se napraviti ekstenzija za hrvatski umjesto direktno prevođenog engleskog, i tako. Do kraja dana bi trebalo biti gotovo.\n\nU međuvremenu postoje 2 oznake koje možete koristiti:\n\n- FER\n- Opušteno\n\n**FER** vam može poslužiti ako vam je stvarno hitno postati nešto vezano uz Faks. ~~Na kraju dana će biti složene i sve kategorije, a sve objave ću osobno sortirati, tako da ne brinite.~~ Kategorije su složene, slobodno otvorite dretve za što vam god treba. Što se tiče npr. MATAN 2 kojeg nema ali ima MAT2, koristite to, ja ću sve FER2 presmete preimenovati u FER3 ekvivalente prije ili kasnije.\n\nS druge strane **Opušteno** vam može koristiti za bilo što nevezano uz faks.\n\nIsto tako, ako vidite kakve bugove, možete ih objaviti u dretvu [Bugovi](https://forum.studosi.net/d/7-bugovi)\n\n## Stari forum\n\n[Kampus](https://ka.mpus.eu) ima ugašene registracije, ali će na njemu još neke stvari ostati. Nakon što se završi sav posao ovdje danas, bit će i onemogućeno sve osim pregledavanja, tako da se ti podaci mogu negdje spremiti odjednom, pa vam ih mogu ponuditi, ako nešto želite s njima.\n\n## Pripadnici drugih fakseva\n\nAko želite osnovati svoju zajednicu, trenutno su stvari komplicirane, no svejedno se javite na info@studosi.net. Najnormalnije možete otvoriti raspravu ako o tome želite pričati javno, ili se raspitati. Naravno, u rasprava koje nemaju baš prevelika ograničenja, kao što je npr. spam me možete @spomenuti i pitati što god vas zanima.\n\nBilo bi lijepo kad bi se skupilo bar troje vas, i onda ću s vama otvoriti razgovor u kojem ćemo moći popričati što i kako. Ovo ne znači da su ovo neki pregovori, nego kako ovo je u ranom stadiju, onda još ne postoje neki čvrsti planovi i standardi pa dakako moram vidjeti i što vi imate za reći. Bitno mi je da vas je troje jer ćete vi koji se javite najvjerojatnije voditi vašu novu zajednicu, a mene možete angažirati ako vam baš nešto zapne (ili kao izvor savjeta ako baš želite). To jest, u najgorem slučaju ja samo uskačem kad je kritično.\n\nMoj plan nije miješati se previše u režim drugih fakseva, već sam ja tu samo da definiram neke stvari koje će svima pomoći u održavanju usluge na nivou. Ja na kraju krajeva ni nemam znanje da bih za razliku od vas znao što je uopće drugim faksevima bitno i zgodno. Za sve ostalo, vaše međuljudske odnose, način održavanja materijala, odabir proširenja i sl. ćete se pobrinuti sami, kako bi vama bilo bolje, i uz poštivanje pravila zajednice imate u ostalom potpunu slobodu. I naravno, sve ovo ide uz pretpostavku da je sve ovo naše, pa niste prepušteni sami sebi, već smijete međudjelovati i s drugim zajednicama, kao da smo svi jedno.",
      "votes": {
        "upvoters": [
          "G-bear",
          "[deleted]",
          "jarza",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3552": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "# FER3 materijali i stare dretve\n\nPrije tjedan dana, na Facebooku sam kontaktirao rovokopa, vlasnika FER3. Kako sam imao neke grube informacije oko njegovih planova s materijalima i starim dretvama, zapravo, bilo mi je samo bitno da on to još ima, pokušao sam razgovarati s njim o tome:\n\n![](assets/2020-03-26/00046.png)\n\nNaravno, kao što je vidljivo i iz slike, kolega rovokop nije prihvatio zahtjev za porukom, iako, vjerojatno i sami pretpostavljate, postoji velika vjerojatnost da ju je u tjedan dana uspio i pročitati. Međutim, nije na meni da nagađam što je bilo i zašto je to tako, već isključivo da vas informiram da više-manje jedina osoba koja ima riječ u ovome jest jednako onoliko neresponzivna u pravom životu kao i na forumu.\n\nStvarno se nadam da mu se nije nešto dogodilo, već da je, kako bih ja možda zločesto htio, s 35 godina imao premalo muda reći \"Ne\".\n\nUnlucky.",
      "votes": {
        "upvoters": [
          "Amon",
          "Bobicki",
          "BrkMateaBeusana (Umarell)",
          "EthanCarter",
          "Galke",
          "Gulbash",
          "Hrvoje (Hrvoje45)",
          "KitKat (H(x))",
          "Lenobius",
          "McKovalski",
          "Mike (Klaud Konzultanta)",
          "Mioch",
          "MiqeloS",
          "Murin",
          "RS7",
          "Stark",
          "Svarog (Veles)",
          "ViBorg",
          "WickyWinslow",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "angello2",
          "at5611",
          "in1",
          "indythedog",
          "jadzia-dax (Jadzia Dax)",
          "mAcaLukas (mAca Lukas)",
          "pitroid",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "testmicho (Alternativni Mićo)",
          "wutangfan (HugoStiglitz)"
        ],
        "wtf": [],
        "tuga": [
          "AlejaGovana",
          "Amali (Amajli)",
          "Amon",
          "BrkMateaBeusana (Umarell)",
          "BrownPerson (Bambi)",
          "Filemon",
          "Fortius",
          "Gulbash",
          "Hrvoje (Hrvoje45)",
          "Johnny_Bravo (a beautiful and unique snowflake)",
          "JuricaBj",
          "Kushim",
          "Lenobius",
          "McKovalski",
          "Mikki",
          "Mioch",
          "MiqeloS",
          "Murin",
          "NekocBraca",
          "Njet",
          "PrisonMike (Števo)",
          "Stark",
          "Svarog (Veles)",
          "WickyWinslow",
          "__builtin_popcount (std::popcount)",
          "aaa8 (Gerti)",
          "in1",
          "indythedog",
          "latica",
          "lucylu",
          "lup",
          "mAcaLukas (mAca Lukas)",
          "netflix (seximan)",
          "soplagaitas (sopla)"
        ]
      }
    }
  }
}