{
  "title": "Uvjeti korištenja",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "uvjeti-koristenja",
  "tags": [
    "Službeno"
  ],
  "posts": {
    "288": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "# Uvod\n\nJa sam osoba koja inače voli jako pisati i filozofirati ali reda radi napisat ću ova pravila što sažetije mogu. Ovi uvjeti korištenja su tu da osiguraju rad foruma u skladu sa zakonima Republike Hrvatske, ali isto tako daju slobodu bilo kojem akademskom građaninu da se, u skladu s prijespomenutim zakonima, slobodno izražava i doprinosi zajednici.\n\n# Uvjeti\n\n## Članak 1.\n\nForum studenata Republike Hrvatske, koji se može pronaći na adresama **studosi.net**, **www.studosi.net**, **forum.studosi.net**, iznad svega poštuje zakone Republike Hrvatske. Odredbe ovih uvjeta korištenja ne mogu biti u neskladu s takvim odredbama i ako i postoji neka odredba koja bi uvodila u sustav nejednoznačnost i/ili konflikt, takva odredba je **nevažeća**.\n\n\n## Članak 2.\n\nUstavni poredak foruma je jedan don, do **tri** konsiljera od kojih svaki mora biti iz različite obrazovne ustanove, te do **tri** kaporežima po obrazovnoj ustanovi.\n\n\n## Članak 3.\n\nSvi članovi na forumu su ravnopravni. Voditelji imaju više ovlasti od normalnih korisnika, ali opravdanje za tu nejednakost proizlazi iz posla koje oni obavljaju.\n\nUloga konsiljera je savjetovati dona kroz život foruma. Obaveza različitosti proizlazi iz činjenice da savjeti moraju biti iz različitih kuteva, a obaveza da taj broj bude ne veći od **tri** je da se ne uvodi prevelik kaos.\n\nUloga kaporežima je da uređuju **3** važne relacije:\n\n- obrazovna ustanova - forum (nešto nalik PR-a, netko tko je upućen u dinamiku obrazovne ustanove i to može prenijeti na forum)\n- akademski građani - forum (nešto nalik klasičnog moderatora)\n- forum - materijali (nešto nalik menadžera, za materijale)\n\nKaporežimi se ne mogu jedni drugima uplitati u stvari za koje nisu nadležni, ali se ostavlja na odabir kaporežima hoće li dati i primiti pomoć od drugih kaporežima.\n\nKaporežimi iste obrazovne ustanove međusobno su ravnopravni - oni imaju samo različite funkcije. Kaporežimi različitih akademskih zajednica odgovaraju isključivo donu. Konsiljeri odgovaraju isključivo donu.\n\n\n## Članak 4.\n\nSvaki član akademske zajednice ima puno pravo sudjelovati u njoj. Međutim, ovo nije neotuđivo pravo, već pravo koje članovima bona fide daje don. Stoga, don, u svojoj diskreciji, ima pravo to pravo i oduzeti nekome. Međutim, to može biti učinjeno isključivo uz jasno i detaljno navedene razloge. Ovakvo što, tj. isključivanje članova iz zajednice, **ne može** nitko osim dona.\n\n\n## Članak 5.\n\nDon, kao netko u ulozi benevolentnog diktatora, ima puno pravo izmijeniti ove uvjete korištenja radi bilo kojeg razloga, bilo kad i bilo gdje, ali isključivo uz objašnjenje. Svaka promjena uvjeta mora biti na kolektivnoj razini, a nikada na individualnoj razini.\n\n\n## Članak 6.\n\nZabranjeno je djelovati voljom, silom ili propustom koji bi rezultirali štetom zajednici. U ovo spada i djelovanje u neskladu s proteklim člancima. Ovo je ujedno i jedan jedini razlog zašto bi don nekom članu mogao ukinuti pravo na pristup. Ako štetno djelovanje nema načina da ne bude štetno, onda je to nešto što će biti sankcionirano, tu povlačimo liniju. Međutim, uz dijalog, koliko god crne stvari bile, vjerojatno možemo doći do rješenja koje će u konačnici biti manje štetno, ako ne i bezopasno. Isto vrijedi i za obrnuti smjer. Dijalog je ključ svega. Bez njega, nema smisla imati zajednicu.\n\n## Članak 7.\n\nRješenja zadataka, neovisno o izvoru i značaju za predmet, jednom predana ostaju na forumu. Rješenja zadataka služe budućim generacijama kao pomoć u shvaćanju predmeta. Zbog toga što ovo pravilo nije bilo definirano, sve objave objavljene do 23.04.2020. 0:00 moguće je do 1.5.2020. uz upit u privatne poruke @micho obrisati uz obavezu da se na kraju semestra, kako će to biti, sakupe i postave na materijale gdje će se sadržaji u dretvama arhivirati. Ovaj postupak neće provoditi korisnici, već netko u vodstvu programskim prolaženjem kroz rasprave. Nakon tog datuma smatra se, u dobroj vjeri, da su namjere pošiljatelja bile časne, a sve ostalo je na odgovornost pošiljatelja (dakle odgovornost pred fakultetom).\n\n\n# Dodatak\n\nSve ostale odredbe proizlaze iz osobne volje i filozofije vodstva. Ovo su samo odredbe koje svi moraju prihvatiti, a ostale odluke donose se s fokusom na dobrobit zajednice.\n\nAko vam netko smeta, imate mogućnost ignorirati ga (ne generalno rečeno, postoji gumb). Stvari koje su neprikladne moraju tako biti i označene. Ako je nešto ilegalno, postoje organi koji provode zakon, te se treba obratiti njima.\n\nSad, neki možda misle da bi trebalo pročitati cijeli zakon i Ustav RH da se zna što se može. Ja mogu garantirati da nenamjerne gluposti neće biti kažnjene, ali naravno, bolje je pitati. Škakljiva pitanja kao što je npr. golotinja je u istoj mjeri regulirana kao i u društvu - ako nešto što želite pokazati forumu ne bi pokazali policajcu, vjerojatno nije dobra ideja ni da je pokazujete forumu. No kažem, za ta škakljiva pitanja @micho je dostupan za dijalog.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Murin",
          "Svarog (Veles)",
          "UkiseljeniKrastavac",
          "[deleted]",
          "feel_d_boot (iNut)",
          "matt (Matt)",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "344": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "# GDPR izjava\n\nOva stranica prikuplja neke osobne podatke o korisniku - u skladu detalja članova to je e-mail s kojim je član registriran, ali i IP adresa korisnika. IP adresa korisnika može služiti voditelju foruma tj. Donu za neke odluke, ali on ih ne smije, niti ih ikada hoće otkrivati drugima.\n\nS druge strane, e-mailovi korisnika nisu na prvu dostupni drugima, ali su dostupni vodstvu foruma. Oni ih ne smiju niti hoće dijeliti s drugim članovima izvan vodstva, a služe isključivo kao jedna informacija za autentifikaciju, te kao kontakt izvan foruma.\n\nIz e-mail adresa, zbog njihove prirode, jako je lagano isčitati identitet osobe. Ovo tu nije činjenica koje će vodstvo iskorištavati, niti je nešto što vodstvo može izreći bilo kome drugome bez dopuštenja osobe čiji je identitet. Ovo isto vrijedi i za obrazovnu ustanovu kojoj član pripada.\n\nDakle, da rezimiramo, snimaju se vaši mailovi i IP adrese. Ne namjeravamo ih dijeliti ali vodstvo ima pristup za normalno funkcioniranje foruma i neće ga dijeliti dalje.\n\nZa sva ostala obilježja koje bi forum mogao pohranjivati prethodno ćemo obavijestiti korisnike. Kršenje GDPR-a od strane članova foruma izvan vodstva molim da rješavate odvojeno od vodstva - vodstvo eventualno može takav podatak na zahtjev ukloniti iz neke objave.\n\nEDIT: Kolega @Filemon je ukazao na neke nepravilnosti u izjavi. Također je ukazao na poteškoće s deklinacijom titula pa će se one prevesti na hrvatske ekvivalente; don, konsiljer, kaporežim. Ovim povodom nadopunjujem i GDPR:\n\n## Vrsta prikupljenih podataka\n\nE-mail adrese (kroz registraciju) te IP adrese (kod aktivnih sjednica, kod objave i kod rasprave)\n\n## Pravne osnove\n\nVaši podaci se skupljaju uz privolu (koju možete povući, no zbog prirode podataka to povlači uklanjanje sa stranice). IP adrese se trenutno skupljaju neposredno.\n\n## Namjena\n\nPrikupljeni podaci koriste se za određene, eksplicitne i legitimne namjere; u slučaju e-maila za kontakt i kao jedna od informacija za pristup stranici, a u slučaju IP-a, pa, server treba znati vaš IP da bi s njim mogao komunicirati.\n\n## Koliko dugo čuvamo podatke\n\nVaši e-mailove čuvamo dok god ste registrirani na stranici. IP-adrese čuvamo dok god postoje objave i rasprave poslane s određene IP adrese.\n\n## Zaštita podataka\n\nVaši podaci saržani su u našoj bazi podataka kojoj se jedino može pristupiti preko lokalnog stroja, koji je zaštićen lozinkom i ed25519 ključem koji se smatraju praktički neprobojnim.\n\n## Tko obrađuje podatke\n\nUnutar foruma, nitko eksplicitno ne obrađuje podatke jer se s njima ništa ne radi izuzev funkcionalnosti foruma. Međutim, ako ima tko zadužen za njihovu obradu, onda bih to bio ja, @micho .\n\nU slučaju zakonskih intervencija, podatke će obrađivati tko god već bude zadužen na zahtjev tijela vlasti, sudske odluke itd.\n\n## Vaša prava\n\nMožete:\n- zatražiti podatke na uvid\n- ispraviti podatke - u slučaju maila moguće ga je prepraviti koristeći alate na forumu ili kontaktirajući dona ili konsiljera koji to može učiniti za vas\n- ograničiti obradu podataka\n- prigovoriti na uporabu podataka za sve osim za funkcioniranje vašeg računa na forumu\n\n## Kome se možete obratiti\n\nMeni, @micho kroz privatne poruke ili na info@studosi.net\n\n## Kako mogu opozvati suglasnost?\n\nMožete poslati poruku @micho , ili poslati poruku na info@studosi.net. Uzmite u obzir da opoziv suglasnosti sa sobom vuče isključenje s foruma (jer nije moguće biti registriran bez e-maila ili bilježenja IP adrese).\n\n## Dodatak u vezi privatnih poruka\n\nOvaj tjedan iskoristio sam kako bih vidio što se može po pitanju privatnih poruka. Činjenice su:\n- privatne rasprave više nisu enkriptirane u bazi\n- prijavljene objave u privatnim raspravama postaju vidljive autoriziranim osobama (trenutno samo donu, tj. meni, to se vjerojatno neće mijenjati)\n- privatnim porukama se trenutno može pristupiti isključivo preko baze podataka kojoj je moguće pristupiti isključivo lokalno preko poslužitelja na kojem se nalazi\n  - pristup tom poslužitelju omogućavaju za sad 2 SSH ključa koja ja držim lokalno, uz zaporke kojima su zaključani</LI>\n- ovakva konfiguracija nije posebna za nas, već je i u drugim implementacijama takva, a takva je radi sigurnosti države i članova u smislu foruma\n\nKako su privatne rasprave dosta bitne za ovakvu zajednicu, ne toliko da bi netko imao privatne rasprave, već da se komunikacija na forumu može odvijati bez zagađenja nebitnim temama (kad se nešto tiče pojedinaca), ja sam bio primoran odlučiti da se privatne rasprave vrate u funkciju, kao i prijave objava. No, naravno, moram vas informirati o vašim pravima:\n\n1. Pristup gorenavedenoj bazi podataka uvijek će imati isključivo don. Pristup bazi podataka podrazumijeva pristup poslužitelju, **SVEMU**. Dakle, čak i da je nekim ludim scenarijom došlo do toga da netko drugi ima pristup tom računalu, ta osoba je praktički administrator.\n2. Na vašem profilu nalazi se prekidač kojim možete onemogućiti privatne poruke. Ovo će ih onemogućiti za sve osim za donove (mene), jer se to ni ne može isključiti za mene, a osim toga, ja ionako imam uvid u te poruke\n3. Osobno garantiram da bazi ne želim nit ću pristupati izuzev kad to od mene potrebuje sud, policija ili tko već, tj. neću zadirati u vašu privatnost dok me na to zakon ne prisili (a realno ne bi se smjelo dogoditi). Jedini način kako da vidim te poruke bez baze je ako netko prijavi nešto u raspravi. **Zlouporaba ove funkcionalnosti (prijaviti nekog samo kako bi razglasili nečiju intimu npr.) bit će shvaćena ozbiljno i kao uskraćivanje privatnosti drugome, što je protuustavno, i nakon toga slijede sankcije, ovisno o severitetu.**\n4. NAJVAŽNIJE - ako vam je stvarno stalo do privatnosti, to jest, ne želite je ničime kompromitirati, ili mi jednostavno ne vjerujete, molim vas da koristite druge servise koji vam tu privatnost mogu možda bolje garantirati.\n\nNaposljetku, privatne poruke će, ukoliko ih obrišete, vjerojatno ostati u bazi (jer samo ovlaštene osobe mogu brisati sadržaj nepovratno). Ako vam je bitno da se izbrišu zauvijek (ne ulazim u **zašto** to želite, ali napravit ću zapisnik o tome, jer to zakonski moram), javite mi se započinjanjem privatne rasprave i ja ću to učiniti ručno ili proširenjem, ovisno o dostupnosti proširenja.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Murin",
          "Svarog (Veles)",
          "UkiseljeniKrastavac",
          "[deleted]",
          "matt (Matt)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "401": {
      "poster": "Amon",
      "content": "Može neki tl;dr?",
      "votes": {
        "upvoters": [
          "ink",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": [
          "Filemon",
          "UkiseljeniKrastavac"
        ]
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Filemon",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "cajaznun",
          "markoo321 (Grinch)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "410": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Amon#401 Ljudi jednaki. Moć samo iz potrebe. Hijerarhija foruma je 1 Don, do 3 Consiglierea globalno, do 3 Caporegimea po obrazovnoj ustanovi. Pravila mijenja samo Don uz obavijest i razradu. Bannable je samo činiti štetu zajednici (zvuči jako otvoreno, ali doslovno znači da je zabranjeno raditi nešto čija je jedina svrha naštetiti zajednici), sve ostalo ide po zakonima RH.\n\nSkupljaju se e-mail i IP. Tome ima pristup vodstvo. Vodstvo to ne smije prosljeđivati dalje.",
      "votes": {
        "upvoters": [
          "Amon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "413": {
      "poster": "ink",
      "content": "@micho#410 kakve su to izmišljene riječi hahaha. Dobro da nisi stavio titulu konkubina",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "markoo321 (Grinch)",
          "moose (sugar BoOo!!)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "415": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@ink#413 Hijerarhija na forumu je sličnija mafijaškoj obitelji nego klasičnoj forumskoj hijerarhiji, prema tome smatram ove nazive prikladnima. Jer svaki capo se bavi nekim drugim biznisom, ali bez obzira na te različitosti svi idu istom cilju :D",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "G-bear",
          "RS7",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "soplagaitas (sopla)",
          "triespe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "G-bear",
          "ViBorg",
          "ink",
          "member"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "416": {
      "poster": "[deleted]",
      "content": "@ink#413 spavat ćeš s ribama",
      "votes": {
        "upvoters": [
          "Filemon",
          "Murin",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "ink",
          "rija",
          "triespe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BrownPerson (Bambi)",
          "Sans",
          "SpekuraDebela (Šćap)",
          "Svarog (Veles)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "moose (sugar BoOo!!)",
          "rija"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "3523": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Dodao sam ovo i u GDPR privolu, ali evo da bumpam thread:\n\n## Dodatak u vezi privatnih poruka\n\nOvaj tjedan iskoristio sam kako bih vidio što se može po pitanju privatnih poruka. Činjenice su:\n- privatne rasprave više nisu enkriptirane u bazi\n- prijavljene objave u privatnim raspravama postaju vidljive autoriziranim osobama (trenutno samo donu, tj. meni, to se vjerojatno neće mijenjati)\n- privatnim porukama se trenutno može pristupiti isključivo preko baze podataka kojoj je moguće pristupiti isključivo lokalno preko poslužitelja na kojem se nalazi\n  - pristup tom poslužitelju omogućavaju za sad 2 SSH ključa koja ja držim lokalno, uz zaporke kojima su zaključani</LI>\n- ovakva konfiguracija nije posebna za nas, već je i u drugim implementacijama takva, a takva je radi sigurnosti države i članova u smislu foruma\n\nKako su privatne rasprave dosta bitne za ovakvu zajednicu, ne toliko da bi netko imao privatne rasprave, već da se komunikacija na forumu može odvijati bez zagađenja nebitnim temama (kad se nešto tiče pojedinaca), ja sam bio primoran odlučiti da se privatne rasprave vrate u funkciju, kao i prijave objava. No, naravno, moram vas informirati o vašim pravima:\n\n1. Pristup gorenavedenoj bazi podataka uvijek će imati isključivo don. Pristup bazi podataka podrazumijeva pristup poslužitelju, **SVEMU**. Dakle, čak i da je nekim ludim scenarijom došlo do toga da netko drugi ima pristup tom računalu, ta osoba je praktički administrator.\n2. Na vašem profilu nalazi se prekidač kojim možete onemogućiti privatne poruke. Ovo će ih onemogućiti za sve osim za donove (mene), jer se to ni ne može isključiti za mene, a osim toga, ja ionako imam uvid u te poruke\n3. Osobno garantiram da bazi ne želim nit ću pristupati izuzev kad to od mene potrebuje sud, policija ili tko već, tj. neću zadirati u vašu privatnost dok me na to zakon ne prisili (a realno ne bi se smjelo dogoditi). Jedini način kako da vidim te poruke bez baze je ako netko prijavi nešto u raspravi. **Zlouporaba ove funkcionalnosti (prijaviti nekog samo kako bi razglasili nečiju intimu npr.) bit će shvaćena ozbiljno i kao uskraćivanje privatnosti drugome, što je protuustavno, i nakon toga slijede sankcije, ovisno o severitetu.**\n4. NAJVAŽNIJE - ako vam je stvarno stalo do privatnosti, to jest, ne želite je ničime kompromitirati, ili mi jednostavno ne vjerujete, molim vas da koristite druge servise koji vam tu privatnost mogu možda bolje garantirati.\n\nNaposljetku, privatne poruke će, ukoliko ih obrišete, vjerojatno ostati u bazi (jer samo ovlaštene osobe mogu brisati sadržaj nepovratno). Ako vam je bitno da se izbrišu zauvijek (ne ulazim u **zašto** to želite, ali napravit ću zapisnik o tome, jer to zakonski moram), javite mi se započinjanjem privatne rasprave i ja ću to učiniti ručno ili proširenjem, ovisno o dostupnosti proširenja.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Aquaman",
          "NekocBraca",
          "ink"
        ],
        "downvoters": [
          "otacon (senpai)"
        ]
      },
      "reactions": {
        "haha": [
          "otacon (senpai)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "12965": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Novonastalom situacijom, dodaje se jedno pravilo inspirirano nekakvim zabludama da ovaj forum služi za varanje sustava. Naravno, pravila će biti dodana i u pravila:\n\n## Članak 7.\n\nRješenja zadataka, neovisno o izvoru i značaju za predmet, jednom predana ostaju na forumu. Rješenja zadataka služe budućim generacijama kao pomoć u shvaćanju predmeta. Zbog toga što ovo pravilo nije bilo definirano, sve objave objavljene do 23.04.2020. 0:00 moguće je do 1.5.2020. uz upit u privatne poruke @micho obrisati uz obavezu da se na kraju semestra, kako će to biti, sakupe i postave na materijale gdje će se sadržaji u dretvama arhivirati. Ovaj postupak neće provoditi korisnici, već netko u vodstvu programskim prolaženjem kroz rasprave. Nakon tog datuma smatra se, u dobroj vjeri, da su namjere pošiljatelja bile časne, a sve ostalo je na odgovornost pošiljatelja (dakle odgovornost pred fakultetom).\n\nBez obzira na to, radi trenutne situacije s mehanizmom uređivanja, naravno da je moguće ispraviti netočne tvrdnje u objavi. Međutim, radi li se o nekakvoj većoj greški, sve što je potrebno je da mi se javi ispravna verzija i ja ću to ispraviti.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "14485": {
      "poster": "volimfmos69 (debos)",
      "content": "Nisam pravnik ni pametan,sto ovaj clanak 7 znaci u praksi, pogotovo recenica: \"Nakon tog datuma smatra se, u dobroj vjeri, da su namjere pošiljatelja bile časne, a sve ostalo je na odgovornost pošiljatelja (dakle odgovornost pred fakultetom).\" ?\n\nPosto su nam akaunti povezani mailom fakulteta, znaci li to da neka osoba s faksa moze proci kroz objave, naci korisnike koji \"varaju\" u kontekstu fakultetskih pravila, i od admina ustvrditi o kojim se osobama radi?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "14540": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@volimfmos69#14485 Ne mogu me bez sudskog naloga natjerati da otkrijem mail\n\nDa im otkrijem identitet osobe bez toga kršim GDPR i mogu snositi RL posljedice.",
      "votes": {
        "upvoters": [
          "Filemon",
          "G-bear",
          "Hrvoje (Hrvoje45)",
          "Mrcina (Yoso)",
          "[deleted]",
          "volimfmos69 (debos)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143237": {
      "poster": "zeroth",
      "content": "Je li dozvoljeno stavljati ppt predavanja i labose na materijale (pdf, ne rješenja). Logično da možemo mi staviti što god, ali smije li se.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143270": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@zeroth#143237 ehh teoretski ne, ali kako je to obično javno dostupno ionako stavim dok se netko ne požali",
      "votes": {
        "upvoters": [
          "Kushim",
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}