{
  "title": "Hrana i kuhanje",
  "creator": "lup",
  "slug": "hrana-i-kuhanje",
  "tags": [
    "Opu코teno"
  ],
  "posts": {
    "1582": {
      "poster": "lup",
      "content": "evo u ovo tesko doba korone da donesemo malo srece za ljude zaglavljene u kuci, sada je super vrijeme naucit kuhat... podjelite svoje znanje i neznanje, i naucite sto novo... da vas ubije virus, a ne 500ta pizza ili burger s glova...\n\nevo i slika mog danasnjeg rada, da se ne cini ko da samo serem 游때![](assets/2020-03-21/00014.jpeg)",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "AVRFreak",
          "Elendur19 (Zagor)",
          "Filemon",
          "MsBrightside",
          "SuperSjajan3",
          "Svarog (Veles)",
          "ViBorg",
          "Worly",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "allophone",
          "feel_d_boot (iNut)",
          "iNavy (mornar Ica)",
          "indythedog",
          "ink",
          "member",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "1587": {
      "poster": "Worly",
      "content": "Moze jedan tutorial kako napraviti sengwich?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "1590": {
      "poster": "feel_d_boot (iNut)",
      "content": "Ja sam radija semifreddo ali sam poija sve s uku캖anima, ne코to ka doma캖i sladoled i mo쬰코 sve 쬴vo ubaciti u njega.\n\nTalijani imaju shit disciplinu kad je rije캜 o pandemiji al brte 코to dobre i lagane slastice imaju.\n\nI slika kako je moj otp izgleda:\n\n![](assets/2020-03-21/00015.jpeg)\n\nStavija sam amareta, ruma, krokanta i nutele, ma kakav ledo bog te jebo ovo je bonba\n\nEvo i wiki link jic: https://en.wikipedia.org/wiki/Semifreddo",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "McKovalski",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "allophone",
          "iNavy (mornar Ica)",
          "idontwannabemyself",
          "lup",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "1591": {
      "poster": "lup",
      "content": "@Worly#1587 pa evo, ustvari je jako lagano\n\nhttps://www.youtube.com/watch?v=URvWSsAgtJE",
      "votes": {
        "upvoters": [
          "Svarog (Veles)",
          "Worly",
          "__builtin_popcount (std::popcount)",
          "tinvickovic (augusteen)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "1624": {
      "poster": "[deleted]",
      "content": "@Worly#1587 \n\nhttps://www.youtube.com/watch?v=sCIukFS6bpA",
      "votes": {
        "upvoters": [
          "AVRFreak",
          "Filemon",
          "M-16",
          "McKovalski",
          "Mioch",
          "Murin",
          "Ollie",
          "Svarog (Veles)",
          "Worly",
          "ZvonkoSisoje",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "adrian7000",
          "djeno",
          "feel_d_boot (iNut)",
          "idontwannabemyself",
          "ink",
          "jadzia-dax (Jadzia Dax)",
          "member",
          "rija",
          "tinvickovic (augusteen)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "McKovalski",
          "Worly",
          "__builtin_popcount (std::popcount)",
          "adrian7000"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "2455": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "# 2 godine pizze\n\n[size=50]UPDATE @micho#78031 [/size]\n\nOvo je ne toliko kratki guide kojeg je izvor mojih 2 godine iskustva s pizzom. Odmah 캖u re캖i koje su stvari nu쬹e i najbitnije za dobru pizzu, tako da se ne moraju svi baviti detaljima.\n\nZa dobru pizzu va쬹o je:\n- koristiti mozzarellu (po mogu캖nosti suhu!)\n- imati kru코nu pe캖 (ili bar kamen za pizzu)\n- dugo i sporo kuhati umak\n- dugo mijesiti tijesto (i po mogu캖nosti nakon mije코enja ostaviti ga da odle쬴 dan)\n\nTo su nedvojbene stvari koje 캜ine dobru pizzu. No naravno, ve캖ina nas 캖e vjerojatno te코ko ispuniti prva dva uvjeta, a i posljednji mo쬰 biti te쬬k (jer je potrebna posebna tehnika mije코enja da bi to mije코enje bilo kra캖e od sat-dva). Zato sam ja tu da vam poka쬰m kako te stvari mo쬰te (donekle) zaobi캖i.\n\n# Priprema\n\nPriprema zapo캜inje s [*mise en place*](https://www.reluctantgourmet.com/mise-en-place/). Ovo je ne코to 코to bi trebalo biti dio filozofije svakog kuhara.\n\n## Sastojci za tijesto\n\n- 코e캖er\n- voda\n- instant kvasac\n- sol\n- bra코no (po prioritetu visokoglutensko > glatko > o코tro)\n- ulje (+ za maslinovo)\n\n### Neobavezni sastojci za tijesto\n\n- kukuruzno bra코no\n\n## Sastojci za nadjev\n\n### Umak\n\n- raj캜ica (pelati > pasta > pasirana)\n- maslac (ili ulje ako ga nemate, maslinovo > biljno)\n- luk\n- 캜e코njak\n- sol\n- med (ili 코e캖er)\n\n### Neobavezni dodaci umaku\n\n- ru쬸arin (svje쬴 sjeckani > suhi)\n- bosiljak (svje쬴 > suhi > prah)\n- worcestershire umak\n\n### Ostatak\n\n- mozzarella (ako je nemate dobar supstitut su cheddar i emmentaler, nakon toga je svejedno)\n- listovi bosiljka\n  - ili bilo koji drugi skup priloga koje 쬰lite na pizzi</LI>\n\n## Oprema\n\n- papir za pe캜enje (ako nemate kru코nu pe캖 ili kamen za pizzu)\n- sprej bo캜ica (za vodu, pobolj코ava hrskavost)\n- valjak (ako ne 코irite tijesto rukama)\n- mijesilica (ako ne mislite mijestiti tijesto rukama)\n\n# Postupci\n\nIako je postupak stvaranja pizze jako ovisan o osje캖aju, poku코at 캖u do캜arati najbolje 코to mogu koli캜ine u nekim grubim, ne toliko preciznim mjerama za **1, srednju-veliku pizzu**. Treba primijetiti da nisam to캜no odredio o kakvoj se pizzi radi jer pojam velika-mala ovisi od osobe do osobe. Na vama je onda da te mjere uskladite kako bi odgovarale vama.\n\n**Svaki recept koji se poziva na savr코enstvo bilo u proceduri, popisu sastojaka ili njihovoj koli캜ini se mo쬰 smatrati nesavr코enim.**\n\n## Dobivanje tijesta\n\nU otprilike 3/5 코alice mlake vode umije코ajte pola 쬷i캜ice 코e캖era. Mije코ajte dok 코e캖er ne postane (gotovo) nevidljiv. U posudu uspite 4/5 코alice bra코na, te ga dobro pomije코ajte s dvije 쬷i캜ice instant kvasca i pola 쬷i캜ice soli. Polako uljevajte vodu i mije코ajte, a nakon 코to dodate otprilike pola vode u smjesu ulijte 쬷i캜icu maslinovog ulja. Ulijte ostatak vode i nastavite mije코ati. Ako je nakon nekog vremena smjesa jo코 uvijek prevla쬹a, dodajte bra코na dok ne procijenite da ju mo쬰te mijesiti.\n\nStavite smjesu iz posude na neku tvrdu, 캜vrstu i stati캜nu podlogu (drvo, kamen) koju vam je lako oprati i krenite mijesiti. Ukoliko znate mijesiti tijesto tako da ga efikasno pove쬰te 코to se ti캜e glutena, mijesite ga 15-30 minuta. Ukoliko ne znate neku dobru tehniku mije코enja, ili mijesite tijesto 1-2 sata, ili ga mijesite bar 10-15 minuta, pa 캖u vam kasnije re캖i 코to trebate. Ako mijesite tijesto strojem, dovoljno je da mijesilica radi sat-dva. Ovisno o temperaturi, trebat 캖e kra캖e ili dulje mijesiti tijesto. Generalno 코to je hladnije vrijeme, to ga dulje treba mijesiti. Tijesto se **NE SMIJE** prestati mijesiti dok ne postignete da vam se tijesto na pritisak prsta ne vrati u prvobitno stanje. Podlogu smijete lagano nabra코niti ali ne pretjerujte - tijesto treba biti lagano i uglavnom vodenasto.\n\nKad ste gotovi s mije코enjem, blago nauljite neku posudu, te polo쬴te tijesto u nj. Prekrijte ga folijom ili krpom. Ako niste znali tehniku mije코enja, ostavite tijesto da odstoji **BAREM 6 SATI**. Stajanjem dopu코tate da se sav onaj gluten koji niste uspjeli povezati mije코enjem pove쬰 sam od sebe. Ako ste mijesili tijesto strojem ili ste vje코ti u mije코enju, bit 캖e dovoljno da tijesto odstoji 2 sata, ali ja vam preporu캜am da ga isto ostavite na miru preko no캖i. Ako ni코ta, pobolj코at 캖e okus i dozvoliti tijestu da se dosta digne. Tijesto treba ostaviti u zamra캜enom prostoru na sobnoj temperaturi. Ako je temperatura ve캖a od sobne, tijesto je bolje staviti u fri쬴der.\n\n## Dobivanje umaka\n\nPrimjenite *mise en place* u smislu sastojaka za umak - nasjeckajte pola glavice luka na 코to manje komadi캖e mo쬰te, zgnje캜ite re쬬nj 캜e코njaka. Stavite maslac (ili 코to ve캖 imate za mazivo) u lonac (stavite toliko da prekrijete lonac barem onom debljinom koliko vam je debelo nasjeckan luk), pri캜ekajte da se malo zagrije. Temperatura mora biti dovoljno niska da maslac ne postigne temperaturu dimljenja, 코to zna캜i da se ni maslinovo ulje ne캖e dimiti (jer maslac ima ni쬿 temperaturu dimljenja). U vru캖i maslac stavite nasjeckani luk i gnje캜eni 캜e코njak te ih polako pr쬴te, uz povremeno mije코anje. Nakon par minuta, dodajte 쬷i캜icu meda (ili 쬷i캜icu 코e캖era) i 쬷i캜icu worcestershire umaka (ako ga imate), sve promije코ajte i nastavite pr쬴ti na niskoj temperaturi. Cilj nije karamelizirati luk, nego ga omek코ati. Za to 캖e vam trebati oko 10-tak minuta pr쬰nja.\n\nNakon 코to se to postigne, u lonac stavite raj캜icu. Ako koristite pelate stavite uglavnom same raj캜ice, ne previ코e onog soka, a oni 캖e se trebati dulje kuhati (jer nisu kuhani i jer se trebaju raspasti). Ako koristite pastu, potrebno je dodati i odre캠enu koli캜inu vode uz nju. Koli캜inu svega mogu izraziti u pasiranoj raj캜ici - potrebno je 500 ml rje캠e, ili oko 350 ml gu코캖e pasirane raj캜ice. Ako ne znate koju imate, stavite vi코e, jer bolje je imati vi코e umaka nego premalo, to se pojede.\n\nPo potrebi dodajte sol, a stavite i par listi캖a bosiljka te dva prstohvata ru쬸arina. Sve kuhajte uz povremeno mije코anje na srednje-niskoj vatri dok se pelati ne raspadnu, ako ih koristite, a generalno dok se umak ne zgusne. 콯elite imati ne코to 코to je na pola puta izme캠u pasirane raj캜ice i paste.\n\nNakon 코to vam je umak gotov, fino raskuhan, konzistentan i gust, maknite lonac s vatre i pustite da se ohladi. Ako ste tijesto stavili da odstoji cijeli dan, umak mo쬰te s poklopcem nakon 코to se malo ohladi staviti u fri쬴der.\n\n## Nakon 코to tijesto odstoji\n\nNakon stajanja tijesto je potrebno opet kratko mijesiti. Tijesto bi trebalo biti jako napuhnuto, a vama je cilj dovesti ga u konzistentno stanje. Ne bi trebali dodavati bra코na, a ako vam se tijesto lijepi, ra캠e si malo nauljite ruke. Nakon 코to ste umijesili tijesto, preformirajte ga u kuglu i ostavite sa strane.\n\nAko ne koristite mozzarellu (ili koristite stvarno tvrdu mozzarellu), potrebno je naribati sir. Na pizzu, vjerovali ili ne, ide PUNO sira. Zapravo, sira obi캜no ima i vi코e od umaka. Moja preporuka za pizzu ove veli캜ine je bar 250g sira, ali ovo ide od oka i ovisi o preferencama onih koji 캖e tu pizzu jesti. Ja volim svoju pizzu **POTPUNO** prekriti sirom, da se jedva vidi umak. Preporuka je da sir ribate na **코to ve캖e** komade mo쬰te - ina캜e se mozzarella trga u komadi캖e i stavlja na pizzu.\n\nAko vam je umak bio u fri쬴deru, izvadite ga van da do캠e na sobnu temperaturu.\n\n## Zagrijavanje pe캖nice\n\nAko imate kru코nu pe캖 ili pizza kamen, trebali bi krenuti zagrijavati pe캖nicu na maksimalnu temperaturu bar sat vremena prije po캜etka rada na tijestu. Ako to nemate i koristite obi캜nu pe캖nicu i lim za pe캜enje, onda to mo쬰te krenuti raditi tik prije oblikovanja tijesta (oko 15-30 minuta prije stavljanja pizze u pe캖nicu). Postavke su maksimalna temperatura, i oba grija캜a bez ventilatora.\n\n## Oblikovanje tijesta\n\nLagano pobra코nite podlogu na kojoj radite. Tijesto je potrebno oblikovati u oblik lima za pe캜enje kojeg imate (ili kru쬹i oblik ako imate kamen za pizzu). Ako imate okrugli oblik, poku코ajte od tijesta prvo rukama na캜initi spljo코teni valjak. Ako vam je potrebni pravokutni oblik, poku코ajte rukama otprilike na캜initi oblik lima za pe캜enje. Nakon 코to ste to napravili, lagano pobra코nite tijesto.\n\nAko koristite ruke, kao 코to bi trebali, nje쬹o priti코캖ite sredinu tijesta i lagano ga razvla캜ite prema rubovima. Ne treba to biti ujedna캜eno, ali naravno poku코avajte svaki dio jednako razvla캜iti i odr쬬vati otprilike jedinu debljinu centra. Ako ciljate na okruglu pizzu i mo쬯a to znate, mo쬰te poku코ati bacati i vrtit tijesto, razvla캜iti ga centripetalnom silom (tj. nemogu캖no코캖u savladavanja iste od strane tijesta). Ako to jo코 niste usvojili, slobodno ga razvla캜ite do zadane duljine rukama. Tijesto ne캖e biti upropa코teno ako nije jednoliko debelo, samo ako vam negdje pukne. Zato se samo trudite da ne pukne, a donekle nejednaka debljina je zapravo bonus! \n\nAko ga pak razvla캜ite valjkom, 캜inite to bez ponavljanja - valjajte u jednu stranu i ne vra캖ajte se s valjkom natrag, ve캖 od mjesta gdje ste po캜eli valjajte u suprotnom smjeru. Ako ve캖 valjate, neka vam tijesto bude jednako debelo svugdje.\n\nTijesto razvla캜ite dok nije tanko otprilike kao 2-3 debljine nokta na rukama. Pizza s debelim tijestom je kruh s pizza nadjevom, a ne pizza.\n\n### Ako ne koristite kru코nu pe캖 ili pizza kamen\n\nLagano prema쬴te lim tankim slojem ulja (po mogu캖nosti maslinovim ako nemate papir, a ako imate onda je svejedno). Ako imate papir za pe캜enje stavite ga u lim za pe캜enje. On je izrazito koristan da dobijete onako malo mlohavo tijesto od dolje kao u pizzerijama. Zbog ulja 캖e se on lijepiti, 코to je korisno. Ulje tako캠er pru쬬 i bolji kontakt s limom, tako da 캖e biti manji relativni temperaturni 코ok izme캠u topline zraka i topline papira izolatora. Papir zapravo simulira kru코nu pe캖 gdje je podloga ne코to hladnija od zraka i vatre s jedne strane pizze jer se pona코a kao izolator. Ako imate kukuruznog bra코na, lagano pobra코nite taj papir u limu prije polaganja tijesta, no nema neke koristi od pobra코njivanja nauljenog lima ako nemate papir.\n\n### Nastavak s tijestom\n\nPolo쬴te tijesto u lim, presavinjaju캖i rubove pizze koji eventualno budu izvan lima. Ako ste pizzu rastezali rukom, ti rubovi bi vam eventualno mogli biti samom rubu lima, pa ne trebate ni코ta presavijati. Prema쬴te tijesto s tankim slojem ulja (po쬰ljno maslinovog).\n\nStavite tijesto na 5 minuta u pe캖nicu. Nakon tih 5 minuta, izvadite tijesto i dopustite par minuta da se malo ohladi. Prema쬴te tijesto s va코im umakom. On bi trebao biti jako koncentriran - u skladu s time ga prema쬴te dovoljno tanko (ne bi ga ionako trebali imati previ코e) - 코to je koncentriraniji, to je potreban tanji sloj. Kad osobno radim pizzu, moj umak je dovoljno gust da je premazan oko duplo tanjim slojem od debljine tijesta, i dosta je tamne crvene boje. Neki ljudi tako캠er umjesto da premazuju umak bacaju umak to캜kasto na pizzu, a zatim praznine popunjavaju sirom. Ovo je tako캠er opcija, ali ne preporu캜am po캜etnicima, komplicirani su razlozi za코to je i kad je ovo bolje.\n\nNakon 코to ste premazali tijesto umakom, stavite sir. Podsje캖am, u slu캜aju mozzarelle se lome komadi캖i i stavljaju na pizzu. U slu캜aju naribanog sira, stavlja se sigurno toliko da barem jednim slojem prividno prekrije umak, ali kao 코to sam rekao, ja ga stavim dovoljno da se umak uop캖e ne vidi (povr코ina pizze mi je uvijek bijelo 쬿ta ako nema drugih nadjeva).\n\nNakon sira, dodaju se dodaci. Sastojci koje bih ja mogao preporu캜iti su:\n\n- bosiljak (klasi캜an sastojak)\n- pepperoni (ljuta vla쬹a kobasica, jedina ameri캜ka modifikacija na koju mi se ne bljuje, dodaje se kad je pizza 2/3 gotova)\n- pr코ut (dodaje se kad je pizza 2/3 gotova, da ne izgori)\n- maslina (dodaje se nakon 코to je pizza gotova)\n\nNeki od egzoti캜nih (ali teoretski i prakti캜no superiornih) dodataka na pizzu su:\n\n- ananas (u komadi캖ima, hejteri su jebeno glupi)\n- jabuka (u kri코kicama, iz sli캜nog razloga kao i ananas, bolje od ananasa za pizze s vi코e sira)\n- naribani 캠umbir (ludo za pikantne pizze)\n\nOstali sastojci su po volji, ove koje sam ja nabrojao su neki za koje vjerujem da ne naru코avaju temeljnu filozofije pizze, a ovi egzoti캜ni rje코avaju neke od nedostatke pizze.\n\n## Finalizacija\n\nAko imate sprej bo캜icu, temeljito posprejajte rubove pizze s vodom. Kad ka쬰m temeljito, mislim ono, skoro da se cijedi. Ovo 캖e pridonijeti razvoju hruskave kore pizze, sli캜no kao 코to je i premazivanje uljem kod prvog pe캜enja pomoglo. Pizza sa sastojcima sada se vra캖a u pe캖nicu. Na istim postavkama mora biti jo코 barem 5 minuta, nakon 캜ega se, ako je to mogu캖e, uklju캜uje mod gornjeg grija캜a + ventilatora. Minutu nakon uklju캜ivanja ovoga, dodaju se sastojci osjetljivi na toplinu (npr. pepperoni, pr코ut, ananas, jabuka itd.). 3 minute nakon toga, ili prije ako pizza krene sme캠iti, pizzu je potrebno izvaditi iz pe캖nice.\n\nNakon 코to se pizza izvadi iz pe캖nice, potrebno ju je ostaviti da se hladi bar 5 minuta. Razlog ovome je 코to npr. ako nemate mozzarellu ili imate rje캠i umak, pizza 캖e biti u teku캖em, masnom stanju. Treba je ostaviti da nije tako teku캖a, a i da tijesto malo o캜vrsne (jer bi donji dio tijesta trebao biti relativno mekan, isto), nakon 캜ega se re쬰 i servira. Ako netko voli ili to radi iz tradicije, mo쬰 je posuti s malo origana (iako origano nije tradicionalan sastojak za pizzu).\n\n# Kona캜ne misli\n\nDobru pizzu je doista te코ko napraviti. Osobno sam napravio toliko pizza da sam prestao brojati, ali sigurno oko 100-tinjak. Tek nakon 15. pizze sam krenuo raditi bolje pizze nego moja majka, ali to je zato 코to sam kretao iz nule, jer sam umjesto strojem uvijek rukama mijesio tijesto i nisam se oslanjao na prethodno znanje. Ovo znanje koje sam podijelio s vama je ne코to 코to sam nau캜io kroz 80-tak pizza. Ovih ostalih 20-tak u캜io sam tehnike, npr. mije코enje, tajminge i postavke pe캖nice itd.\n\nNadam se da 캖e vam ovo uvelike pomo캖i napraviti finu pizzu, pogotovo sad kad su vam svi doma i kad ih mo쬰te zadiviti ;)",
      "votes": {
        "upvoters": [
          "Amariska",
          "Amon",
          "Darla",
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "Jakic007",
          "Jurica",
          "Murin",
          "Red_Baron",
          "Svarog (Veles)",
          "Worly",
          "[deleted]",
          "[deleted]",
          "adrian7000",
          "allophone",
          "amnael",
          "bb8 (zaza)",
          "boban_rajovic (ravindrababu ravula)",
          "feel_d_boot (iNut)",
          "hrljavi_caval (rljavi캛aval)",
          "idontwannabemyself",
          "indythedog",
          "latica",
          "member",
          "moose (sugar BoOo!!)",
          "potemkin (meriMerino)",
          "thelonewanderer (Du 칛r inte min chef!)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Mulder"
        ],
        "wtf": [
          "Elbakyan (interlo)",
          "in1"
        ],
        "tuga": []
      }
    },
    "2724": {
      "poster": "Asura (Asura)",
      "content": "@micho#2455  Jedan tip, ako hoces da se tijesto digne vise nego inace, nakon sto imas smjesu, prije nego sto se krene mijesiti, ostavi jedno pola sata sat na toplom mjestu, recimo 30ak stupnjeva.\n\nEDIT: ja osobno ne volim ovaj korak jer  kada se digne previse, imam osjecaj da jedem vise nego sto bih trebao 游땐",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2726": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Asura#2724 Ovo ina캜e nisam nikad radio jer koristim instant kvasac (dry active yeast) pa sam automatski pretpostavio da 캖e se to sve samo dignuti, ali u pravu si, neki ljudi to i rade, a treba probati (kao i kod ostatka opcija koje sam popisao za tijesto) 코to kome najbolje odgovara.\n\nEDIT: Probao, works well, a mo쬯a i imam bolji postupak za tijesto inspiriran time, ali to jo코 moram probati.",
      "votes": {
        "upvoters": [
          "Asura (Asura)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3439": {
      "poster": "[deleted]",
      "content": "**Brownie in a mug**\n\n*쬷ica= velika 쬷ica (s kojom se jede juha) izravnata\n\n2 쬷ice glatkog bra코na\n\n2 쬷ice 코e캖era (po vlastitom ukusu, ja sam stavila 1 )\n\n1 쬷ica kakaa u prahu (za kola캜e)\n\n1/4 쬷ice pra코ka za pecivo\n\nprstohvat soli\n\n1 쬷ica ulja\n\n3 쬷ice mlijeka\n\n1 mala 쬷ica nutele ili komadi캖i 캜okolade\n\nmalo ruma (opcionalno)\n\nUzeti 코alicu koja mo쬰 u mikrovalnu. Ja sam uzela onu manju za kavu. Izmije코ati sve suhe sastojke te dodati teku캖e. Dobro promije코ati. Smjesa treba biti srednje gusto캖e, ne kao tijesto, ali ne ni kao tijesto za pala캜inke. Ako smatrate da je malo pregusto dodajte jo코 malo mlijeka. 콯li캜icu nutele staviti na sredinu smjese i malo prekriti, ali se i ne mora (kako bi u toj sredini ostala nutela - zna캜i ne promije코ati) A ako stavljate komadi캖e 캜okolade onda promije코ati. Staviti 코alicu u mikrovalnu na 1 minutu.\n\nNa kraju po 쬰lji se mo쬰 posut 코e캖erom u prahu, dodat sladolet na vrh, i to je to :)\n\n![](assets/2020-03-26/00034.jpeg)",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Amariska",
          "Amon",
          "Emma63194",
          "Filemon",
          "Jakic007",
          "Jezza (Clarkson)",
          "KitKat (H(x))",
          "M-16",
          "Mioch",
          "Ollie",
          "Red_Baron",
          "SuperSjajan3",
          "Svarog (Veles)",
          "ViBorg",
          "Worly",
          "__builtin_popcount (std::popcount)",
          "adrian7000",
          "amnael",
          "bb8 (zaza)",
          "brbrbr",
          "djeno",
          "hrljavi_caval (rljavi캛aval)",
          "idontwannabemyself",
          "mAcaLukas (mAca Lukas)",
          "soplagaitas (sopla)",
          "thelonewanderer (Du 칛r inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3587": {
      "poster": "GTX9800",
      "content": "Netko je u nekoj temi napisao kako izbje캖i potrebu za kvascem. Mislim da je bilo otprilike da se dio tijesta nekako sa캜uva pa iz njega ponovno napravi novi kruh i tako u nedogled. Zna netko na 코to mislim? Bitte und danke!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3599": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@GTX9800#3587 Jel ima neki razlog za코to bi to radio umjesto da koristi코 samo kvasac? Jer pazi, tu se sigurno mora코 brinuti o kvarenju i upitno je kakve bi rezultate imao s tim, a tro코ak ti mo쬰 biti samo ve캖i.\n\nVjerujem da se to bazira na principu da komadi캖 tijesta koji ima kolonije tih gljivica il 코to ve캖 se mo쬰 mno쬴ti ako ima 코krobastu podlogu, npr. drugi komad beskvasnog tijesta.",
      "votes": {
        "upvoters": [
          "GTX9800",
          "Svarog (Veles)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3600": {
      "poster": "Filemon",
      "content": "@GTX9800#3587 \n\npretpostavljam da misli코 na sourdough kruh, za 코to treba코 nabaviti ili pripremiti starter",
      "votes": {
        "upvoters": [
          "GTX9800",
          "Svarog (Veles)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3615": {
      "poster": "[deleted]",
      "content": "@GTX9800#3587 ako nema코 kavasac poslu쬴t 캖e i pra코ak za pecivo ( naravno nece bit ka sa kvascem, ali isto moze dobro ispast), a ako nemas ni to onda ce posluzit soda bikarbona zajedno s octom koji bi triba dat isti efekt ka i prasak za pecivo :)",
      "votes": {
        "upvoters": [
          "Filemon",
          "GTX9800",
          "Murin",
          "Svarog (Veles)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3624": {
      "poster": "GTX9800",
      "content": "Razlog je 코to 쬴vim u selu. Situacija je takva da lokalni du캖ani nemaju uvijek kvasca, a sad treba i propusnica za ulazak u grad pa sam mislio iskoristiti neki life hack. :D",
      "votes": {
        "upvoters": [
          "Murin",
          "[deleted]",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3635": {
      "poster": "Amali (Amajli)",
      "content": "@FERella#3439 kako bi ovako nesto napravio netko tko nema mikrovalnu?",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "M-16",
          "Svarog (Veles)",
          "[deleted]",
          "amnael",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3638": {
      "poster": "[deleted]",
      "content": "za 코to 캖e vam kvasac?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "ViBorg"
        ],
        "wtf": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "3640": {
      "poster": "[deleted]",
      "content": "@moonlight#3638 krkaju se ugljikohidratima ko budale, kad krenu bolesti bi캖e pomoz doktore nisamznao",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Bobinator"
        ],
        "wtf": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "3648": {
      "poster": "soplagaitas (sopla)",
      "content": "### zobena ka코a s kakaom, bananom i jabukom\nU lon캜i캖 staviti zobenih pahuljica, jednu zgnje캜enu bananu, jednu 쬷icu kakaa (za kola캜e) i mlijeko - omjeri po volji, ja sam stavila 4 쬷ice pahuljica (to je konkretna porcija, mo쬰 i manje) i otprilike 10 쬷ica mlijeka (uglavnom da pokrije pahuljice pa jo코 malo). To sve skupa kuhati mije코aju캖i dok ne proklju캜a. Servirati u zdjelicu i dodati narezane jabuke. Gotovo u manje od 10 minuta, fino i zasitno!\n>!![](assets/2020-03-26/00059.png)",
      "votes": {
        "upvoters": [
          "Amariska",
          "Filemon",
          "HARAmara (decko_sa_balkana)",
          "M-16",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "djeno",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "thelonewanderer (Du 칛r inte min chef!)"
        ],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3683": {
      "poster": "lup",
      "content": "@GTX9800#3587 evo ja upravo radim sourdough jer nije bilo kvasca u trgovini, ugl. jako lagano samo zahtijeva 5 min posla svaki dan i moras bacit nesto brasna.\n\nja sam poceo s kvascem u prahu, ugl se moze i bez ali traje par dana vise i ima vecu sansu da propadne. pomjesas pakung kvasca, jednaku kolicinu vode i brasna (psenicnog, lol) u staklenku, napunis do negdje polovice. svaki dan u isto vrijeme odbacis cca 50% mase (ili iskoristis za kruh) i stavis toliko brasna i vode. ak se nakupi voda na vrhu znaci da stavljas previse vode, ak je hrskav je previse brasna. ako bude smede/rozo/mirisi ko sir znaci da si sjebo, inace je valjda ok, mozes guglat. kvasac/pivo/alkohol miris je ok, iako alkohol znaci da trebas ipak malo cesce \"hraniti\" brasnom i vodom. ak ti se ne da radit kruh i hranit svaki dan stavi u frizider i onda to sve radis jednom tjedno. to je otprilike sva magija, glhf, ak mislis da nije dovoljno zajebano potrazi recepte na youtubeu, skoro gore nego craft piva brija.",
      "votes": {
        "upvoters": [
          "GTX9800",
          "__builtin_popcount (std::popcount)",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3685": {
      "poster": "[deleted]",
      "content": "@Amali#3635 vidila san na nekom videu da su stavili u duboku tavu salicu i poklopili poklopcem te stavili plocu na srednju temperaturu nekih 15 min, al mislim da je u tom slucaju bolje napravit regularni brownie u plehu i stavit u pecnicu",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3692": {
      "poster": "idontwannabemyself",
      "content": "@GTX9800#3587 \n\nrekla bih da je ovo dobar uvod za sourdough, iako je malo time-consuming (tipa tjedan dana pripreme), ali barem sad ima vremena 游뗶\n\nedit: kasnim,  ali @lup je dosta dobro objasnio ukratko \n>! https://www.youtube.com/watch?v=7-F2qZNOdNs",
      "votes": {
        "upvoters": [
          "GTX9800",
          "Koalefant",
          "__builtin_popcount (std::popcount)",
          "lup"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "3848": {
      "poster": "lup",
      "content": "moj prvi sourdough kruh \\:D \n\n(sljedio sam ovaj recept: [link](https://www.youtube.com/watch?v=4gmCrbBGQy0))\n\n![](assets/2020-03-27/00007.jpeg)",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "GTX9800",
          "Murin",
          "Svarog (Veles)",
          "ViBorg",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "brbrbr",
          "hrljavi_caval (rljavi캛aval)",
          "idontwannabemyself",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4182": {
      "poster": "[deleted]",
      "content": "**JEDNOSTAVNI KRUH**\n- 450 g glatkog bra코na\n- 450 ml mlake vode \n- 1 vre캖ica suhog kvasca\n- 쬷i캜ica soli\n- 쬷i캜ica 코e캖era\n\nSve suhe sastojke promije코ati u zdjeli te dodati vodu. Konzistencija tijesta 캖e biti teku캖a pa je najbolje umije코ati sve kuha캜om. Mije코ati 10ak minuta. I dalje 캖e tijesto biti teku캖e, ali to tako treba biti . Prekriti zdjelu prozirnom folijom ili krpom te ostaviti da se di쬰. Ja sam ostavila nekih 40ak min, ali mo쬰 i du쬰. 10ak minuta prije nego ga stavite u pe캖nicu zagrijte je. Izliti tijesto u kalup te pe캖i 50ak minuta na 180 춿C na캜in gore - dolje (zna캜i bez ventilatora).Mo쬯a 캖e ga trebati i du쬰 pe캖 pa svakako provjerite prije nego ga izvadite iz pe캖nice. Pustite ga da se ohladi.\n\n![](assets/2020-03-28/00012.jpeg)",
      "votes": {
        "upvoters": [
          "M-16",
          "[deleted]",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5431": {
      "poster": "Lenobius",
      "content": "Zbog ovog socijalnog distanciranja mi starci moraju radit od doma, ali su zauzeti cijelo jutro pa onda na mene pada du쬹ost kuhanja (bratov doseg su tortellini s vrhnjem), 코ta zna캜i da 캖e mi se skillovi brutalno pobolj코at do kraja ovog svega. Thankfully ne moramo skupno kao obitelj jest samo carbs, imam recept za augmented carbs aka\n\n### Ri쬺to s patlid쬬nom i paradajzom\n\n- 1,5 코alica ri쬰\n- 0,5 캜a코e vina\n- 1,5 litra povrtnog temeljca (i povrtne kocke u 1,5 l vode su ok)\n- 2-3 patlid쬬na\n- 4 paradajza srednje do ve캖e veli캜ine nasjeckana na sitno\n- 0,5 코alice ribanog parmezana (u ovim corona vremenima di ne 쬰lim i캖 u du캖an ako ne trebam sam iskoristio trapist koji sam imao u fri쬴deru i ispalo je skroz ok)\n- 1 srednji luk nasjeckan na sitno\n- 캜e코njak (you measure that with your heart ali meni funkcionira 4 re쬹ja) nasjeckan na sitno\n- za캜insko bilje (dobro funkcioniraju bosiljak, origano ili timijan)\n- sol\n- papar\n- maslinovo ulje\n\nZagrijati pe캖nicu na 230 stupnjeva. Patlid쬬ne oprati, odrezati i baciti vrh i dno, prepoloviti po du쬴ni pa svaku polovicu jo코 zarezati no쬰m do ko쬰, ali ne prerezati ko쬿. Pleh oblo쬴ti aluminijskom folijom i nauljiti. Nasoliti patlid쬬ne, polo쬴ti na pleh, prerezanom stranom prema dolje i staviti da se pe캜e 20-ak min ili dok se ko쬬 patlid쬬na ne sme쬿ra.\n\nZagrijati ulje u pli캖em loncu i unutra staviti luk. Dinstati par minuta, dok luk ne omek코a i postane staklast (4-5 minuta). Dodati 캜e코njak i dinstati jo코 jedno 30 sekundi dok ne zamiri코i. Dodati paradajz i za캜insko bilje, kuhati jedno 20 minuta dok se malo ne zgusne. Pred kraj nasjeckati patlid쬬n u kocke i dodati u paradajz. Posoliti po ukusu.\n\nZagrijati temeljac do kr캜kanja. U velikom loncu, dodati ulja toliko da dno bude prekriveno. U to staviti ri쬿 i pustiti 2-3 minute. Od ove to캜ke na dalje cijelo vrijeme mije코ati, pogotovo po dnu jer 캖e se u suprotnom zape캖i za dno. Dodati vino i pustiti da ispari. Dodati mje코avinu paradajza i patlid쬬na i promije코ati dobro. Dodavati temeljac 코eflju po 코eflju. Svaki put kad dodamo treba pustiti da ri쬬 upije vi코ak teku캖ine i tek onda dodati jo코 jednom. Cijeli proces dodavanja temeljca treba trajati otprilike pola sata. Kad dodamo sav temeljac i upije se, unutra umije코ati sav sir. Tek nakon 코to dodamo sir isprobati treba li jo코 soli i papra ili za캜inskog bilja i dodamo (znalo mi se dogodit da dodajem kroz proces kuhanja i bude skroz ok, al kad dodam sir postane preslano).\n\nJako je fino kad se poslu쬴 odmah nakon kuhanja jer je ful kremasto, ali ako preostane poslije ru캜ka, mo쬰 se sa캜uvati i pojesti za ve캜eru.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "idontwannabemyself",
          "indythedog",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5549": {
      "poster": "djeno",
      "content": "@soplagaitas#3648 \n\nMoze se i s mikrovalnom ako vam se neda na vatri u loncu samo stavite sve u zdjelu i  manje mlijeka sve boila i bude dosta fin. Ja si radim kao  \"zdraviju\" opciju s vodom al si ne stavim samo vode vec stavim malo i wheya od vanilije pa bude bas fino.",
      "votes": {
        "upvoters": [
          "rija",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7375": {
      "poster": "NekocBraca",
      "content": "Zelio bih kupiti neki noz kao poklon, ali ja ne kuham pa nema pojma niti od kuda krenuti. \n\nBudzet mi je 200-300-400 kn. Jel se moze za te novce naci neki noz koji je bolji od ovih \"obicnih\"?\n\nS obzirom na trenutno stanje, narucivanje preko interneta mi je jedina opcija.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7377": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@NekocBraca#7375 Koji tip no쬬? Ima puno lijepih no쬰va od 캜elika damaska primjerenih za poklon, ali isto tako ima i puno tipova no쬰va.",
      "votes": {
        "upvoters": [
          "NekocBraca"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7392": {
      "poster": "NekocBraca",
      "content": "@micho#7377 \n\nNeki general purpose? Ili ako se specijalizira onda mozda za meso? Uglavnom ovako za svakodnevnu upotrebu osobi koja svakodnevno kuha/uci/eksperimentira.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7400": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@NekocBraca#7392 Aha, onda no 코efa kuhinje. Preporu캜io bih ti [W칲sthof 16 cm](https://www.amazon.de/dp/B00009ZK07/), jedan od boljih no쬰va za po캜etnike.",
      "votes": {
        "upvoters": [
          "NekocBraca"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8953": {
      "poster": "iNavy (mornar Ica)",
      "content": "# La쬹e ma캠arice\n\n**sastojci**: 8 dl vode, 5 쬷ica 코e캖era, 200 g 캜okolade za kuhanje, 250 g margarina (preferiram upotrebljavati onaj za kreme no vjerujem da mo쬰 i obi캜ni), 1 kg malih keksa (tipa sport keksi, no mo쬰 bilo kakva varijacija na temu toga), _za glazuru_ 200 g 캜okolade za kuhanje, 500 ml slatkog vrhnja\n\n**priprema**: na 코tednjaku u loncu pomije코ati u vodi 코e캖er, 캜okoladu za kuhanje te margarin (br쬰 캖e se otopiti ako ih prethodno podijelite na manje komade), nakon 코to se to sve otopi dodavati malo po malo kekse te ih mije코ati da se utope u smjesi kako bi omek코ali, nakon toga tu smjesu staviti u protvan\n\nza glazuru otopiti 캜okoladu (prethodno razlomljenu na manje komade) u slatkom vrhnju te time preliti smjesu\n\nostaviti u fri쬴deru da se ohladi i stisne\n\nvrijeme priprave: manje od sat vremena (dakle relativno brzo)\n\njednostavnost: vrlo jednostavno po meni jer nije potrebno koristiti pe캖nicu\n\nokus: procijenite sami :^)",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "NekocBraca",
          "__builtin_popcount (std::popcount)",
          "indythedog",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": [
          "mentally_disturbed_llama"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "15110": {
      "poster": "idontwannabemyself",
      "content": "### Slani vafli \n*(waffles bolje zvu캜i, ali hrvatski jebiga)*\n\nImali smo ne코to preostalog pire krumpira od ru캜ka pa rekoh za코to ne slo쬴ti ne코to od toga.\n\nVe캖inom je koli캜ina svih sastojaka odokativna, ali op캖enito na zdjelicu **pire krumpira** (zna캜i koli캜ina pirea od jednog ve캖eg krumpira) ide jedno **jaje** i onoliko **bra코na** koliko treba da smjesa vi코e nije runny, ve캖 da se po캜inje blago odvajati od posude, ali da je i dalje kremasto.\n\nA sad, ostali sastojci su samo plod va코e ma코te. Ja sam u svoje strpala mladog luka, malo curry paste i mozzarelle (bitno da se iz nje dobro istisne 코to vi코e vode).\n\nWarning, ovisno o ure캠aju koji koristite za pe캜enje, duljina pe캜enja varira - ja sam pekla jednu turu cca 20 minuta (ali to zato 코to nemam pravi waffle maker, ve캖 imam toster u kojem mijenjam plo캜ice pa je slabiji).\n\nAlso, tekstura je malo mushy iznutra zbog pire krumpira, ali to sve ovisi o vrsti krumpira koji se koristi za sam pire i o koli캜ini bra코na u smjesi. \n\nKao bonus, na vrh sam za drugu turu (aka zadnji komad od ukupno 3, koliko sam dobila od ove smjese)  stavila jo코 mozzarelle i poklopila toster/waffle maker na 2-3 sekunde tek toliko da se taman otopi da bude stringy 游땏 \n>! ![](assets/2020-04-27/00028.jpeg) ovaj plating je kao fancy-ish jer sam se nekako morala utje코it nakon baza danas - ina캜e bih to smazala tak ionak",
      "votes": {
        "upvoters": [
          "Amariska",
          "Amon",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Joskica",
          "Koalefant",
          "Lenobius",
          "Mioch",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "ink",
          "thelonewanderer (Du 칛r inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25770": {
      "poster": "__builtin_popcount (std::popcount)",
      "content": "Iz fri쬴dera sam uzeo piletinu i mlince koje je mama ju캜er napravila, narezao maslaca i stavio na mlince da se rastopi dok se griju u mikrovalnoj.\n\n![](assets/2020-05-16/00031.png)",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "KitKat (H(x))",
          "Lenobius",
          "MsBrightside",
          "Ollie",
          "Svarog (Veles)",
          "bb8 (zaza)",
          "iNavy (mornar Ica)",
          "idontwannabemyself",
          "lup",
          "soplagaitas (sopla)",
          "turunturu (Cement)",
          "wutangfan (HugoStiglitz)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Bobinator",
          "Emma63194",
          "FICHEKK",
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "KitKat (H(x))",
          "Red_Baron",
          "SuperSjajan3",
          "amnael",
          "bb8 (zaza)",
          "ivicato",
          "lup",
          "njofra",
          "spejs",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "77038": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "# Studentska \"hobotnica\"\n\nPoku코aj emulacije hobotnice krakovima Humboldtove lignje. Za코to? Hobotnica je 100+ kn/kg i kupuje se u komadu, Humboldtova lignja je 40-60 kn/kg i kupuju se krakovi. Dakle, za dosta manje love i uz manje otpada (nema otpada) da se napraviti prili캜no ukusno jelo.\n\n## Na캜in obrade\n\nHumboldtova lignja je vrlo 쬴lava, no obrada je sli캜na kao i kod hobotnice. Prvi korak je odmrzavanje lignje. Ovo 캖e trajati nekoliko sati. Nakon 코to se odmrzne, isperite je pod vodom 캜ime 캖ete ukloniti potencijalne kontaminate. Stavite vodu da proklju캜a, nakon 캜ega stavite krakove u nju i stavite poklopac. Sve bi trebalo vrlo sporo br캜kati pa nakon 코to voda ponovno zavrije stavite 코tednjak na najni쬿 temperaturu. Kuhajte ovako 2 sata. Neki ljudi bi mo쬯a posolili vodu, ali osobno ne volim ovakav tretman jer ne doprinosi jelu.\n\nNakon kuhanja, uzmite cjedilo i ocjedite vodu. Isperite lignje hladnom vodom te odvojite ko쬿 i pipke od lignje - ovo bi trebalo biti vrlo jednostavno, zna캜i trebalo bi padati samo od sebe. Ove ostatke generalno ne캖ete baciti, ali se mrvicu druk캜ije koriste. Ja ih volim ispr쬴ti. Sad bi ono 코to imate trebalo izgledati ovako:\n\n![](assets/2020-10-02/00012.jpeg)\n\nTu prestaje priprema i nastupaju recepti - mo쬰te koristiti krakove kao da su hobotnica, jedina je razlika 코to su tanji i mek코i. Oba svojstva su po쬰ljna.\n\n## Konkretan recept - Slatke lignje\n\nIako sam inicijalno mislio raditi salatu, trenutno nemam krumpira doma pa jbg. \n\n### Sastojci\n\n- 500g Humboldtove lignje\n- 2 쬷ice maslinovog ulja\n- polovica manje glavice luka\n- re쬬nj 캜e코njaka (ili pola 쬷i캜ice 캜e코njaka u granulama)\n- 쬷ica ke캜apa (koristio sam Heinz, dakle ni코ta posebno: paradajz, ocat, 코e캖er)\n- 쬷i캜ica vegete (ili sol i papar po 쬰lji)\n\n### Postupak\n\nUsitnite luk te krenite zagrijavati tavu s maslinovim uljem (mo쬰 i neko drugo, ali maslinovo je najbolje hehe). Ovo radite na srednje-niskoj vatri, ne samo iz razloga 코to maslinovo ulje brzo gori, ve캖 i zato 코to vam nije cilj ispr쬴ti lignje nego ih polagano zape캜i. Za ljude s termometrom - oko 150춿C. Nakon 코to se ulje malo zagrije, dovoljno da to mo쬰te osjetiti ako tavi pribli쬴te ruku, stavite nasjeckani luk u nj i ostavite.\n\nU me캠uvremenu, usitnite ko쬿 i pipke od lignji te ih odmah stavite u tavu i pecite. Ovo radite dok luk ne pozlatni.\n\nKrakove lignje nare쬴te - iako je oblik neva쬬n, mogu to biti trakice, plo코kice itd.; ja preferiram cilindre od oko 2.5 cm duljine, tj. duljine palca. Nakon 코to ih nare쬰te, uzmite 캜e코njak, zgnje캜ite ga no쬰m kako to ve캖 ide pa nasjeckajte. Stavite sve ovo u tavu i promije코ajte. Ako nemate re쬬nj 캜e코njaka, funkcionirat 캖e i 캜e코njak u granulama.\n\nOstavite minutu, nakon 캜ega dodajte 쬷icu ke캜apa i 쬷i캜icu vegete (ili soli i papra, koliko vam je potrebno, IMO vegeta je idealna za riblja jela), te promije코ajte jednom da se izmije코aju sastojci. Nakon 2 minute, promije코ajte jo코 jednom.\n\nNakon jo코 2 minute maknite tavu s plamena i servirajte jelo. Ja volim posipati per코in na to. Va코 kona캜an rezultat mogao bi biti sli캜an ovome:\n\n![](assets/2020-10-02/00013.jpeg)\n\nUsprkos za neke neatraktivnom izgledu, jelo je vrlo ukusno i podsje캖a na bolju verziju lignja na 쬬ru zbog te note slatko캖e koju daje ke캜ap.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Jakic007",
          "M-16",
          "Ovo_je_moj_nick",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "boban_rajovic (ravindrababu ravula)",
          "idontwannabemyself",
          "slip"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "STAGGER_LEE"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "78031": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "# Pizza v2\n\nWell turns out I was wrong xD Nau캜io sam kako napraviti napuljsku pizzu (jer sam nju htio cijelo vrijeme napraviti) i standardizirao sam mjere, pa nije sve od oka. Iako ju radim canotto style, zbog nedostatka adekvatne pe캜nice rubovi se ne dignu toliko pa na kraju bude kao napuljska (canotto ima rubove visoke kao kod deep disha, to je razlika). Recept je za jednu pizzu promjera 30 cm (za 1 gladnu osobu, ili 2 osobe koje 쬰le samo snack). Recept je sada puno jednostavniji.\n\n## Tijesto\n\n**Sa쬰tak**: 70% hidratacije 00 bra코na, 2% soli, 1% kvasca\n\n>! ### Sastojci\n> - 200g bra코na tipa 00 (ja koristim Farina, mo쬰 se na캖i u Konzumu, 10 kn/kg) ili tipa 1\n> - 140g mlake vode\n> - 4g soli (do maksimalno 6g, ako volite slanije)\n> - 2g aktivnog kvasca\n> - *쬷ica ulja^1 ili pola 쬷ice masti (neobavezno)*\n\n> ^1 - preporu캜ljivo maslinovo, ovo je radi okusa\n\n> ### Postupak\n> U zdjelu ulijte vodu te usipajte aktivni kvasac. Ostavite 10-15 minuta da vidite je li kvasac 쬴v. Kad se vratite, voda bi trebala biti mutna.\n> \n> Ako koristite masti koje su u krutom stanju na sobnoj temperaturi, kombinirajte ih s bra코nom ili ih rastopite prije sljede캖eg koraka.\n> \n> Stavite bra코no, sol i masno캖u u vodu te promije코ajte. Mije코ajte tako da svo bra코no u zdjeli pokupite smjesom.\n> \n> Sa strane ostavite tanjur s malo bra코na ili dio povr코ine s malo bra코na te premjestite tijesto iz posude na povr코inu.\n> \n> Krenite mijesiti tijesto - 쬰lite da mu se tekstura iz grube pretvori u glatku. Tijesto 캖e s ovom hidratacijom vjerojatno biti ljepljivo. Ako vam se lijepi za ruke, nemojte ga zasipavati bra코nom - nabra코nite ruke tap코anjem onog odlo쬰nog bra코na i nastavite mijesiti. Sasvim je prirodno da 캖ete ovo trebati ponavljati svakih 30 sekundi, ali na ovaj na캜in ne캖ete previ코e zeznuti tijesto. Ako vam se tijesto lijepi za povr코inu, lagano pobra코nite ili nauljite povr코inu. Preporu캜ljivo je da se tijesto mijesi na nekoj nepreljepljivoj povr코ini. NE KORISTITE anti-stick sprejeve i sli캜ne supstance, malo ulja radi istu stvar bez da kontaminira tijesto kemikalijama.\n> \n> Nakon 코to tijesto postane glatko, odlo쬴te ga na neku tacnu ili u zdjelu. Prekrijte tijesto vla쬹om krpom ili stavite plasti캜nu foliju na zdjelu kako se tijesto ne bi osu코ilo i ostavite bar 3 sata, po쬰ljno do 6 sati da se di쬰. Mo쬰te dobiti kra캖e vrijeme dizanja tako da stavite vi코e kvasca, ali okus 캖e biti ne코to druga캜iji (lo코iji).\n\n> ### Bonus: kako mijesiti za neznalice\n> Ako nemate neku svoju tehniku, najefektivnija jednostavna metoda je sljede캖a:\n> - radite od tijesta valjak, tj. prilikom mje코enja oblikujte ga u valjak, zmijicu, kako god to 쬰lite nazvati\n> - kad ste dobili tijesto duga캜ko 20+ cm, preklopite krajeve i stopite ih dalje u valjak, ponavljaju캖i prethodni korak\n> - radite ovo dok niste zadovoljni teksturom tijesta\n\n> Ovo tu je nalik kontinuiranog valjanja tijesta i onda preklapanja tako da se prepolovi njegova duljina. To je ujedno i najjednostavniji na캜in kako efektivno povezati gluten. Sve ostalo je generalno previ코e zajebancije za mrvicu bolji rezultat, koji ionako nadma코ite samo boljim sastojcima ili kru코nom pe캖i.\n\n## Umak\n\n**Sa쬰tak**: oguljeni pelati iz konzerve ili minimalno za캜injena pasirana raj캜ica\n\n>! S obzirom na to da kod pelata iz konzerve ih prakti캜ki trebate samo usitniti 코tapnim mikserom, opisat 캖u 코to se mo쬰 napraviti ako imate pasiranu raj캜icu\n\n> ### Sastojci\n> - 75ml pasirane raj캜ice\n> - sol (po potrebi)\n> - 코e캖er (po potrebi)\n\n> ### Postupak\n> Well, jedino 코to ovdje trebate napraviti je pasiranu raj캜icu pretvoriti da ima okus kao prava kuhana raj캜ica. Zato su svi ostali sastojci po potrebi - to ovisi o brendu koji imate. Ja npr. s pasiranom raj캜icom iz Lidla, koja je za캜u캠uju캖e kvalitetna s obzirom na to da je vjerojatno najjeftinija na koju sam nai코ao trebam dodati tre캖inu 쬷i캜ice soli i prstohvat 코e캖era. Za shit-tier pasirane raj캜ice kao 코to je Podravkina 캖ete vjv trebati dodati vi코e sastojaka.\n> \n> Kad znate koliko sastojaka staviti, pomije코ajte ih s pasiranom raj캜icom. Ako je to 코to imate prevodenasto, morat 캖ete je zgusnuti.\n> \n> Ako trebate reducirati raj캜icu, to radite ispravanjem, ne 코krobom ili bra코nom. Ovisno o tome koliko ju trebate zgusnuti trebat 캖ete koristiti vi코e pasirane raj캜ice. Npr., ja ne moram ni코ta dodavati, dok bi kod Podravke vjerojatno trebali po캜eti s 100 ili 125 ml. Konzistencija koju 쬰lite mo쬰 se vidjeti u ovom videu (namje코teno je na **3:01**):\n\n> https://youtu.be/f32frig1s9w?t=181\n\n\n## Prije kombinacije sastojaka...\n\n**Sa쬰tak**: mozzarella/fior di latte, bosiljak i predgrijavanje pe캖nice\n\n>! Treba vam jo코 jedino **svje쬬 mozzarella** ili **fior di latte** i **svje쬴 bosiljak**, ali mo쬰 poslu쬴ti i koji god drugi sir 쬰lite samo ne캖e biti jednako fino. Osobno sam eksperimentirao s amerikaniziranim sirom (dakle sirom koji ima emulgator koji se trudi da pri velikoj temperaturi ne do캠e do razdvajanja masti i proteina), ali nisam mogao pobijediti okus i teksturu mozzarelle, iako je bilo bolje. Bolji su srednje mekani sirevi - mekani sirevi 캖e napraviti pizzu mlohavom, tvrdi sirevi se ne캖e lijepo rastezati i lagano 캖e zagoriti, 쬰lite neki balans toga.\n\n> Osobno koristim najobi캜niju Galbani mozzarellu, 10 kn u bilo kojem Konzumu i prakti캜ki va코 najskuplji sastojak u cijeloj ovoj pri캜i. Moja procjena je da cijeli ovaj recept do캠e oko 16 kn u sastojcima, tj. mozzarella je 63% cijene. Alternativno, ako vam se da zezati s time mo쬰te napraviti i svoju mozzarellu.\n\n> 맚o se ti캜e svje쬰g bosiljka, ovo kinda morate imati biljku (do캠e oko 10 kn tegla), ali mo쬰 se zamijeniti s origanom, ili osu코enim bosiljkom. Tradicionalni recept ka쬰 svje쬴 bosiljak, to je i meni najfinije, to koristim.\n\n> Naposljetku, staviti pe캖 da se predgrije na maksimalnu temperaturu na koju ide. Kru코ne pe캖i rangiraju od 400-700춿C i pizza se pe캜e 90 sekundi, tako da ne mo쬰te staviti na \"previ코e\".\n\n## Kombinacija sastojaka\n\n>! Sad jo코 samo treba oblikovati tijesto i staviti sastojke.\n\n> ### Oblikovanje tijesta\n> Ovo je najte쬴 dio. Da ne opisujem postupak rije캜ima, preporu캜am da pogledate ovo (pode코eno je na **1:21**):\n> \n> https://youtu.be/o_i5vRRMRLc?t=81\n\n> On ka쬰 da ima bra코no  pomije코ano sa semolinom (griz od durum p코enice), no osobno znam da i najobi캜nije bra코no funkcionira okej. Osobno volim koristiti i kukuruzno bra코no za ovaj korak. Smisao ovog postupka je da se mjehuri캖i nastali dizanjem ne ispu코u, ve캖 da ih se gura prema kori. Ovo je korisno u na코em slu캜aju jer zbog nedovoljne temperature tijesto se ne di쬰 jednako dobro kao u kru코noj pe캖i, a to kinda 쬰lite.\n> \n> Kad ste gotovi s ovim korakom, kako nemate lopaticu i pe캖 vjerojatno 쬰lite prebaciti pizzu u lim za pe캜enje. Ovo je najjednostavnije napraviti stavljanjem pizze na 코ake, kao npr. na **3:06** u video. Mo쬰te i prije premje코tanja pizze premazati lim za pe캜enje s uljem kako se pizza ne bi zaljepila, osobno volim malo zagrijati lim i staviti maslac ili svinjsku mast jer mi to daje najljep코u koru, ali generalno nije potrebno.\n> \n> Na **3:56** mo쬰te vidjeti i ostatak stavljanja sastojaka. Raj캜ica se stavlja u centar i kru쬹im pokretima rasprostranjuje (funkcionalno nebitno). Mozzarella se mo쬰 staviti i ovako, u mrvicama/kockicama, neki ju tr쬿, ja ju osobno re쬰m na plo코kice. Mislim da je ovaj korak nemogu캖e zeznuti pa kako god je stavite dok god je ravnomjerno raspodjeljena - to je to.\n> \n> **VA콯NO:** velika je 코ansa da nemate kru코nu pe캖. U tom slu캜aju na tijesto stavite samo raj캜icu za sad. \n\n## Zadnji koraci\n\n>! Pe캖nica bi sad trebala biti predgrijana na maksimalnoj temperaturi. Stavite pizzu, trebalo bi se grijati na oba grija캜a, s uklju캜enim ventilatorom ako je mogu캖e. Prvo pe캜enje je preferabilno s donjim grija캜em, ili na donjoj polici. Trenutno va코a pizza ne bi trebala imati ni코ta osim raj캜ice na sebi. Pecite je dok tijesto ne dobije boju, dok ne pozlatni - ovo bi trebalo trajati 10-15 minuta.\n\n> Nakon 코to tijesto dobije boju, izvadite pizzu iz pe캖nice i prebacite grija캜 na gornji. Stavite ostatak sastojaka (bosiljak ako ga imate, pa na to mozzarellu, npr.) na pizzu te je vratite u pe캖nicu. Pecite pizzu dok se ne pojave mjehuri캖i na siru - ovo bi se trebalo dogoditi za 3-5 minuta.\n\n> Izvadite pizzu iz pe캖nice i ostavite je par minuta da se ohladi. Ako imate povi코enu re코etku, najbolje je staviti pizzu na to umjesto ostaviti je u limu za pe캜enje. Razlog za to je 코to iz pizze isparava vodena para. Ta para ne isparava samo kroz gornju povr코inu pizze, ve캖 i donju. Ako vam pizza ostane u limu, ta para 캖e vla쬴ti donju stranu pizze i ona ne캖e biti jednako hrskava. Rje코enje za to je re코etka na koju se pizza mo쬰 odlo쬴ti tih 5 minuta dok se malo ne ohladi.\n\n> Preostalo je jo코 samo narezati pizzu i poslu쬴ti je. Prije rezanja mogu캖e je po코kropiti pizzu maslinovim uljem, npr. ako se 캜ini presuha (ali ovo se ne bi trebalo dogoditi jer raj캜ica nije bila gusta, a mozzarella je mrvicu vla쬬n sir).\n\n----\n\nPles dont put this in shitpost thread\n\nEDIT: Vidim da nisam slikao pizzu posljednji put kad sam je radio tako da 캖u vjerojatno u 캜etvrtak slikati drugu, 캜isto reprezentacije radi.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Jakic007",
          "Ollie",
          "Upforpslone",
          "[deleted]",
          "aaa8 (Gerti)",
          "boban_rajovic (ravindrababu ravula)",
          "brbrbr",
          "prodanacro (oat)",
          "soplagaitas (sopla)",
          "thelonewanderer (Du 칛r inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78515": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@micho#78031 Slike:\n\n![](assets/2020-10-08/00014.jpeg)\n\n![](assets/2020-10-08/00015.jpeg)",
      "votes": {
        "upvoters": [
          "Amon",
          "Bobinator",
          "Filemon",
          "Jakic007",
          "KitKat (H(x))",
          "M-16",
          "Ollie",
          "Svarog (Veles)",
          "Upforpslone",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "adrian7000",
          "brbrbr",
          "idontwannabemyself",
          "maPre",
          "potemkin (meriMerino)",
          "rija",
          "soplagaitas (sopla)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "potemkin (meriMerino)"
        ],
        "tuga": []
      }
    },
    "78986": {
      "poster": "KitKat (H(x))",
      "content": "Ajde da i ja nadodam ne코to na ferovski kulinarski blog.\n\n### **Pile캖i curry po Tajlandski**\n\n**Za캜ini**\n- 1 i pol mala 쬷ica kurkume\n- pola male 쬷ice 캠umbira u prahu\n- 1 mala 쬷ica curryja \n- pola male 쬷ice kajenskog papra\n- mala 쬷ica soli\n- samo malo slatke paprike\n\nSve za캜ine pomije코ati u neku 코alicu\n\n**Ostali sastojci**\n- 1 luk (manje do srednje veli캜ine)\n- 1 re쬬nj 캜e코njaka\n- 1 konzerva kokosovog mlijeka (400 ml)\n- otprilike pola kile piletine, najbolje uzeti pile캖i file\n- jedno 250 grama gra코ka (najbolje iz konzerve)\n- jedan krumpir\n- svje쬴 캠umbir (optional)\n- jedan manji paradajz ili jedno 4-5 cherry raj캜ica\n\n**Preporu캜eni prilog i salata**\n\nRi쬬 i rikola\n\n**Postupak**\n1. Piletinu narezati na kockice, sitno nasje캖i 캜e코njak i luk, krumpir oguliti i nasje캖i na sitne kockice\n2. Staviti piletinu u neku zdjelu i posuti je za캜inima. Promije코ati i pustiti da stoji jedno 10-15 minuta da se za캜ini upiju.\n3. Stavi onaj krumpir da se kuha u nekom manjem loncu\n4. Stavi malo ulja na wok tavu i kad se zagrije, ubaci piletinu. Zdjelu u kojoj je bila piletina stavi sa strane, trebat 캖e ti\n5. Izbaci piletinu nazad u zdjelu nakon 3-4 minute i sad na tom ulju punom za캜ina upr쬴 캜e코njak i luk\n5. Kad se 캜e코njak i luk upr쬰, dodaj paradajz, pa nakon toga vrati meso i pusti da se jo코 malo ispr쬴\n6. Sad sve to zalij kokosovim mlijekom i kad prokuha, smanji na laganu vatru\n7. Ubaci onaj krumpir koji se do sada skuhao i gra코ak\n8. Ako ima코 svje쬴 캠umbir, naribaj malo toga unutra (optional)\n9. Pusti da kuha jo코 10 minuta i ru캜ak je gotov\n\n![](assets/2020-10-10/00006.png)\n\n![](assets/2020-10-10/00007.jpeg)",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "79068": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "![](assets/2020-10-10/00012.png)",
      "votes": {
        "upvoters": [
          "Amon",
          "BigZ1",
          "Bobinator",
          "Filemon",
          "KitKat (H(x))",
          "Svarog (Veles)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "79486": {
      "poster": "Bobinator",
      "content": "Ultra mekane i tanke tortilje\n\nDo sad su mi uvijek ispadale ili debele ili su pucale, napokon su tanke ko real feel\n\nBtw u novom sam stanu pa nemam realne mjere nego ovako neke, al snaci cete se\n\nSastojci:\n\n-3 case brasna\n\n-1 casa vode\n\n-2 zlicice praska za pecivo\n\n-malo soli\n\n-2 zlicice maslaca/margarina\n\nPostupak:\n\n1. U posudu dodajte brasno, sol, prasak. \n2. U casu vode stavite maslac/margarin i grijte u mikrovalnoj dok se ne otopi\n3. Mjesavinu(cijelu) vode i maslaca izlijte u smjesu, pokraj pripremite cca pola case vode i cca casu brasna za popravljanje kad sjebete\n4. Mijesi tijesto dok ne bude homogeno, zilavo i jako slabo ljepljivo(gotovo ne ljepljivo, ali ne smije bit ni previse brasna)\n5. Takvo tijesto zamotaj u prijanjajucu foliju i ostavi 15 min dok cistis kuhinju jer si ju zasro\n6. Nakon 15min, uzimaj male komade i oblikuj u kuglice(velicine cca 5cm u promjeru ili mrvicu manje)\n7. Ostavi kuglice da odstoje jos 20-25 min pokrivene(opet prijanjajuca ako je moguce, ako ne onda smisli sam)\n8. Stavi malo brasna na cistu(nismo zivotinje) podlogu, valjkom razvaljaj na cca velicinu malog tanjura, a nakon toga uzmi u ruke ako si sposoban i jos ga malo razvuci, ako nisi sposoban onda valjaj i dalje\n9. Potrudi se da budu tanke oko 1-2 mm, al pazi da ne sjebes i ne pretjeras pa ti ne stanu u tavu. Ako si napravio male kuglice, ne brini, mozes ih rastezat toliko da se kroz njih vidi boja ruku\n10. Zagrij tavu, ali ne stavljas ulje ni nista\n11. Bacis na tavu i cim dobije malo zlatne/smede boje sa obje strane, mici\n12. Zovi jos 3-5 prijatelja jer sa ovom smjesom dobijes fucking 18 tortilja(mozd manje ako imas manju casu)\n13. Necu vam govorit sta da stavljate unutra, valjda znate sta volite\n\nOva slika je da se vidi kako su savitljive\n\n    ![](assets/2020-10-12/00023.jpeg)\n\n    A ova da se vidi koliko su tanke jer se vidi sjena kroz njih\n\n![](assets/2020-10-12/00024.jpeg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "Ollie",
          "Svarog (Veles)",
          "Theanko (Mirko 콯mirko)",
          "[deleted]",
          "[deleted]",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "tata (NISAM ASISTENT)",
          "thelonewanderer (Du 칛r inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "79487": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Bobinator#79486 My dude, ako ho캖e코 tanke tortilje nemoj stavljati pra코ak za pecivo i na캠i bra코no za kruh (s puno glutena). Ono 코to definira koliko ti tijesto mo쬰 biti tanko bez da pukne je gluten, kojeg 캖e코 razviti\n\n- jakim bra코nom (as in 12+ g proteina / 100g)\n- dugim i dobrim mije코enjem (10 minuta dobrom tehnikom, 20+ minuta prosje캜nom/lo코om)\n- dugim vremenom mirovanja (uobi캜ajeno je ostaviti sat vremena, al mo쬰 se komotno cijeli dan u fri쬴deru ostaviti)\n\njavi rezultate ak 캖e코 probati, iako i ovo ve캖 izgleda dosta lijepo",
      "votes": {
        "upvoters": [
          "Bobinator",
          "Filemon",
          "KitKat (H(x))",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "81811": {
      "poster": "pipi (cicipjorica)",
      "content": "mala tajna velikih majstora:\n\nkad dinstate kapulu za neki umak/gula코, nakon 코to malo postakli, stavite 쬷i캜icu pra코ka za pecivo ili sode bikarbone pa onda odmah podlijte vodom. \n\nubrza karamelizaciju i jelo bude kremastije.\n\nthank me l8er",
      "votes": {
        "upvoters": [
          "Jaki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BigZ1",
          "Ovo_je_moj_nick"
        ],
        "wtf": [
          "BedaTheNic",
          "Filemon",
          "Svarog (Veles)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "netflix (seximan)",
          "slip",
          "spejs"
        ],
        "tuga": []
      }
    },
    "82341": {
      "poster": "[deleted]",
      "content": "@pipi#81811 razbila si vise jaja o guzicu nego na tavi, i svejedno si daje코 za pravo dijeliti kulinarske savjete",
      "votes": {
        "upvoters": [
          "Dome",
          "HeHe (Direktor 쬴vota)",
          "[deleted]",
          "markoo321 (Grinch)"
        ],
        "downvoters": [
          "Emma63194",
          "Filemon",
          "KitKat (H(x))",
          "Mrcina (Yoso)",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "iNavy (mornar Ica)",
          "idontwannabemyself",
          "mentally_disturbed_llama",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "prodanacro (oat)",
          "spenadla"
        ]
      },
      "reactions": {
        "haha": [
          "BedaTheNic",
          "Dome",
          "HeHe (Direktor 쬴vota)",
          "Jale (캜akijale)",
          "Kuhar",
          "LUJXIV",
          "Mioch",
          "Murin",
          "Retard00",
          "ardi (sprut)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "markoo321 (Grinch)"
        ],
        "wtf": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "82351": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@GAVRAN#82341 dobro koji je tebi kurac",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "aperture",
          "bb8 (zaza)",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Dome",
          "Jakic007",
          "KitKat (H(x))",
          "Mioch",
          "NekocBraca",
          "STAGGER_LEE",
          "__builtin_popcount (std::popcount)",
          "aperture",
          "idontwannabemyself",
          "spenadla"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "82443": {
      "poster": "pipi (cicipjorica)",
      "content": "@GAVRAN#82341  e캠lordi su pass칠. try harder.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "[deleted]",
          "[deleted]",
          "mAcaLukas (mAca Lukas)",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Emma63194",
          "KitKat (H(x))",
          "M-16",
          "NekocBraca",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "iNavy (mornar Ica)",
          "mAcaLukas (mAca Lukas)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "soplagaitas (sopla)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "84609": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Troj캜eki\n\n![](assets/2020-10-27/00009.jpeg)",
      "votes": {
        "upvoters": [
          "BedaTheNic",
          "Filemon",
          "KitKat (H(x))",
          "[deleted]",
          "bb8 (zaza)",
          "pipi (cicipjorica)",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Kuhar",
          "pipi (cicipjorica)"
        ],
        "wtf": [
          "BedaTheNic"
        ],
        "tuga": []
      }
    },
    "89069": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "![](assets/2020-11-06/00008.jpeg)\n\n![](assets/2020-11-06/00009.jpeg)\n\noko 90% hidratacija uz yudane metodu\n\nVerdict: Yudane je ono 코to je pizzi definitivno trebalo",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "Koalalica (zaba)",
          "MarokMarsci (Collapse Enjoyer)",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "bb8 (zaza)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "103679": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Poor man's Dutch oven\n\n![](assets/2020-12-01/00017.jpeg)\n\n![](assets/2020-12-01/00018.jpeg)",
      "votes": {
        "upvoters": [
          "Amariska",
          "BigZ1",
          "Bobinator",
          "Filemon",
          "KitKat (H(x))",
          "Ollie",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "idontwannabemyself",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amariska",
          "Bobinator",
          "KitKat (H(x))",
          "Ollie",
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "105002": {
      "poster": "KitKat (H(x))",
      "content": "### **Bulgogi (korejska teletina)**\n\n**Sastojci**\n\n500 grama teletine od buta\n\n묧oriluk\n\n묩ezam\n\n묤arinada sastojci\n\n**Marinada**\n\n75ml soja umaka (pola male bo캜ice)\n\n1 manja kru코ka (naribano)\n\n1 쬷i캜ica meda\n\n묩vje쬴 캠umbir (naribano, otprilike 1 쬷ica) ili 1 쬷i캜ica 캠umbira u prahu\n\n2 re쬹ja 캜e코njaka\n\n묧ola 캜ili papri캜ice (sitno sjeckano)*\n\n1 쬷i캜ica kajenskog papra*\n\n*Zadnja dva sastojka su zamjena za 쬷icu gochuyang umaka kojeg nemo코 nigdje na캖i\n\n**Postupak**\n1. Pomije코aj sastojke za marinadu\n2. Tanko nare쬴 meso na komade manje do srednje veli캜ine\n3. Stavi meso u marinadu, dobro napacaj i pusti da stoji sat-dva\n4. Nare쬴 poriluk\n5. Sad mo쬰코 pr쬴ti meso u ravnoj tavi na malo ulja\n6. Paralelno upr쬴 poriluk u wok tavi\n7. U nekom trenutku 캖e ti se 캜initi da marinada s mesa zagara. U pravu si jer karamelizacija meda i ostalog 코e캖era. Kad se to dogodi, stavi malo ulja na to, pokupi to karamelizirano komadom mesa koji je gotov, i prebaci to na wok tavu s porilukom. Op캖enito gotovo meso prebacuj tamo\n8. Kad je svo meso gotovo, ostatak marinade ulij u wok tavu, i sve to zajedno jo코 malo upr쬴\n9. Dodaj sezam\n10. Gotovo, poslu쬴 s ri쬺m, dobar tek.\n\n\n![](assets/2020-12-03/00014.jpeg)",
      "votes": {
        "upvoters": [
          "Amariska",
          "Filemon",
          "Mrcina (Yoso)",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "idontwannabemyself",
          "mAcaLukas (mAca Lukas)",
          "pipi (cicipjorica)",
          "spejs",
          "tamnodrvo96",
          "turunturu (Cement)",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "HeHe (Direktor 쬴vota)"
        ],
        "tuga": []
      }
    },
    "106385": {
      "poster": "Amali (Amajli)",
      "content": "Honestly ne vidim smisao da kopipejstam ovo\n\nRecept za chocolate chip cookies, isproban jucer i danas, very nice and soft. Ja sam uglavnom samo htjela neke soft cokoladne kekse\n\nosobno stavljam pola secera od bilokojeg recepta s interneta i ne znam kakav je s origigi kolicinom, s pola je nama doma taman ak se voli da se osjeti gorcina kakaa\n\nnaravno mogu se napravit bilokakve izmjene u dodacima\n\nhttps://likechocolate.net/2013/10/dvostruko-cokoladni-keksi-double-html/",
      "votes": {
        "upvoters": [
          "AntonioB25 (Pleteni mi코)",
          "Emma63194",
          "Filemon",
          "InCogNiTo124",
          "Svarog (Veles)",
          "[deleted]",
          "mAcaLukas (mAca Lukas)",
          "pipi (cicipjorica)",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "112337": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "turns out ako nemate mozzarellu poslu쬴t 캖e i topljeni sir\n\n![](assets/2020-12-18/00019.png)\n\novo konkretno je amerikanizirani Provolone (20% mlijeka, 2.5% natrijev citrat), 캜ekao sam da malo posme캠i hehe\n\n코to svakako otvara vrata raznim kombinacijama, npr. amalgam mozzarelle i cheddara, ili parmezana",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "112497": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@micho \n\n![](assets/2020-12-19/00014.jpeg)",
      "votes": {
        "upvoters": [
          "[deleted]",
          "pop (gabagool)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Bobinator",
          "Filemon",
          "KitKat (H(x))",
          "Lyras",
          "Svarog (Veles)",
          "rija"
        ],
        "wtf": [
          "Emma63194",
          "Hrvoje (Hrvoje45)",
          "Mrcina (Yoso)"
        ],
        "tuga": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ]
      }
    },
    "112498": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@mAcaLukas#112497 mr코 s tim zapadnja캜kim forama",
      "votes": {
        "upvoters": [
          "Emma63194",
          "KitKat (H(x))",
          "Svarog (Veles)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "112548": {
      "poster": "Gussy (huba buba)",
      "content": "koje su vam najbolje hrenovke",
      "votes": {
        "upvoters": [
          "gladiator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "112559": {
      "poster": "[deleted]",
      "content": "@Gussy#112548 komercijalne one sa sirom, one druge od lokalnog mesara Zdenka",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113783": {
      "poster": "BedaTheNic",
      "content": "Mali projektic pred bozic zadnjih 2 dana.. namucili smo se ali se isplatilo\n\n![](assets/2020-12-23/00023.jpeg)\n\n![](assets/2020-12-23/00024.jpeg)\n\n![](assets/2020-12-23/00025.jpeg)\n\n![](assets/2020-12-23/00026.jpeg)\n\n![](assets/2020-12-23/00027.jpeg)\n\n![](assets/2020-12-23/00028.jpeg)\n\n![](assets/2020-12-23/00029.jpeg)\n\n![](assets/2020-12-23/00030.jpeg)\n\n![](assets/2020-12-23/00031.jpeg)\n\n![](assets/2020-12-23/00032.jpeg)\n\n![](assets/2020-12-23/00033.jpeg)",
      "votes": {
        "upvoters": [
          "Amariska",
          "Amon",
          "AntonioB25 (Pleteni mi코)",
          "BigZ1",
          "Broono (Buru캖uh)",
          "Elendur19 (Zagor)",
          "Emma63194",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Joskica",
          "KitKat (H(x))",
          "M-16",
          "MarokMarsci (Collapse Enjoyer)",
          "NekocBraca",
          "Ollie",
          "Svarog (Veles)",
          "Theanko (Mirko 콯mirko)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "amnael",
          "bb8 (zaza)",
          "carrieb",
          "idontwannabemyself",
          "jadzia-dax (Jadzia Dax)",
          "jelica (ajmemeni)",
          "login",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "member",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "pipi (cicipjorica)",
          "prodanacro (oat)",
          "rija",
          "soplagaitas (sopla)",
          "turunturu (Cement)",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115707": {
      "poster": "pipi (cicipjorica)",
      "content": "https://www.youtube.com/watch?v=hWw-121EKGI",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]",
          "[deleted]",
          "boss15",
          "pop (gabagool)",
          "spejs"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "121955": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "## Paradajz revju\n\nPrije nekoliko mjeseci sam obilazio na코e trgova캜ke lance i isprobavao razne pasirane raj캜ice. Da presko캜imo pri캜u za코to koristim uop캖e pasiranu raj캜icu umjesto kuhane pelate, bacit 캖u svoj osvrt i mi코ljenje na 코to 쬰lite kupiti u odre캠enim okolnostima.\n\n### Kategorija okusa\n\n- Mutti\n- Cirio\n- Podravka bio\n- Freshona (Lidl)\n- Podravka\n- Russo\n- Mikado\n- Kplus\n\nNema previ코e toga za re캖i ovdje osim da su Mutti i Cirio pasirane raj캜ice daleko izvan svih, eventualno Podravka bio malo bli쬰 dolazi ali ne mo쬰 se mjeriti s njima jer ima 코itniju teksturu. Sve ispod obi캜ne Podravke ne bih taknuo ni 코tapom, dakle to su proizvodi pozitivni na HIV, uglavnom vodeni, i njihovu primjenu vidim eventualno za neka pi캖a (Bloody Mary npr.), ali nikako za jela.\n\n### Kategorija efikasnosti\n\nKao, s obzirom na cijenu i okus, koju kupiti\n\n- Mutti\n- Cirio\n- Podravka bio\n- Podravka\n- Freshona (Lidl)\n- Kplus\n- Russo\n- Mikado\n\nMutti i Cirio su najskuplje od ovdje ali je Mutti toliko dobra da se isplati. Mikado je toliko lo코a da iskreno ra캠e bih jeo pizzu bez paradajza nego oti코o u du캖an kupiti taj paradajz za pizzu.\n\n### Zaklju캜ak\n\nAko imate para za Mutti i autist ste ko ja pa ne kupujete pelate, go for it. Podravka je dosta solidna bez da je u ovom \"premium\" cjenovnom rangu od 7+ kn po 500 mL. Ova lidlovska je prije bila best buy, 3 kn po 500 mL, dakle na nivou KPlusa samo neusporedivo bolja, al sad je poskupila pa je ne cijenim toliko.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Svarog (Veles)",
          "[deleted]",
          "aperture",
          "ataxia",
          "gladiator",
          "iNavy (mornar Ica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "STAGGER_LEE"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "121984": {
      "poster": "[deleted]",
      "content": "@micho#121955 osobno uzimam mutti ako je za nekaj di je bitno, podravka ako nije ili ako ce dugo stajat otvoreno. oba su dostupna u ducanima u koje idem pa eto, sve ostalo ak mi pukne probat, dboar review pl",
      "votes": {
        "upvoters": [
          "[deleted]",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "121998": {
      "poster": "Koalalica (zaba)",
      "content": "@micho#121955 Generalno se slazem osim jednog detalja. mutti je jaaako slatka rajcica, pa ako se radi pizza s mozzarellom (koja nije bas slana) onda pizza bude toliko slatka da ima okus po pokvarenom slatkisu.\n\nNo free lunch strikes again",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "122004": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Koalalica#121998 Pa dobro al nijedna pasirana raj캜ica se ne stavlja direkt na pizzu, obi캜no se treba napraviti umak jer te raj캜ice nit su dovoljno guste nit je okus dovoljno koncentriran\n\nIna캜e nisam primijetio, ja u svoje umake stavljam i med pa mi nije preslatko haha",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Koalalica (zaba)"
        ],
        "wtf": [
          "Filemon",
          "InCogNiTo124",
          "KitKat (H(x))"
        ],
        "tuga": []
      }
    },
    "122008": {
      "poster": "Koalalica (zaba)",
      "content": "@micho#122004 da, sad sam proscrollala ovaj thread i vidila da si diplomirao pizzu :')\n\nja inace samo prolijem podravku po tijestu kao zadnji pleb i bude mi dobro.\n\nsljedeci put kad si nabavim sastojke su probati ovaj tvoj recept za napuljsku, izgleda amazing.\n\n@Nostro#121984 sori, sutra jedes pleb pizzu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "122011": {
      "poster": "[deleted]",
      "content": "> @Koalalica#122008 sori, sutra jedes pleb pizzu\n\nma vidio sam letak, da ni slu캜ajno ne bi ostala neka tajna i iznena캠enje",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Koalalica (zaba)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "122033": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@Koalalica#122008 \n\nhladnu, bez kuhanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Koalalica (zaba)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "122359": {
      "poster": "johndoe12 (enaiks)",
      "content": "pasta s gljivama i tikviciama\n\nnaribati tikvicu i gljive i staviti pirjati sa sosom od rajcice. zaciniti s bosiljkom i prstohvatom vegete.\n\nZa pastu preporucam pastu od pirovog brasna koja je zdravija od normalne paste i ne napuhuje toliko, to mi je otkrice godine.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "member",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "126063": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "![](assets/2021-01-22/00001.jpeg)",
      "votes": {
        "upvoters": [
          "Amon",
          "BigZ1",
          "Hrvoje (Hrvoje45)",
          "KitKat (H(x))",
          "Red_Baron",
          "Svarog (Veles)",
          "Vishnjevac",
          "[deleted]",
          "[deleted]",
          "gladiator",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "spenadla",
          "tamnodrvo96"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129771": {
      "poster": "KR7 (Detective Schmosby)",
      "content": "![](assets/2021-01-26/00013.jpeg)\n\nSpaghetti Carbanana",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BedaTheNic",
          "BigZ1",
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "Hrvoje (Hrvoje45)",
          "Jakic007",
          "KitKat (H(x))",
          "Kuhar",
          "Mioch",
          "Murin",
          "NekocBraca",
          "Piki",
          "Svarog (Veles)",
          "Vishnjevac",
          "amnael",
          "gladiator",
          "spenadla",
          "tata (NISAM ASISTENT)",
          "whatTheHel"
        ],
        "wtf": [
          "InCogNiTo124"
        ],
        "tuga": [
          "Jurica",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ]
      }
    },
    "139846": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "skuvao sam ovo danas kao mali eksperimenti캖, fuse sincronizade, chili con carnea i lazanja\n\nBejzikli napravio sam tijesto od p코eni캜nog bra코na za tortilje, razvaljao ih kao da su pasta i listao kao lazanje. Fila je chili con carne, samo ajde nema mahune ali zato ima puno paprike heheheh\n\nI ispalo je dost dobro i fino, u neku ruku superiorno lazanjama\n\n![](assets/2021-02-08/00026.jpeg)\n\nDakle plus je 코to su tortilje popile svu ekstra teku캖inu iz umaka, pa je fila zapravo ostala relativno suha, nije se prelijevala, a opet tijesto je bilo so캜no (ali ne i mlohavo), i puno okusa (jer je ve캖ina teku캖ine iz paprike, kukuruza, paradajza).\n\nUgl. jo코 캖u malo eksperimentirati pa lupim recept kad usavr코im. Neprakti캜no je ovak visoko to poslagati, dakle vjv. treba raditi na tome da tortilje budu tanje ili da bude maks 2-3 sloja file, ne 4 (tj. 5) koliko je ovdje, ina캜e je te코ko rezati. A za razliku od lazanja nije kao da se mo쬰 samo dulje pe캖i i da 캖e omek코ati.",
      "votes": {
        "upvoters": [
          "Filemon",
          "GranAutismo",
          "KitKat (H(x))",
          "Ollie",
          "Svarog (Veles)",
          "Vishnjevac",
          "[deleted]",
          "[deleted]",
          "gladiator",
          "iNavy (mornar Ica)",
          "jadzia-dax (Jadzia Dax)",
          "spenadla"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139870": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@micho#139846 independently sam radila ne코to sli캜no prije tjedan-dva, moje iskustvo je da trebas rezat odmah kad iza캠e iz rola",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139871": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@jadzia-dax#139870 Nije problem narezat za serviranje, meni su recimo tu bile predebele i prenastackane tortilje da mogu no쬰m i vilicom\n\nOvo kod serviranja je bio san snova, jebote, ni코ta se nije zalijepilo, ni potrgalo, stabilno u 10pm",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139879": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@micho#139871 ja sam imala kupljene tortilje, to je funkcioniralo ok...\n\nali svi drugi aspekti su nam tu negdje, 4 sloja mesa i 5 tortilja, ovu zadnju sam jo코 polila s ostatkom tekuce materije od mesa\n\nprednost ovog na캜ina je efikasnije koristenje tortilja, pa se mo쬰 potrositi cijela porcija mesa iz du캖ana",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140075": {
      "poster": "KitKat (H(x))",
      "content": "### Piletina i ~~kuskus~~ bulgur po Marokanski uz ve캖e i manje preinake by KitKat\n\n**Osnovni za캜ini**\n\n1 쬷ica soli\n\n1 쬷ica 캜e코njaka u prahu\n\n1 쬷ica 캠umbira u prahu\n\n1 i pol 쬷i캜ica kumina\n\n1 쬷ica slatke paprike\n\n1/2 쬷i캜ice cimeta\n\n1/4 쬷i캜ice kurkume\n\n^ ovo je osnova i za meso i za povr캖e\n\n**맚o jo코 trebam?**\n\n500g pile캖eg filea\n\n묣imun\n\n묙ulgur\n\n묤enta (optional)\n\n묧ovr캖e:\n\n2 tikvice\n\n3 mrkve\n\n2-3 paprike\n\n400 grama slanutka\n\nILI (ako se osje캖ate lijeno, a 쬰lite fino jesti)\n\n1 tikvica\n\n2 Ledo bulgur mje코avine\n\n**Meso**\n1. Nare쬴 meso kao za 코nicle\n2. Utrljaj mje코avinu za캜ina u to meso, stavi meso u neku zdjelu, zalij maslinovim uljem i sokom 1/2 limuna i pusti da stoji 1-2h\n3. Stavi maslac i maslinovo ulje na tavu, na tom 캖e코 pr쬴ti meso na naglo\n4. Kad meso vi코e nije sirovo, podlij pile캖om juhom (ili 1/8 pile캖e kocke i mrvicom Vegete razmu캖eno u vodi) i ubaci 1-2 캜e코nja 캜e코njaka narezano na plo코ke da puste okus, pusti da to malo ispari i meso je gotovo\n\n**Bulgur - normalna verzija**\n1. Pripremi bulgur sa strane, samo slijedi upute na pakiranju, kao ri쬬, samo lak코e\n2. nare쬴 papriku, tikvice i mrkvu. Mrkvu nasjeci 코to sitnije mogu캖e, tako bude bolje\n3. Upr쬴 papriku na maslinovom ulju\n4. Dodaj mrkvu i upr쬴 ju\n5. Dodaj tikvice, nek se i one pr쬰\n6. Dodaj slanutak i za캜ine. Ako 쬰li코 staviti mentu (svje쬿, ako ima코 su코enu, prvo je namo캜i u vodi 5 minuta pa dodaj skupa s ~~캜ajem~~ vodom), stavi je sad\n7. Dodaj bulgur\n8. Zalij sokom 1/2 limuna i gotovo\n\n**Bulgur-lijena verzija**\n1. Ima코 smrznuto nasjeckano povr캖e, zagrij ulje i samo ga iskreni na to.\n2. Nasjeckaj jednu tikvicu i dodaj je unutra\n3. Stavi za캜ine i zalij limunom i gotov si\n\n![](assets/2021-02-09/00010.png)\n\n`Na slici je lijena verzija`",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "Lenobius",
          "Mioch",
          "Ollie",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself",
          "member",
          "tata (NISAM ASISTENT)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141171": {
      "poster": "Krisle",
      "content": "Ne vidim sli캜nu temu, pa da tu pitam - imate kakve preporuke za kotao za gula코? \n\nZasad znam da je ok da je ve캖i, jer ono, uvijek mo쬰코 manje stavit u njega (ili vi코e napravit pa zamrznut), a ako ima코 hrpu ljudi dobro do캠e da je ve캖i. \n\nIsto znam da nije svejedno kojeg si pikne코 jer se neki nekvalitetni po캜nu taliti nakon nekog vremena i mogu pu코tat metalni okus u gula코. \n\nCijena nije problem ako je dobar, ali koliko sam vidio kako se one vrte, probao bih na캖 deal da ne ide iznad 400kn.\n\nPar primjera, slobodno komentirajte: \n\nhttps://shopboxhr.com/products/kotlic-tronozac-16-lit-260-kn-besplatna-dostava\n\nhttps://www.comet.hr/kotlic-emajl-plitki-30l-proizvod-6419/",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141188": {
      "poster": "BigZ1",
      "content": "@Krisle#141171 a msm kod mene jer sam u SB ljudi odu u Bosnu kupit. Skoro svi manje gula코e,fi코eve itd rade na trono코cu,dok eventualno za ba코 puno ljudi se radi u kotlu코i (nezz kako se normalno ka쬰 tako se kod nas ka쬰) na okrugloj sklepanoj pe캖i. Osobno isto imam 쬰lju ne코to tako napravit,no ako ba코 쬰li코 solo pripremi se na 캜i코캖enje par kg crvenog luka,to je onako najmr쬴 posao meni osobno u pripremi. \n\nTako캠er bi nadodao da ti je ovaj od 16L dobijes i postolje 코to je super,a 16L je stvarno solidna koli캜ina za napravit za 10-15 ljudi (ovisno o broju 쬰na, debelih mu코karaca koji mogu puno pojest a.k.a. myself) tako da ako 쬰lis nabavi si taj od 16L,no obavezno si kupi neku dobru drvenu kuha캜u i grablja캜u.",
      "votes": {
        "upvoters": [
          "Krisle"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141296": {
      "poster": "Krisle",
      "content": "@BigZ1#141188 Trono쬬c bih ja sigurno. \n\nMa radio sam ja ve캖, ne brini se, nisam se 캠abe navukao na to :D \n\nTo i svima savjetujem da prvo probaju vidjet jel im ok zezat se s tim, ali ako ima코 imalo simpatije, bit 캖e ti odli캜no jer zapravo ni코ta ne mo코 previ코e fulat i u쬴va코 u bacanju svega u kotao. \n\n캛ak bih rekao da je manje zezancije nego s ro코tiljem na drva. A pravi je ritual 3-4 sata pit pivu s ekipom uz kotao ;)\n\nSad si me podsjetio da je 16L 캜isto solidno za 20 po코tenih mu코karca, tako sam na burazovoj moma캜koj radio.\n\nZvu캜i malo, ali gula코 je zasitan ako ga napravi코 s dosta mesa (tipa 8kg).\n\nTako da mislim da 캖e mi 25L biti taman nek se na캠e",
      "votes": {
        "upvoters": [
          "BigZ1",
          "mAcaLukas (mAca Lukas)",
          "maPre"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141363": {
      "poster": "[deleted]",
      "content": "### Gula코 sa knedlama\nTe쬴na: 3/10\n\nVrijeme: oko 1.5 do 2 sata\n\n**Gula코**\n\n- 2/3 kg mesa (june but/vrat/lopatica, srna, vepar)\n- 1-2 luka\n- 1-2 캜e코nja 캜e코njaka\n- 1 mrkva\n- pe-코est 코ampinjona\n- 2dl vina\n\nMrkvu i luk na sitno, meso na 코traftice. U rajngli prodinstat luk i kasnije mrkvu i 캜e코njak, paralelno u tavi meso lagano pobra코nit i prepe캖/prodinstat. Kad je oboje dobro prodinstano meso dodat u rajnglu skupa sa krupno narezanim 코ampinjonima i vinom. Sol, papar, feferoni, lovor, senf itd., mo쬰te dodat i pasiranog paradajza. Podlijevat sa vodom kojom poberete talog iz one tave. Kuhat sat do sat i pol, ovisi o mesu.\n\n**Knedle**\n\n- 2/3 kg suhog kruha\n- 10 dag 코peka\n- jedan mali mali luk\n- oko 1/3+ l mlijeka\n\nKruh usitnit i lagano tostirat dok ne bude skroz suh, kaj stariji to br쬰 i bolje. Mrvice kruha darujte krilatoj ekipi. Kruh prebacit u veliku posudu i zalit sa vrelim mlijekom. Ovo se treba otprilike, ako stavite previ코e mlijeka lako popravite sa prezlama. U tavici prepr쬴t luk i 코pek pa dodat u kruh. Kad se ohladi dodat 2 jaja i za캜ine. Uglavnom to bude hrpa per코ina, sol i trave po izboru. Moja preporuka je zadr쬬t knedle blagima, a poludit na gula코u. U velikoj rajngli nek slana voda klju캜a, za to vrijeme nek kruh odmara. Kad voda zakipi mokrim rukama fino stisnut i zagladit knedlice. Kuhat oko 15', ovisi o veli캜ini. Ovo bude skoro 15 velikih knedli tak da slobodno prepolovite mjere.\n\nKad je sve gotovo gledajte kak vam uku캖ani kuhaju ri쬿 \"jer u tim knedlama sigurno ima luka\".\n\n>!![](assets/2021-02-11/00022.jpeg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "Koalefant",
          "Ovo_je_moj_nick",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "aperture",
          "carrieb",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself",
          "member",
          "nairobi (light_grandma)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154114": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "![](assets/2021-03-16/00002.png)\n\nJebo vincek, ovo je prava debljina cheesecakea.\n\nDoduse temelj je malo tvrdi jer se morao vise peci zbog male povrsine, a velikog volumena.",
      "votes": {
        "upvoters": [
          "Filemon",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bog (Charlie Brown)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "154195": {
      "poster": "Asura (Asura)",
      "content": "@KitKat#78986  Koliko masno kokosovo mlijeko buduci da idu od 10-25%, meni recimo kada radim carrot halwu treba do 13%, sve ostalo moram kasnije zlicom vadit 游땟",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154223": {
      "poster": "KitKat (H(x))",
      "content": "@Asura#154195 uzmem iz tvornice zdrave hrane ono alnatura organsko u svijetlo plavoj konzervi. S tim mi najbolje ispadnu ti kokos curryji od svih koje sam probala, po deklaraciji mi se 캜ini da je ono oko 17%",
      "votes": {
        "upvoters": [
          "Asura (Asura)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "155378": {
      "poster": "[deleted]",
      "content": "Protip, ak radite burgere/pljeskavice a da su velike, samo u meso grubo umijesite dobru dozu maslaca. Samo onak u rukama ga polurastopite i tak u tim komadicima umijesite. Fino posoli iznutra, sve to malo poveze i sam bude dobro a bez dodavanja gluposti koje promijene okus mesu",
      "votes": {
        "upvoters": [
          "Filemon",
          "Koalefant",
          "NekocBraca",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "156094": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "### Eksperiment s amerikaniziranim sirom\n\nDanas sam eksperimentirao tako da upotpunim rupe u kojima nema mozzarele amerikaniziranim sirem. Dakle poslagao sam mozzarelu, koliko je ve캖 stavljam, vi코e nisam smio staviti da se ne potopi sve, a onda sam praznine povezao s cca 100 g amerikaniziranog cheddara (66% mladi, 33% vintage). Rezultati su ispod.\n\n![](assets/2021-03-21/00013.jpeg)\n\n![](assets/2021-03-21/00014.jpeg)\n\nOkus je nadopunjen, ali ne i preuzet, i izgleda kao da je sve zatrpano sirom. Sir nije izgorio (kao 코to bi cheddar ina캜e), ali nije ni mozzarella plivala radi premalo pe캜enja.\n\nDodao sam i kopra malo kao eksperiment, ali ne svi캠a mi se taj dodatak toliko.\n\nGood shit sve u svemu, ali mislim da je mo쬯a 100 grama bilo previ코e, tj. stavio bih u tu 38 cm pizzu tipa 150g mozze i 75g amerikaniziranog umjesto 125g i 100g.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Joskica",
          "KitKat (H(x))",
          "Koalalica (zaba)",
          "Koalefant",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "gladiator",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "jadzia-dax (Jadzia Dax)",
          "pipi (cicipjorica)",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "161158": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "ne kupujte Franck 쬲ance ako boga znate, u쬬s",
      "votes": {
        "upvoters": [
          "Koalefant",
          "pipi (cicipjorica)"
        ],
        "downvoters": [
          "mentally_disturbed_llama"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190131": {
      "poster": "Filemon",
      "content": "## Rag칯 alla Bolognese\nSvima poznato jelo, bila je posebna prilika pro코li tjedan pa sam odlu캜io napraviti.\n\n### Bolognese\nOno 코to je slabije poznato je da Bolognese nije umak baziran na pomidoru, iako je i pa코ta코uta vrlo fina stvar, nemojte me krivo shvatit, ve캖 na masno캖ama, temeljcu, vinu, mlijeku i **vremenu**.\n\nTe쬴na: 4/10\n\nVrijeme: proizvoljno, 코to vi코e to bolje, barem sat i pol, ciljajte na 3-4 h\n\nza 4 porcije\n\n- 1 kapula\n- 2 srednje mrkve\n- 2 srednje stabljike celera\n- ukupno oko 500 g mesa: najbolje je pomije코ati june캖e i svinjsko mljeveno meso 50:50, ja sam radio samo s gove캠im. Vrlo je po쬰ljno da imate i pancete, ako imate, nekih 10 deka, ostalo mljeveno\n- pola 캜a코e-캜a코a vina, doslovno bilo kojeg. Preporuka ili neko 쬹j ako imate doma, tipa stolno ili neko dovoljno pitko da ga popijete uz ru캜ak. I코ta vi코e od kvalitetnog je bacanje novaca. Ja sam koristio gra코evinu.\n- 2 쬷ice maslinovog ulja (ekstra djevi캜anskog, kojeg drugog)\n- 2 캜a코e gove캠eg ili pile캖eg temeljca\n- 3 쬷ice koncentrata pomidora\n- mlijeko, ukupno sam potro코io oko 캜a코u\n- sol, papar\n\n\n1. U padeli ili dubokoj tavi na srednjoj vatri u zagrijanom ulju prodinstati vrlo sitno, fino nasjeckanu kapulu, mrkvu i celer (soffritto). To traje oko 7 minuta.\n2. Poja캜at vatru, dodat nasjeckanu pancetu i mljeveno meso, razdvajati mije코anjem nekih 10-15 min dok ne dobije lijepu sme캠u boju (zape캜eno sme캠e = okus).\n3. Dodat vino, dinstat minutu dok ne ispari.\n4. Smanjit na srednje pa dodat temeljac (ne sav) i koncentrat, sol, i papar, umije코at, pustit da krene lagano klju캜at i onda smanjit na najmanju vatru.\n5. gg, sad ide onaj dugi dio, povremeno mije코anje dok se to reducira, treba bar sat. Dodavat temeljac po potrebi. U zadnjih sat vremena i mlijeko. Ako vidite lokvicu masno캖e, pokupiti.\n\n### Pa코ta\nS 캜ime sparit Bolognese i op캖enito chunky umake? Odgovor je sigurno ne sa 코pagetima, potreban je neki oblik koji mo쬰 uhvatit umak na sebe, poput makarona (rigatoni), penna ili 코irih rezanaca, kao tagliatelle ili pappardelle.\n\nJa sam odlu캜io napravit tagliatelle.\n\nTe쬴na: 8/10, treba to umijesit, izvaljat i sve ovisi. \n\nVrijeme: oko pola sata + pola sata 캜ekanja\n\nporcije pa코te su vrlo subjektivne, ovo daje oko pola kile pa코te\n\n- ukupno 400 g bra코na. \n>! Ako tra쬴te recepte na engleskom, vidjet 캖ete da se koristi 00 bra코no. E sad, Talijani svoja bra코na klasificiraju po fino캖i mljevenja, mi i ve캖ina razvijenog svijeta po ekstrakciji tj. koli캜ini pepela u spaljenom uzorku. Problem je u tome 코to je glatko bra코no bli쬰 fino캖i, a o코tro koli캜ini glutena koja je potrebna za pa코tu, pa je najbolje pomije코at pola-pola. Ja sam koristio bijelo univerzalno w 480 (u 游뷣릖 ozna캜avaju bijelo/tamno, fino캖u mljevenja i tip, pa imate 2x3x2 seta oznaka). \n\n>Ako tra쬴te recepte na engleskom, vidjet 캖ete da se spominje i semolina, to je griz, ako ga imate, on je 1/4 ovoga. Tako캠er super za pobra코niti podlogu.\n\n- 4 jaja\n- 2 쬷i캜ice soli. \n- 2 쬷ice maslinovog ulja (ekstra djevi캜anskog, kojeg drugog). Bolji okus, poma쬰 da zamijesite ovo 캜udo.\n\nOve koli캜ine ovise o tome kolika su jaja, koje bra코no koristite, vlazi u zraku, polo쬬ju Mjeseca i poravnanju planeta, osje캖aj za feeling do캠e vremenom. Tko nije ba코 radio tijesta u 쬴votu, svi sastojci su **sobne temperature**.\n\n1. Bra코no prosijat sa soli, od toga napraviti hrpu s rupom u sredini, kao vulkan. \n2. Unutra idu jaja i ulje.\n3. Vilicom umutiti jaja i polako umije코ati bra코no.\n4. Kada se vi코e tako ne mo쬰 dodavati bra코no, mijesit rukama, dok ne dobijete glatko tijesto. Mo쬯a 캖e vam se u캜initi kao nemogu캖a misija, jer je tijesto iznimno suho, ali takvo i treba bit. Gotovi ste kad tijesto kada ga pokeate prstom se skoro u potpunosti vrati u po캜etni polo쬬j. Uglavnom za nekih 10-15 minuta bi trebalo biti ok. Ako ba코 ne ide, radije dodajte jo코 ulja nego vode, jer 캖e s vodom tijesto postat tvr캠e i 쬴lavije. Do 쬷ice max, nema potrebe za vi코e. \n\nAlternativno, 1. ubacite sve u mikser ili multipraktik, brrrrrr u pulsevima max minutu, nemojte skuhat jaja. \n\n5. Formirat kuglu, zamotat u plasti캜nu foliju i pustit da stoji 30 min. Ovo 캖e razviti malo glutena i opustiti tijesto. \n6. Ako mislite odmah skuhat pa코tu, prije 7. je idealno vrijeme da stavite zakuhat vodu. \n>! Ina캜e za suhu pa코tu, trebali biste dodat pola 쬷ice soli po litri vode. Znate da takvu pa코tu kuhate 10-ak min. Suha pa코ta se kuha jako kratko i jednostavno **ne stigne** upiti toliko vode, pa se mora jo코 vi코e zasoliti (ba코 ba코 puno). S obzirom da to vj ne캖ete napraviti, zato smo i dodali malo vi코e soli u tijesto.\n\n7. Dobro pobra코nit podlogu, idealno o코trim bra코nom ili grizom. Bit 캖e vam lak코e ako tijesto podijelite na par dijelova. Lagano razvaljajte tijesto, preklopite na tre캖ine i onda opet razvaljajte. 맚o vi코e puta tako laminirate tijesto, to bolje. Uglavnom, kad ste spremni, razvaljati tijesto u jednu dugu traku. Ako mislite da ste dovoljno tanko razvaljali tijesto, vj ste u krivu, tijesto treba bit debelo 1-2 mm, tj. da si mo쬰te vidjet ruku kroz njega.\n7. Pobra코niti tijesto s gornje strane i lagano ga preklopiti/zarolati po du쬴ni, tako da ga mo쬰te normalno narezat u trake 코irine 7-8 mm.\n8. Kad ste sve narezali, bacati ta klupka u pobra코njenu podlogu, ako je gdje zapelo, ru캜no odmotat. I pobra코niti da se ne lijepe. Ako imate vi코ak nerazvaljanog tijesta, zamotajte u plasti캜nu foliju i u fri쬴der ili zamrziva캜 s tim. Ako ste razvaljali, pobra코niti i osu코iti pa 캜uvati u zatvorenoj posudi u fri쬴deru ili smrznuti.\n9. Kuhat pa코tu dok ne bude al dente, nekih 90 sekundi.\n\n![](assets/2021-05-14/00069.jpeg)\n\nNaribat parmezan ili granu padano po 쬰lji, ali svakako probajte i bez, dovoljno je fino. \n\nAko ste vi i osoba/e za koju ovo radite razli캜ite osobe, nato캜ite si svakom po 캜a코u vina. Ako su ista, duplo, zaslu쬴li ste 游땖",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "[deleted]",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190137": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "vidim da ljudi rade romane ovdje, pa treba covjek i nesto drugo raditi u danu a ne samo kuhat\n\n### Francuski krumpir\n\n- 5 ozbiljnijih krumpira\n- 6 jaja\n- [Paket kranjskih kobasica](https://www.konzum.hr/web/products/pik-kranjska-kobasica-300-g)\n- 1 vrhnje za kuhanje, 250 ml\n\n#### Upute\n1. Isperi krumpir i stavi ga kuhati u vrelu vodu na nekih 35 - 40 minuta, ne previse da se poslje nebi raspadao\n2. Paralelno stavi kuhat kobasice na 15 minuta\n3. Kad su kobasice gotove stavi kuhat 5 jaja na 10 minuta i u meduvremenu razrezi kobasice na ploske\n4. Kad su jaja gotova oguli ih, sad bi krumpir trebao biti pri kraju, pa oguli i njega kad zavrsi\n5. Pomjesaj vrhnje za kuhanje i 1 jaje s malo soli\n5. Premazi posudu za pecenje s malo maslaca\n6. Upali pecnicu na 200 stepeni\n7. Postavi layer krumpira\n8. Postavi layer mjesano kobasica i jaja razrezanih na ploske\n9. Premazi layer s mjesavinom vrhnja + posoli + popapri\n10. Ponavljaj korake 7, 8, 9 dok ne ostanes bez sastojaka\n11. Ako je ostalo nesto vrhnja, mos prolit po vrhu, pecnica bi sada trebala biti na 200 stepeni\n12. Baci to u pecnicu i cekaj 40 minuta\n    \n\n![](assets/2021-05-14/00070.png)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Koalefant",
          "NekocBraca",
          "STAGGER_LEE",
          "Svarog (Veles)",
          "Zogen",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "mentally_disturbed_llama",
          "rija"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "NekocBraca",
          "STAGGER_LEE",
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "202229": {
      "poster": "[deleted]",
      "content": "https://youtu.be/o5CyWBwfLZ0\n\nhttps://www.youtube.com/watch?v=xV9spqCzSkQ\n\nhttps://www.youtube.com/watch?v=NRRULZe0CdU",
      "votes": {
        "upvoters": [
          "Joskica",
          "djeno",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "206002": {
      "poster": "[deleted]",
      "content": "Purica mi izgleda ko krilo an캠ela\n\n![](assets/2021-06-12/00028.jpeg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Joskica",
          "Koalefant",
          "[deleted]",
          "gladiator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BigZ1",
          "iNavy (mornar Ica)"
        ],
        "wtf": [
          "Ovo_je_moj_nick"
        ],
        "tuga": []
      }
    },
    "209006": {
      "poster": "[deleted]",
      "content": "Jednostavan brownie, brzo i fino bez puno Nereda\n\npo ovom https://domacica.com.hr/najbolji-brownie/\n\nok recept, napravio bez secera i dobar je. Mozda malo vise pekmeza (stavio od grozda i smokve) i bolje da malo sirov nego malo suh\n\n![](assets/2021-06-17/00037.jpeg)\n\nlp",
      "votes": {
        "upvoters": [
          "Amon",
          "Emma63194",
          "Filemon",
          "Joskica",
          "Koalalica (zaba)",
          "Koalefant",
          "Svarog (Veles)",
          "Zogen",
          "[deleted]",
          "gladiator",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Ovo_je_moj_nick"
        ],
        "tuga": []
      }
    },
    "209339": {
      "poster": "Ovo_je_moj_nick",
      "content": "Southafrican bobotie (ne sjecam se da sam postao)\n\n![](assets/2021-06-18/00015.png)",
      "votes": {
        "upvoters": [
          "AVRFreak",
          "Filemon",
          "KitKat (H(x))",
          "Svarog (Veles)",
          "Zogen",
          "[deleted]",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "209857": {
      "poster": "Filemon",
      "content": "## Cacio e pepe \nSavr코eno jelo za vrijeme ispita, od trenutka kad zakuha voda do kad ste gotovi, manje od 15 min.\n\nTehni캜ki malo zahtijevnije, jer treba pogodit temperaturu da se sve lijepo pove쬰.\n\nTe쬴na: 7/10\n\nVrijeme: 20-ak min\n\nza 2 porcije\n\n- 250 g 코pageta\n- 100 g sira Pecorino Romano (ako nemate, mo쬰 Parmigiano Reggiano, ako nemate mo쬰 Grana Padano, ako nemate mo쬰 tvrdi kravlji ili ov캜ji sir)\n- 2 쬷ice crnog papra\n- sol\n\n\n1. Zakuhat zasoljenu vodu. 콯elimo ve캖u koncentraciju 코kroba, pa malo manje vode.\n2. Stavite kuhat pa코tu.\n3. U vru캖oj tavi tostirat papar (opcionalno) pa grubo zdrobit/samljet.\n4. Naribati sir i izmije코at ga u nekoj posudi ili 코alici s paprom.\n5. Nekih 3 min prije kraja kuhanja, postepeno umije코at vodu od pa코te u ono gore, dok ne dobijete konzistenciju paste.\n6. Pa코tu ocijedit (sa캜uvati jo코 malo vode) i pustite na min da se malo ohladi.\n7. Sad dodajte onu smjesu u pa코tu i mije코ajte kao nikad u 쬴votu. Trebalo bi bit taman rezidualne topline da se sve otopi, radite umak od sira koji daje slano캖u, mast i proteine, papra i 코krobne vode kao jedine stvari koja to povezuje. Po potrebi dodat jo코 vode od kuhanja. Dobit 캖ete jedan svilenkasti umak koji prelijeva 코pagete.\n\n   Ako je pretoplo, sir 캖e se zgrudat, ako je previ코e vode, ne캖e se povezat, ako je prehladno, sir se ne캖e otopit.\n8. Servirat, na vrh mo쬰te naribat jo코 malo sira i samljet jo코 malo papra.\n\n\nJa sam koristio bijeli papar pa se ne vidi ba코 taj papar, ali bilo ga je haha.\n\n![](assets/2021-06-19/00028.jpeg)",
      "votes": {
        "upvoters": [
          "BreadCat",
          "KitKat (H(x))",
          "Piki",
          "Svarog (Veles)",
          "[deleted]",
          "djeno",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "209862": {
      "poster": "djeno",
      "content": "@Filemon#209857 +1\n\nOvo al umjesto papra kvalitetno masilnovo ulje, tanko narezane kriske cesnjaka i crvene paprike (red pepper flakes) i jedan fini aglio e olio isto jedna fina minimalisticna tjestenina.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Ovo_je_moj_nick",
          "SaboteurSean"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220364": {
      "poster": "KitKat (H(x))",
      "content": "### Povrtni curry\n\n**Sastojci:**\n\n1) Za zapr코ku:\n\n3 쬷ice bra코na\n\n3 쬷ice maslaca\n\n1 쬷ica curryja\n\n1 쬷ica garam masale\n\n1/2 쬷i캜ice kajenskog papra\n\n2) ostalo:\n\n1 batat\n\n1 krumpir\n\n2 paprike (1 crvena, 1 zelena)\n\n1 luk\n\n1 mrkva\n\n1 tikvica\n\n1 patlid쬬n\n\n400 grama 코ampinjona\n\n5-6 cherry raj캜ica\n\n묚ca 1 쬷ica naribanog svje쬰g 캠umbira\n\n ILI 1 쬷i캜ica 캠umbira u prahu\n\n묦tprilike 0.4 L povrtne juhe\n\n ILI 1 쬷ica Vegete, sol i papar\n\nPostupak za zapr코ku:\n1. Rastopi maslo\n2. Umije코aj bra코no\n3. 10-15 minuta povremeno mije코ati na osrednjoj vatri dok smjesa ne poprimi boju 캜okolade \n4. Ubaciti za캜ine za zapr코ku, i mije코ati na jakoj vatri 20ak sekundi\n5. Prebaci smjesu u neku 코alicu sa strane\n\nPostupak za ostalo:\n1. Pripremi povr캖e. Izre쬴 luk i papriku na trake. Krumpir i batat na kockice. Cherry raj캜ice na polovice. Ostalo na neke razumno-dimenzionalne komade.\n2. Gljive i raj캜ice ostavi sa strane za sada. Ostalo povr캖e razdvoji u dvije kategorije. Skupina 1 - batat, krumpir, mrkva, luk. Skupina 2 - sve ostalo.\n3. Zagrij maslinovo ulje u velikom loncu.\n4. Na to baci povr캖e prve skupine, pospi ga 캠umbirom i 1 minutu to pr쬴 na najja캜e\n5. Podlij vodom (tako da fino pokrije dno i ni코ta ne zagori), poklopi, smanji na laganu vatru i pusti da se to kuha potparavanjem jedno 15 minuta.\n6. Za to vrijeme, u nekoj tavi sa strane ispr쬴 povr캖e skupine 2. Najbolji redoslijed dodavanja povr캖a je paprika  patlid쬬n  tikvice\n7. Nazad na skupinu 1. Sad kad se fino skuhalo pod parom dodaj juhu (ili zamjenu za juhu), odvrni na najja캜e i pusti da prokuha na 2-3 minute.\n8. Dodaj ispr쬰no povr캖e skupine 2 i zapr코ku iz 코alice. Smanji na lagano\n9. Prepr쬴 gljive na tavi i ubaci ih u lonac\n10. Ubaci cherry raj캜ice\n11. Ako treba jo코 posoli/popapri i gotovo. Poslu쬴 s ri쬺m.\n\n_\"맚a je najbolje, ovo je fino, ovo 캜ak mogu jesti bez mesa\"_\n\n~ moj brat, meso쬯er za svaki obrok\n\n_\"Ako ovo vegetarijanci jedu, onda mo쬯a nije te코ko biti vegetarijanac\"_\n\n~ mater\n\n![](assets/2021-07-08/00032.jpeg)",
      "votes": {
        "upvoters": [
          "BigZ1",
          "Bog (Charlie Brown)",
          "Filemon",
          "Smolaa",
          "Svarog (Veles)",
          "[deleted]",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220370": {
      "poster": "[deleted]",
      "content": "https://youtu.be/JEH7DkVdTt4",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220571": {
      "poster": "Ovo_je_moj_nick",
      "content": "@KitKat#220364 Sori al kad vidim u nekog balkaniziranu verziju azijskog jela, pitam cemu.\n\nNIje da se zelim ali vjerojatno cu se posrat sad na recept, al dat cu i savjet.\n\nPar stvari, maslinovo ulje nema smisla stavljat u curry (thai style), zaprska je nesto sto se stavlja u umake a ne u curry, maslac je bacen bezveze u ovakvo jelo jer cini sve samo masnije bez previse okusa zbog jacine zacina, krumpiru je mjesto u pecnici ili gulashu ne u curryu, patlidzan bih isto izostavio jer s paradajzom/pomidorijem se pretvori u gumenu tvorevinu,.\n\nAko hoces probat super curry evo ti moj savjet:\n\nPretpostavljam da u zadnje vrijeme u HRu mozes kupit ovo *crveni, ljubicasti, zeleni ili narancasti sam probao, crveni je najljuci od svih, a zeleni najblazi):\n\n![](assets/2021-07-09/00008.png)\n\nUzmes wok (ili neku duboku kuharsku rajnglu koja je slicna oblikom).\n\nSastojci:\n- svjez dzumbir,\n- luk (veliki)\n- mrkva (3-4),\n- brokula(velika)\n- slatke mahune? (ne znam kak se te edamame zovu)\n- crvena rog paprika (sladja je ali moze bilokakva) tipa jedna ili dvije\n- mladi kukuruz\n- bean sprouts (ako ih mozes nac u ducanu)\n- red thai curry paste\n- maslac od kikirikija (ne obicni)\n- suncokretovo ulje\n- sezamovo ulje\n- kokosovo mlijeko (punomasno) 400ml x 2\n\nOptional: soy sauce (ako hoces dodat sol u okus), tahi basil (vrlo tesko nac), kefir leaves (guglaj kak se koristi, slicno ko lovorov list), fish/oyster sauce (nemoj guglat kako se pravi :) )\n\nOces li jest meso s tim ja stavim kozice (shrimps) ili piletinu (svinjetina ne pase jer nemrem nac nezilavu svinjetinu)\n\nPrimjer s kozicama\n\nNarezes luk na reazne, mrkvu isto, tikvice isto, mrkvu te piletinu (ako ces to radit). \n\nU Wok stavis ulje, zagrijez, i dodas zlicu crvenog currya i maslaca od kikirikija, pazi da ne zaprzis previse, ako se bojis ljutine, otvori cijeli stan prije nego se ugusis. U to ubacis kozice, preprzis ih da ne budu previse sirove ali niti da budu gumene. maknes ih van kad si gotova, dodas ulja ako treba i stavis mrkvu da omeksa na jacoj vatri, pa dodas luk, dzumbir u kockice narezan (pazi da se ne zagori) i onda dodas papriku i onda tikvice (dodas sve u tom redoslijedu dok se trenutno povrce ne cini da se omeksalo). Uzmes limenku kokosovog mlijeka i onaj masni dio sa zlicom umjesas u sve i dodas vodu ako ti se cini da je pregusto (ovisi o kokosovm mlijeku, ja nekad dodam samo masni dio, nekad i vodu jer je ukusnije i dobijem vise umaka). Kad to zakipi ubacis nazad one kozice, mladi kukuruz, edamame mahune (ono iznutra, ako hoces cijele s olupinom onda ih dodaj prije jer budu sirove). Dodaj i brokulu da se ne bude sirova ali ni prekuhana, prakticki kad je brokula gotova, sve je gotovo.\n\nNa kraju posipas sezam ova ulja za aromu, bacis thai basil i umjesas bean sprouts da ne budu skroz sirove al ne ih kuha u sosu. To posluzis ili sa vermicellima (tanki rizini rezanci) ili rizom.\n\nEvo par slika od nekih random verzija kaj sam radio sa zelenim i crvenim:\n\n![](assets/2021-07-09/00009.png)\n\n![](assets/2021-07-09/00010.png)\n\n![](assets/2021-07-09/00011.png)",
      "votes": {
        "upvoters": [
          "KitKat (H(x))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220592": {
      "poster": "KitKat (H(x))",
      "content": "@Ovo_je_moj_nick#220571 maslinovo ulje mi je ovdje realno samo za pr쬰nje, tako da specifi캜no ulje kao nema ni puno utjecaja, pa sam samo uzela ono zdravije, jedina izmjena je zapravo tikvica umjesto Hokkaido tikve i 코ampinjoni umjesto nekih fensi shitakea + ova inovacija s vegetom ako nemam juhu. Ostalo nije bilo izmjena.\n\nOvo je zapravo bazirano na curryju japanskog stila, a curry ina캜e nije njihovo jelo, nego je relativno nedavno uvezeno i prilago캠eno 캜injenici da oni ne jedu toliko ljuto kao ovi uokolo azijati, pa ovo ajmo re캖i ni nije stvoreno da bude ljuti curry kao ve캖ina njih, nego ba코 da bude neki ubla쬰ni curry-umak-gula코 ne코to.\n\nOve curryje kakve ti spominje코 isto znam raditi, tipa Thai s kokosovim mlijekom (samo nisam na코la pastu, pa umjesto toga kupujem za캜ine koji idu u pastu pa ih ubacim unutra u otprilike omjeru, i samo radim ove koji nemaju kikiriki jer radim za sve doma, a brat je alergi캜an, pa 코to je tu je) ili one razne pajeet curryje koji 쬬re i pale, ali ovo nije to.\n\n Hvala na savjetu svejedno.\n\nMaslac tu ide kao podloga ovom 15-minutnom paljenju bra코na, nije tu zbog okusa masla, nego tako da dobije코 zemljani okus nakon 코to si to po코teno spalio (tako캠er treba luftati dok kuha코, jer 캖e svi inace mislit da ne코to gori).\n\n맚o se ti캜e patlid쬬na, razlog za코to ga uprzis sa strane je ba코 zato da ne postane guma nego zadr쬴 oblik i postane onako kao malo crispy. \n\nU vezi sastojaka za azijske, neke stvari je tu sad jako lako na캖i (tipa soja umak, hoisin, kokosovo mlijeko, za캜ine u prahu ima kupiti u harissi...), ali neke stvari jo코 nisam nigdje na코la (tipa gochuyang za korejsku)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Ovo_je_moj_nick",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220608": {
      "poster": "Ovo_je_moj_nick",
      "content": "@KitKat#220592 OK, sad je malo jasnije kakav je to curry :D\n\nJapanci vole jako slatko, gotovo su gori od koreanaca (koji su u proteklih 15-20 godina tek presli na super ljutu hranu, prije nisu tak opaki bili).\n\nHoisin je meni predobro nesto, malo tamnog soy sosa s shitake aromom, piletina, stir fry povrce, zmjesas is gg\n\nZgleda nesto slicno ovom:\n\n![](assets/2021-07-09/00015.png)\n\nOsim klasicnog teriyakija mozes probat tonaktsu, yakitori il tipa yakisoba (jedan od ovih je prakticki ko kecap xD ali na drogama).\n\n![](assets/2021-07-09/00016.png)",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220991": {
      "poster": "[deleted]",
      "content": "Be캜ke kocke\n\n>!![](assets/2021-07-10/00002.jpeg) \n\n>Slika malo kriti캜na jer se brzo tope\n\nJednostavan i lagan 캜okoladni kola캜 za ove vru캖e i te코ke dane. Jako zahvalan, nemre se sjebat i gotov je u manje od sat vremena. Po volji se mo쬰 izmjenjivat, tipa natopit biskvit sokom od oran쬰 ili namazat s malo pekmeza...\n\nBiskvit:\n- Izmiksat 6 쬿tanjaka i 6 쬷ica 코e캖era (izostavio 1/3 cukra)\n- Postepeno uz miksanje dodavat 1dl ulja, 1dl mlijeka i mix 6 쬷ica o코trog bra코na, 4 쬷ice kakaa i pola pecivnog pra코ka\n- U snijeg istu캜 6 bjelanjaka i uklopit ih u ovog ore\n\nKrema:\n- Rastopit 250g 캜okolade za kuhanje (ili neke kombinacije tamnih) u 0,5l vrhnja za 코lag\n- Prelit preko pe캜enog biskvita, za bolji spoj se mo쬰 gornja korica biskvita maknut\n- Hladit par sati u fri쬴deru (al najsla캠i jo코 dok lagano topao 캜im se krema malo stisne)",
      "votes": {
        "upvoters": [
          "Joskica",
          "KitKat (H(x))",
          "Svarog (Veles)",
          "[deleted]",
          "iNavy (mornar Ica)",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222718": {
      "poster": "[deleted]",
      "content": "Studentski dan - Hrenovke u lisnatom\n\nTe쬴na: 1,8/10\n\nCijena: <30kn za dvoje\n\n- [Hrenovke](https://www.konzum.hr/web/products/pik-hrenovke-hot-dog-250-g)\n- [Lisnato](https://www.konzum.hr/web/products/ledo-lisnato-tijesto-500-g)\n- Sitnice kojih ina캜e ima u kuhinji\n\n\n1. Dok se hrenovke kuhaju, razvaljat tijesto uz pomo캖 gospodina o코trog ili kukuruznog bra코na (1,1H x H), H=코irina renovke\n2. Namazat sve fino senfom i nabacat komadi캖e bilo kakvog (mo쬰 i krem) sira\n3. Zamotat osu코ene hrenovke, izbost tijesto vilicom, premazat maslacem (rastopit u ruci samo tjt.), posut kimom, soli, sezamom i sl. (ako vam se ne kupuje na \"veliko\", a dobri ste si sa tetom u konzumu na pekari - ona ima hrpu tih paketi캖a malih sa zrnjem)\n4. U rol dok se ne spe캜e, cca 15-20min\n5. Za umakanje majoneza il paradajz sos sa bosiljkom\n\nOvo je jedna od onih stvari koje su tolko jednostavne da se ne mogu sjebat, a 캜ovjeku unose neizmjernu sre캖u i dok ih radi i dok ih jede. I najbolje - ujutro ne morate izlazit iz ku캖e do pekare. Gotovo u pola sata taman dok obavljate neku jutarnju rutinu.\n\nPreporu캜eno pi캖e: tonik s limetom (ljeto/prolje캖e) / bijela kava ili lagani kakao (jesen/zima)\n\n>!![](assets/2021-07-15/00004.jpeg)",
      "votes": {
        "upvoters": [
          "Amon",
          "Joskica",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222727": {
      "poster": "iNavy (mornar Ica)",
      "content": "@Nostro#220991 niste naveli pri kojoj temperaturi i koliko vremena je potrebno pe캖i biskvit, srda캜an pozdrav",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Filemon"
        ]
      }
    },
    "222729": {
      "poster": "[deleted]",
      "content": "@iNavy#222727 pardon, imam neki stari plinski rol pa sve ide otprilike. Provjerio sam na receptu, al 캜ini se kako ni ujnu nije bolio kurac za to...\n\nNo neki recept na internetu, skoro identi캜an, kazuje sljede캖e:\n\n> Pe캖nicu upalite na 180C i ostavite da se grije. \n\n...\n\n>Duboku tepsiju promjera otprilike 35*24 cm oblo쬴te papirom za pe캜enje, smjesu izlijte u tepsiju i stavite pe캖i oko 20 minuta. Kako vam se krema kasnije nebi odvajala, gotovom biskvitu odre쬴te gornji sloj korice.\n\nU slast",
      "votes": {
        "upvoters": [
          "Filemon",
          "iNavy (mornar Ica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222733": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@iNavy#222727 \n\ntreba se ispec brzo bez da zagori => 200 stepeni 20 minuta\n\ntreba se ispec sporo smije zagorit => 180 stepeni 30 minuta\n\ntreba se ispec sporo bez da zagori => 180 stepeni 20 minuta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Filemon",
          "iNavy (mornar Ica)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "222735": {
      "poster": "mentally_disturbed_llama",
      "content": "@Nostro#222718 Ako 쬰lite manje posla, hrenovke nije potrebno prethodno kuhati jer se ionako termi캜ki obrade dok se peku u tijestu (koje nije potrebno bosti vilicom, nikad to ne radim, a koristim isto tijesto). Tako캠er, preporu캜am premazati ih prije pe캜enja jajetom da dobiju lijepu zlatnu boju umjesto da budu ovako blijede.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222948": {
      "poster": "[deleted]",
      "content": "https://cdn.discordapp.com/attachments/693291636528119838/864967811624730684/Sigma_cooking.mp4",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "tata (NISAM ASISTENT)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "222949": {
      "poster": "[deleted]",
      "content": "@Patr0la#222948 @micho pro tip za kad ti pizza izgori - vidjeh iz par tvojih slika ovdje da ti je to 캜est problem.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "Log3 (Jaha캜 Kali Yuge)",
          "Man (쉭숉aM쉭쉭)",
          "Smolaa",
          "Svarog (Veles)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "menace_master"
        ],
        "wtf": [],
        "tuga": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ]
      }
    },
    "222967": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Patr0la#222949 Jedini put kad mi je pizza malo izgorjela je kad sam prvi put koristio pe캖nicu, sad ni ne mo쬰 izgoriti kad sam je uspio dovesti na 8 minuta pe캜enja (od inicijalnih 13).\n\nLjudi koji misle da je ja캜e ispe캜eno mjesto na pizzi znak da je izgorjela na쬬lost nikad nisu jeli pravu pizzu 游땴",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222969": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "Coek zove zagorena mjesta \"jace ispecena\"游땍",
      "votes": {
        "upvoters": [
          "Log3 (Jaha캜 Kali Yuge)",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "HeHe (Direktor 쬴vota)",
          "Log3 (Jaha캜 Kali Yuge)",
          "MarokMarsci (Collapse Enjoyer)",
          "menace_master"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "222977": {
      "poster": "SinanSuckich (Yelena)",
      "content": "Jel imate neke alternative soja sosu za wokove? Volio bi umakasto na tu foru, ali je onda preslano sa soja sosom",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222980": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "@SinanSuckich#222977 worchestershire mozda.",
      "votes": {
        "upvoters": [
          "SinanSuckich (Yelena)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222985": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@SinanSuckich#222977 Ima코 soya soseva koji su manje slani. Npr. Kikkoman nije uop캖e slan. Al poanta soje ti je da ne stavlja코 dodatnu sol ionako, ak stavlja코 sol + soju sve 캖e ti biti preslano.\n\nFunkcionalno nema코 istu stvar, ako tra쬴코 fermentirani umak onda da, Worcestershire je najbli쬴, ali s obzirom na to da taj umak nije nikako za코ti캖en ili standardiziran opet mo쬰코 nai캖i na razne umake - oni jeftiniji su ti vi코e manje slankava voda, za koktele, tebe zanimaju neki mid-tier, a la Heinz - oni su ti tamniji i gu코캖i od tih i nisu primjereni za koktele koliko za kuhanje.",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "SinanSuckich (Yelena)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222986": {
      "poster": "[deleted]",
      "content": "@micho#222967 \n\nhttps://im3.ezgif.com/tmp/ezgif-3-3fac4dc3e736.gif",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222990": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Man#222969 Zna se za코to pizza ima na nekim mjestima zagorjele krugove, plebejci nikad ne캖e razumit 游땴游땴游땴",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222993": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "ucopeavas se sve vise i vise. nije toliki bed sta ti zagori malo pizza",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222999": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "> @micho#222990 Zna se za코to pizza ima na nekim mjestima zagorjele krugove\n\n\n\nzato sto je nisi izvadio na vrijeme pa ti je zagorila",
      "votes": {
        "upvoters": [
          "Log3 (Jaha캜 Kali Yuge)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Filemon",
          "Log3 (Jaha캜 Kali Yuge)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223002": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@MarokMarsci#222999 Sigurno je zato\n\n![](assets/2021-07-15/00022.jpeg)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223004": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223002 dokaz da ni napolitanci ne znaju izvadit picu na vrijeme",
      "votes": {
        "upvoters": [
          "Fica (Prof)",
          "HeHe (Direktor 쬴vota)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223005": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223002 di je 코unka",
      "votes": {
        "upvoters": [
          "HeHe (Direktor 쬴vota)",
          "SinanSuckich (Yelena)",
          "[deleted]",
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223006": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@MarokMarsci#223004 Na쬬lost jedino se napuljska pizza smatra pizzom 游봃",
      "votes": {
        "upvoters": [
          "NekocBraca",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": [
          "SinanSuckich (Yelena)"
        ]
      },
      "reactions": {
        "haha": [
          "Man (쉭숉aM쉭쉭)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223007": {
      "poster": "[deleted]",
      "content": "@micho#223002 kad ima opekline po vrhu i po siru to je ono uuu, nije ak se tijesto raspada od skurenosti",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223008": {
      "poster": "[deleted]",
      "content": "@micho#223006 tvoje misljenje, a ne cinjenica 游봃",
      "votes": {
        "upvoters": [
          "AVRFreak",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223010": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Nostro#223007 Pa da, tak i treba izgledati",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223011": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@micho#222990 zasto?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223012": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223006 kog boli kurac sta zabari smatraju picom, nisu je oni izumili",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223013": {
      "poster": "Filemon",
      "content": "@MarokMarsci#223012 *digi캖i, 쬬bari su Francuzi",
      "votes": {
        "upvoters": [
          "Amon",
          "Log3 (Jaha캜 Kali Yuge)",
          "MarokMarsci (Collapse Enjoyer)",
          "NekocBraca",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223014": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@tata#223011 Kad se pizza pravilno ra코iri tehnikom 코amaranja, na rubu se akumuliraju svi zra캜ni jastu캜i캖i od kvasca. Ono 코to se dogodi je da neki ve캖i zra캜ni jastu캜i캖i budu na povr코ini kore, pa prilikom pe캜enja br쬰 dehidriraju od ostatka tijesta, i onda izgore. Tako da ako pizza nema takvih mjehuri캖a, to je indikator nepravilno razvu캜enog tijesta i/ili preslabe pe캖nice.",
      "votes": {
        "upvoters": [
          "bb8 (zaza)",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223016": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@MarokMarsci#223012 ako misli코 na digi캖e, jesu, zato je i za코ti캖ena ahaha",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223018": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "Uredu je ne znati radit pizzu ja nez zas ti je toliko tesko priznati. nece ti se ego raspast odmah",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223019": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "> @micho#222967 kad sam je uspio dovesti na 8 minuta pe캜enja (od inicijalnih 13).\n\nKoja temperatura? Da ostavim 8 minuta imam osjecaj da bih dobio ugljen",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223020": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223016 picu su izumili stari grci, a hrvati je usavrsili formirajuci je u revolucionaran cetvrtasti oblik minimalne debljine tjesta od 10cm\n\novo sto digici rade je travestija koja im je dopustena samo zato sto su prije nas usli u EU",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "Gussy (huba buba)",
          "HeHe (Direktor 쬴vota)",
          "Log3 (Jaha캜 Kali Yuge)",
          "Man (쉭숉aM쉭쉭)",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "mAcaLukas (mAca Lukas)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Filemon",
          "Gussy (huba buba)",
          "Log3 (Jaha캜 Kali Yuge)",
          "SaboteurSean"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223023": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@iLabaviUmeDaZabavi#223019 Nemam pojma, grija캜i su na 400, tako da pretpostavljam 4 minute na 250, 2 minute na 250 ali i s grija캜em od gore, 2 minute na 300-350 od gore.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223025": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@MarokMarsci#223020 To 코to su grci radili nije pizza, nego je sli캜nije focacci, jer se radi o plosnatom kruhu, dok pizza nije kruh",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223027": {
      "poster": "Filemon",
      "content": "@micho#223023 jebote 코ta nije pe캜enje da kad ubaci코 unutra da si na miru dok ne zavr코i, da svake 2 min mijenjat temp",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223028": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223023 strozi temperature curve nego za reflow soldering jbt",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Filemon"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223032": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223025 kaka fokaca sta pricas ti\n\ngrci su napravili tiesto, hrvati su stavili paradajz, sunku, gljive i sir na to\n\npoharali svijet s picom i talijani nam oduzeli i to, jebeni mlecani",
      "votes": {
        "upvoters": [
          "Filemon",
          "Gussy (huba buba)",
          "Man (쉭숉aM쉭쉭)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223033": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Filemon#223027 Ne mijenjam temperaturu, nego se mijenja pozicija pizze - prvo je na limu donjeg grija캜a, zatim se pali i gornji grija캜 koji nije natkriven jednom kad stavim sir i ostatak paradajza, koji podi쬰 temperaturu, a nakon svega toga pomi캜em pizzu za mjesto gore, gdje je 5 cm od nenatkrivenog gornjeg grija캜a\n\nNemam dovoljno jaku pe캖 da se odjednom ispe캖e, pa trebao bih 500 stupnjeva hahah",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223035": {
      "poster": "[deleted]",
      "content": "zagorena pizza bez mesa, ne hvala radje cu uzet mini pizzu od 5kn iz pekare kek",
      "votes": {
        "upvoters": [
          "HeHe (Direktor 쬴vota)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Gussy (huba buba)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223036": {
      "poster": "Gussy (huba buba)",
      "content": "@micho#223033 mozda da ne otvaras rernu svake dvije sekunde bi se mo쬯a stigla zagrijat",
      "votes": {
        "upvoters": [
          "Filemon",
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Filemon",
          "jadzia-dax (Jadzia Dax)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223037": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@MarokMarsci#223032 Pa gr캜ka verzija \"pizze\" je kruh, takvo tijesto se razli캜ito radi od tijesta za pizzu i ne mo쬰 bit pizza kad pizza nema tijesto kruha lmao\n\nA Hrvati onda shodno tome nisu mogli napraviti pizzu jer su radili sli캜no stvar kao i grci, prakti캜ki foccacciu s nadjevom.\n\nCope harder bro",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223039": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@Gussy#223036 zato mu i zagori, vrh se prepece jer je blizi grijacu, a pica mu bude prijesna jer lamata vratima\n\ni on je neki kuvar astiboga",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Filemon",
          "Gussy (huba buba)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223041": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223037 a jesi ga i ti nasro semantike\n\npopusio si previse talijanske propagande, sad ces mi jos rec da se Pa(g)midjano Redjano nije sa Paga",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Filemon",
          "Svarog (Veles)",
          "bb8 (zaza)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223044": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@Filemon#223027 Ja isto pecem na vise x jer ako odma stavim mozzarelu dobijem bazen",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223045": {
      "poster": "Gussy (huba buba)",
      "content": "Talijani marketinski eksperti prodali pricu da je pizza nastala kao na random u napulju lol\n\nTako jednostavno jelo definitivno nije moglo nastat nigdje drugdje",
      "votes": {
        "upvoters": [
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "MarokMarsci (Collapse Enjoyer)",
          "Svarog (Veles)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223046": {
      "poster": "[deleted]",
      "content": "mozete vi i nastimavat je na milijun nacina i dalje ste papucari ako si je sami radite, a ne mama ili zena\n\n游땙游뛃",
      "votes": {
        "upvoters": [
          "AVRFreak",
          "Gussy (huba buba)",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Gussy (huba buba)",
          "HeHe (Direktor 쬴vota)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223047": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@ElitePer#223046 tako je, mi smo tu da jedemo pice",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223048": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@MarokMarsci#223041 Ma zapravo u pravu si",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "wtf": [
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "Log3 (Jaha캜 Kali Yuge)",
          "NekocBraca",
          "SinanSuckich (Yelena)"
        ],
        "tuga": []
      }
    },
    "223049": {
      "poster": "[deleted]",
      "content": "@Gussy#223045 \n\n9/11 'bombasticno ljuta' pizza iz DoomsDaya  > bilo koja vasa splacina\n\n驕뢢잺游땙",
      "votes": {
        "upvoters": [
          "Gussy (huba buba)",
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Gussy (huba buba)",
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223051": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@micho#223048 \n\nhttps://www.youtube.com/watch?v=0DfAPunYDwc",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223053": {
      "poster": "Gussy (huba buba)",
      "content": "@micho#223048 jeri ovo moguce",
      "votes": {
        "upvoters": [
          "Filemon",
          "Log3 (Jaha캜 Kali Yuge)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Log3 (Jaha캜 Kali Yuge)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223060": {
      "poster": "HeHe (Direktor 쬴vota)",
      "content": "@micho#223014 preveliki tradeoff. Normalno razvu캜eno tijesto ima istu strukturu, a ne jedem 캜a캠u. Da sam htio 캜a캠u zapalio bi garci",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223062": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "> @micho#223014 pica pravilno ra코iri tehnikom 코amaranja\n\na dobro sad, ovisi dal voli grubo il ne",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "NekocBraca"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223064": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "> @HeHe#223060 Normalno razvu캜eno tijesto ima istu strukturu, a ne jedem 캜a캠u.\n\nNadam se da ne misli코 na ono 코to si jeo kod mene, 코to je ujedno i prva pizza koju sam ispekao u tom stanu lol",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223294": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "https://www.youtube.com/watch?v=rhwY04UAPmk",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Asura (Asura)"
        ],
        "wtf": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "223313": {
      "poster": "[deleted]",
      "content": "(nazalost) mico je potpuno u pravu oko svega sto je rekao",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223318": {
      "poster": "Gussy (huba buba)",
      "content": "Square,10cm debela, gauda iz studenca pizza",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "General_Kenobi (Aborteur)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "223332": {
      "poster": "AVRFreak",
      "content": "@MarokMarsci#223004 \n\nNajvi코e mediocre pizzu sam jeo u Napoliju.",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223571": {
      "poster": "Stimmar",
      "content": "Netko probao ovo? https://en.wikipedia.org/wiki/Dishwasher_salmon",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "AVRFreak"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "223610": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Stimmar#223571 Svakih par godina do캠e u fokus, ukratko ne radi - perilice, bar one kod nas, rade na temperaturi od 55춿. To ti nije dovoljno da se losos ispe캜e, jer nije dovoljno velika temperatura da ubije bakterije. A i ako ignorira코 to, trebalo bi ti 2-4 sata glavnog ciklusa sa se ispe캜e neki komad, i to jako malo. A da ne govorimo da ribu ne 쬰li코 pe캖i dugo na maloj temperaturi jer 캖e코 ju isu코iti - losos konkretno se ili ne pe캜e, ili se dimi, ili se pe캜e na velikoj temperaturi nakratko.\n\nEDIT: Naravno da postoji po코irani losos, ali s obzirom na (ne)kvalitetu lososa kod nas si ne mo쬰코 priu코titi riskirati s bakterijama, a i radi na코e kuhinje bi valjda ve캖ina ljudi rekla da taj losos nije dovoljno kuhan (jer po코irani losos, taj iz perilice su캠a, ispadne u쬬sno vla쬬n i mlohav, sli캜an je sirovom)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223761": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "@micho#223610 ma kakve bakterije, dao bi se kladiti da jedes i piletinu well done zbog svojeg paranoicnog straha od \"salmonele\" ili neceg",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223764": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Man#223761 Ne jedem piletinu jer nisam degymnerate",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223765": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "Sta god da to znaci vjv bi bio bolji da jesi to",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Heklijo (Geralt of Rivia)",
          "Log3 (Jaha캜 Kali Yuge)",
          "RS7"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "231951": {
      "poster": "KitKat (H(x))",
      "content": "### Ezogelin 칞orbasi iliti 캜orba od le캖e po turski\n\n**Sastojci:**\n\n1.5 코alica crvene le캖e\n\n1 코aka bulgura\n\n1 luk\n\n1 mrkva\n\n1 krumpir\n\n1 manji paradajz (oguliti koru)\n\n1/2 캜ili papri캜ice\n\n2 코alice pile캖e juhe ili 2 pile캖e kocke za juhu\n\n1 쬷i캜ica soli\n\n1 쬷i캜ica papra\n\n1 쬷i캜ica 캜ilija\n\n1 쬷i캜ica slatke paprike\n\n1 쬷ica koncentrata raj캜ice\n\n1 쬷ica paste od paprike (ima kupiti u pekin코koj patki, ako nema코, probaj zamijeniti s jo코 dodatno 캜ilija i paprike)\n\n1 쬷ica mente \n\n묤aslac \n\n묤aslinovo ulje\n\n**Postupak**\n1. Nasjeci povr캖e, nije bitno kako, ionako 캖e코 ga kasnije smiksati. Isperi bulgur i le캖u pod vodom\n2. Stavi 쬷icu maslaca i cca 2 쬷ice maslinovog ulja u lonac\n3. upr쬴 povr캖e na tome zajedno s le캖om, bulgurom, koncentratom raj캜ice i pastom od paprike\n4. Dodaj juhu/pile캖e kocke, 2 litre vode, sol i papar, poklopi, smanji na osrednju vatru i pusti da kuha 15-20 minuta (dok krumpir ne bude gotov)\n5. Dodaj mentu, papriku i 캜ili. Nek kuha jo코 5 minuta\n6. Skini sa 코poreta i smiksaj 코tapnim mikserom\n7. Gotovo, poslu쬴 s kruhom i jogurtom\n\n![](assets/2021-08-24/00009.jpeg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Kuhar",
          "Ovo_je_moj_nick",
          "STAGGER_LEE",
          "[deleted]",
          "pipi (cicipjorica)"
        ],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231957": {
      "poster": "[deleted]",
      "content": "@micho#223610 ovisi jako odkud sourceas lososa i kako ga skladistis od polja (ili vode) do stola. sta se tice kuhanja ribe dugo na niskoj temperaturi to moze biti problematicno, ali na kraju krajeva svaki komad mesa mozes isusiti na dva nacina predugim kuhanjem gdje voda doslovno ispari i prevelikom temperaturom gdje vlakna proteina istisnu vodu van. Ovo sto si rekao glede pecenja losoa na visokoj temperaturi je tocno i to mi je najbolji nacin za spremit komad losoa al mozes se prema njemu ponasati kao i prema odresku gdje ga kratko zapeces pa basteas sokovima i putrom.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231958": {
      "poster": "[deleted]",
      "content": "@KitKat#231951 cim juha/varivo ima dva izvora masti odmah je bolja. kudos izgleda izvrsno",
      "votes": {
        "upvoters": [
          "KitKat (H(x))"
        ],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "238420": {
      "poster": "a-z0-9_- (쉻릖游낍勇꽳릛걱멇릖쉻릖쐑   -_9-0z-a)",
      "content": "https://cdn.discordapp.com/attachments/716908693991587912/889924457152512010/CHINA_NO.mp4",
      "votes": {
        "upvoters": [
          "Emma63194",
          "[deleted]"
        ],
        "downvoters": [
          "HeHe (Direktor 쬴vota)",
          "RS7"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Jakic007",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA D콯IN)",
          "rija"
        ],
        "tuga": []
      }
    },
    "238422": {
      "poster": "Log3 (Jaha캜 Kali Yuge)",
      "content": "@a-z0-9_-#238420  A tko 캖e drugi nego kinezi.",
      "votes": {
        "upvoters": [
          "Gussy (huba buba)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "238423": {
      "poster": "a-z0-9_- (쉻릖游낍勇꽳릛걱멇릖쉻릖쐑   -_9-0z-a)",
      "content": "@Log3#238422 je to nekakav rasizam?",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Log3 (Jaha캜 Kali Yuge)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "238428": {
      "poster": "Gussy (huba buba)",
      "content": "@a-z0-9_-#238420 jebo im bog mater kosooku",
      "votes": {
        "upvoters": [
          "LUJXIV",
          "a-z0-9_- (쉻릖游낍勇꽳릛걱멇릖쉻릖쐑   -_9-0z-a)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "Kaladonter",
          "Log3 (Jaha캜 Kali Yuge)",
          "RS7",
          "Svarog (Veles)",
          "a-z0-9_- (쉻릖游낍勇꽳릛걱멇릖쉻릖쐑   -_9-0z-a)",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA D콯IN)",
          "lobro7 (chetnick)",
          "rija",
          "tekamolo"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "239084": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Dobar supstitut za pepperoni na pizzi je Zlata dolina kulen. Ja sam to na코ao u Plodinama, mo쬯a ima i negdje drugdje, ugl. rade Zlovenci, u 300g pakiranju je i do캠e cca 30kn.\n\nZa sad ne mogu na캖i ni코ta bolje od togaaa\n\nA kulen je ina캜e i ovak dobar za jesti samo je o캜ito da je dio okusa u kemiji pri toj cijeni, i nije u onom klasi캜nom obliku koji se dobije kad se su코i u 쬰ludcu, nego je ko klasi캜na kobasica. Definitivno bolje nego Pik/Gavrilovi캖/Podravka spla캜ine",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239088": {
      "poster": "Kuhar",
      "content": "@micho#239084 \n\nDefinitivno najbolji kulen ima belje. Ja sam kupovao vec narezani u pakiranju i bio mi je najbolji od svih. Jedino sto zadnji put kad sam ga htio kupit nije ga uopce bilo. Nadam se da ga nisu povukli iz proizvodnje.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239089": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "> @Kuhar#239088 Nadam se da ga nisu povukli iz proizvodnje.\n\nTo je otrov... I ve캖ina tog je mast",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239090": {
      "poster": "Kuhar",
      "content": "@micho#239089 \n\nCini se sa ne mislimo na isti kulen. Jer ovaj definitivno nije sama mast, dapace jedan je od manje masnijih.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239091": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Kuhar#239090 IDK, ne bih svrstavao meso koje mo쬰코 kupiti u marketu kao fino ili kvalitetno, pogotovo ne Belje/Sljeme, to je neko캖 bilo F-tier meso, sad je sli캜no ko i ve캖ina ostalih brendova...",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239092": {
      "poster": "Kuhar",
      "content": "@micho#239091 \n\nJa sam ciljao na to da je od kupovnih, meni osobno, belje kulen me캠u najboljima. Ali da, kupovne salame treba 코to vi코e izbjegavat.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239300": {
      "poster": "[deleted]",
      "content": "@Kuhar#239092 iskreno ako ne jedes samosnicle siromasan si",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "239610": {
      "poster": "a-z0-9_- (쉻릖游낍勇꽳릛걱멇릖쉻릖쐑   -_9-0z-a)",
      "content": "https://cdn.discordapp.com/attachments/870309786040811610/892513086362251285/video0-442.mp4",
      "votes": {
        "upvoters": [
          "Emma63194",
          "HeHe (Direktor 쬴vota)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Gussy (huba buba)",
          "HeHe (Direktor 쬴vota)",
          "KitKat (H(x))",
          "Log3 (Jaha캜 Kali Yuge)",
          "Ollie",
          "Ovo_je_moj_nick",
          "iMakeApps (12345678901234567890)",
          "lobro7 (chetnick)"
        ],
        "wtf": [
          "Filemon",
          "aperture"
        ],
        "tuga": []
      }
    },
    "242694": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "president cheddari su gotovo nejestivi",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242874": {
      "poster": "johndoe12 (enaiks)",
      "content": "danasnje jelo:\n\n-mladi 코pinat\n\n-gljive\n\n-rajcice\n\nto sve skuhano i ocijedeno i onda stavih skyr jogurt unutra i skuhah pa코tu s pirom\n\nokus 2/5, al je bilo brzo\n\n-naribane tikvice\n\n-naribane gljive\n\n-vegeta, bosiljak\n\nskuhati sastjoke i dodati skyr ili jos blje svjezi sir i jo코 pa코tu\n\nokus 4/5, brzo i efikasno\n\nAko netko ima nekih recepata brzih i zdravih koji se daju napravit unutar 15 min, do share, ako jos jednom pojedem pa코tu s nekim od ovih namirnica propucat cu se :)",
      "votes": {
        "upvoters": [
          "1vq",
          "Bobinator",
          "Filemon",
          "KitKat (H(x))",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242876": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "> @\"Kuhar\"#p239088 Definitivno najbolji kulen ima belje.\n\nmanja je uvrijeda da slovenci rade kulen nego to sto belje pakira pod tim imenom",
      "votes": {
        "upvoters": [
          "iLabaviUmeDaZabavi (prvi do boga)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "242948": {
      "poster": "[deleted]",
      "content": "Kare\n\nkilo karea\n\npomijesat senf, papriku, papar, sol, malo limunova soka, cesnjak, med i maslinovo ulje do konzistencije koju zelimo\n\nnamazat kare smjesom i pustit da chilla 12ak sati.\n\nRoknut u pecnicu na 150 s pola decilitra bijelog vina dok ne dode internalna temperatura do 55, zatim dic na 180 dok ne dode do 65.\n\nPustit da resta meso 15ak min. Deri brale. Mos ubacit napola skuhan krumpir prije nego sto dignes na 180 i granu ruzmarina.\n\n@\"BDSMi캖o\"#1 preporucas li neku drugu postavku pecnice myb jer je bilo socno al ne i presocno (doduse kare nema puno zelatine nit masti al bio je na akciji)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242951": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Dr.Tau\"#p242948 Svinjski kare nije pogodan za so캜nost\n\nJedino 코to mo쬰코 je izbaciti sol iz inicijalne macerade/marinade i zaustaviti pe캜enje na 65 bez ovih 55 (tj. direktno pe캖i do 65), iako to nikad ne bih radio sa svinjetinom koja je kupljena kod nas izvan reputabilne mesnice. A ako ima코 sous vide aparat onda kuha코 do 50-55 stupnjeva interno oko 4-8 sati i to 캖e ti dati najbolje rezultate.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242953": {
      "poster": "[deleted]",
      "content": "@\"BDSMi캖o\"#p242951 ma nez cito sam da se digne jos 2-3 stupnja kad resta a tak i termometar pokaze pa sam mislio da je to okej. Da kare je malo suh al je krt a trenutno cuttam pa jbg, imas neku preoporuku za komad sta ima kolagena dosta al ne tolko i masti?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242955": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Dr.Tau\"#p242953 Ne znam 코to ti to zna캜i ali ako 쬰li코 ne코to krto a da je so캜no tu ti u obzir dolaze june캖a le캠a i biftek, a od svinjetine tzv. lungi캖. Dodu코e masno캖a tog mesa ti ne bi trebala biti bitan faktor tijekom cutta dok god ne roka코 po nekim masnim rebrima - dakle i vrat je, npr. okej.\n\nAko ba코 mora biti krto i jeftino, onda but. Dodu코e ne znam jel bi ikom preporu캜io june캖i but, to eventualno za neke hamburgere bude kad u mljeveno umije코a코 i jaja.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242964": {
      "poster": "[deleted]",
      "content": "@\"BDSMi캖o\"#p242955 vratina zvuci ko pun pogodak jer mi je generalno najdraze meso s rostilja probat cu to drugi put",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242971": {
      "poster": "Filemon",
      "content": "@\"enaiks\"#p242874 brzih i relativno zdravih - all'amatriciana ili aglio i olio.\n\nuvijek mo코 i ne코 s gljivama ili piletina i neko povr캖e, za캜ini i mljac",
      "votes": {
        "upvoters": [
          "johndoe12 (enaiks)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242977": {
      "poster": "[deleted]",
      "content": "@\"Filemon\"#p242971 aglio e olio je izvrtsan al da je zdrav je malo optimisticno, msm u kontekstu cuttanja nije bas",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Filemon"
        ]
      }
    },
    "242980": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "Nema bas kolagena, al ak os neko meso koje nije jako masno a nije suho mos pogledat file zabatka.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242992": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "Jedan dobar i jednostavan snack\n\n6 komada velikog tosta.\n\njedno pakiranje posnog/polumasnog/vjv bilo kojeg svjezeg sire od 500g\n\n3 jaja\n\nkockice sunke ili doslovno cega god.\n\nu zdjeli pomjesat sir jaja i stogod drugo ocete, to rasporedit po komadima tosta\n\nonda u pecnicu u sredinu na 200 stupnjeva idealno na gornji grijac(kasnije upalit i donji za hrskavije dno a da ne izgori).\n\npec dok ne izgleda gotovo.\n\npo jednom tostu ima cirka 200 kcal 20g proteina 20g ugljikohidrata 6g masti.\n\nmoze se vise stavit po komadu tosta il manje vrlo prilagodljiv \"recept\"",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242994": {
      "poster": "KitKat (H(x))",
      "content": "@\"enaiks\"#p242874 kad si trebam napraviti ne코to unutar 15 min da je relativno zdravo, top shit su mi\n\n15-minutna hrana v1:\n\n1 velika raj캜ica\n\n1 luk\n\n1 mala konzerva slanutka\n\n뇻pr쬴코 luk i raj캜icu, na njih baci코 쬷icu 캠umbira, soli i curryja, ubaci코 slanutak i gotovo. Mo쬰코 jesti s kruhom ili ri쬺m, uz to si uzme코 salatu (osobno uz to volim mladi 코pinat ili matovilac) i najede코 se\n\n15-minutna hrana v2:\n\n뭯껸tvrt kupusa\n\n1 paprika\n\n1 tikvica\n\n1 patlid쬬n\n\n4-5 cherry raj캜ica\n\nUpr쬴코 to redoslijedom paprika뇷atlid쬬n뇺ikvica뇲upusraj캜ica za maksimalnu efikasnost, na kraju doda코 soli, paprike i kajenskog papra, i s kuhanjem si tutto completo. Uz to si obi캜no uzmem svje쬰g sira.\n\nAko ima코 dobru tavu, i jedno i drugo mo쬰코 raditi s 0 ulja. I obi캜no ostane i za podgrijati za ve캜ere.",
      "votes": {
        "upvoters": [
          "1vq",
          "Filemon",
          "LauraPalmer",
          "Ollie",
          "feel_d_boot (iNut)",
          "idontwannabemyself",
          "johndoe12 (enaiks)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "244703": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "캜e코njak (i ili ocat) uni코tava strukturu tijesta za pizze, ne stavljajte ih u tijesto\n\nFor reference koristio sam 10% 캜e코njaka u prahu i 5% octa (ovo je bilo slu캜ajno umjesto maslinovog)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "251826": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "K-Plus Pasta Italiana je najisplativija tjestenina, sub 10 kuna za pola kile, bron캜ani kalupi, od Paste Zare, poggers",
      "votes": {
        "upvoters": [
          "gladiator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "251828": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@\"BDSMi캖o\"#p251826 Pastazarra je uvijek 5.50kn u Alci tako da ne vidim kako je K-Plus isplativiji",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "251830": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"mAca Lukas\"#p251828 Iz bron캜anih kalupa, koje Zara ni ne prodaje koliko vidim, su ti skuplja varijanta. Barilla, koja je tu negdje, mo쬯a nijansicu bolja, ra캜una 18-19 kuna za takve, zato ka쬰m da su najisplativiji",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "251834": {
      "poster": "Ovo_je_moj_nick",
      "content": "Barilla je za pastu sto je Heineken za pivo ili Pellegrino za mineralnu",
      "votes": {
        "upvoters": [
          "KitKat (H(x))",
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "251839": {
      "poster": "Filemon",
      "content": "@\"mAca Lukas\"#p251828 bron캜ani kalupi su show, pa코ta ima hrapaviju teksturu od onih rezanih iz 캜eli캜nih, pa bolje obavlja svoju primarnu funkciju hvatanja umaka za sebe\n\nina캜e msm da su 코pageti iz lidla (nisam siguran za ostalo) i sve konzumovo od paste zare",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "251843": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Ovo_je_moj_nick\"#p251834 Istina, ali ova Academia serija im je jebena\n\nIna캜e sam Ragusa enjoyer, volim cavatappe vi코e od 쬴vota a trenutno ih jedino oni i Kplus proizvode koliko vidim",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "253959": {
      "poster": "InCogNiTo124",
      "content": "![](assets/2021-11-14/00026.jpg)",
      "votes": {
        "upvoters": [
          "KitKat (H(x))",
          "[deleted]",
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Ovo_je_moj_nick",
          "brbrbr"
        ],
        "wtf": [
          "AVRFreak"
        ],
        "tuga": []
      }
    },
    "254040": {
      "poster": "Filemon",
      "content": "@\"InCogNiTo124\"#p253959 fali jedini ispravan na캜in rezanja kapule, vertikalni + horizontalni koji daje najuniformnije komade, a puno je lak코e kontrolirati no od radijalnog niti zahtijeva kutomjer",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "254170": {
      "poster": "[deleted]",
      "content": "@\"Filemon\"#p254040 baziran u svemu 游돘勇",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "254177": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "just use a blender lul",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "Ovo_je_moj_nick"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "254219": {
      "poster": "Man (쉭숉aM쉭쉭)",
      "content": "Pametan reze vertikalno samo rubove malo zareze pod kutem",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "254239": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "najbolja solucija by Kre코imir Bengalka: \n\n_garin garicu, jeden **kapulu** ko jabuku \n\nke코 je u kuferu, le코 je u sanduku_",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255238": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Bon apetitty\n\n![](assets/2021-11-18/00018.jpg)\n\n![](assets/2021-11-18/00019.jpg)",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "spenadla"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Ollie",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA D콯IN)",
          "rija",
          "spejs"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "255246": {
      "poster": "rija",
      "content": "@\"mAca Lukas\"#p255238 drago mi je da si prilo쬴o i prvu sliku, jer bi ova druga izgledala dosta zabrinjavaju캖e bez nje",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bog (Charlie Brown)",
          "Filemon",
          "InCogNiTo124",
          "KitKat (H(x))",
          "jadzia-dax (Jadzia Dax)",
          "lobro7 (chetnick)",
          "mAcaLukas (mAca Lukas)",
          "steker"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "255285": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@\"rija\"#p255246 fotografije nisu kontekstualno povezane\n\nlp",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255286": {
      "poster": "Kuhar",
      "content": "@\"mAca Lukas\"#p255238 jooj vid stolnjaka",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124",
          "mAcaLukas (mAca Lukas)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255290": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@\"Kuhar\"#p255286 drago mi je da je netko primjetio, i코ao sam na drugi kraj grada u Jysk kod Arene da kupim taj dezen mu코eme",
      "votes": {
        "upvoters": [
          "Kuhar",
          "[deleted]",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "261917": {
      "poster": "johndoe12 (enaiks)",
      "content": "Keto rucak:\n\npola tikvice\n\n4 sampinjona\n\n1 paprika\n\nkozji sir\n\ncheddar\n\nvrhnje za kuhanje\n\n2 jaja\n\nmaslac\n\ncesnjak u prahu\n\nPriprema\n\nnaribati gljive, tikvicu i papriku i staviti da se kuha na maslacu dok ne pusti vodu. Izmutiti jaja s vrhnjem za kuhanje i preliti povrce, dodati cesnjaka u prahu ili drugih zacina. Na kraju staviti cheddar i kozji sir da se rastopi. Mozete ovome dodati i piletinu",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266119": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Uljep코ajte si 쬴vot i nemojte ovo ni kupovati\n\n![](assets/2021-12-21/00023.jpg)\n\nKao konjoser hanuta i sme캠i캖a mogu re캖i da osim 코to ovaj proizvod nema smisla, odvratan je i ima onaj isti sinteti캜ki miris (smrad?) sme캠i캖a kao i Milkini, koji pravi brownieji ni nemaju",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266123": {
      "poster": "[deleted]",
      "content": "@\"Mi캖o Maco\"#p266119 cak se i slazem, apsolutno sranje.\n\n![](assets/2021-12-21/00024.png)\n\novo je doduse izvrsno",
      "votes": {
        "upvoters": [
          "[deleted]",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266818": {
      "poster": "vidraKida (풌 풧 픬 픡)",
      "content": "@\"Mi캖o Maco\"#p266119 dodem doma za badnjake i stara napravi svoje jebene kolace. Tolko jebene da ovaj zatvor koji imam mjesecima od studenske prehrane samo nestane preko noci.\n\nDomaci puding s malo banana (3.5/5 jer ne volim previse banane):\n\n1 banana po zdjelici\n\nPola kile cokse ya kuhanje\n\nVanilin secer\n\nPrasak za pecivo \n\nMalo gustina (jebiga od oka zlica dvije)\n\nI puno dobre volje\n\nPola litre mlijeka sam zab\n\nKenjat ce te ko grlice 游땕 enjoz",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "iNavy (mornar Ica)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "270352": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "probajte ako ste u prilici, veoma dobro\n\n![](assets/2022-01-13/00020.jpg)",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "General_Kenobi (Aborteur)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "271564": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "karamelizirani luk u salati je poggers",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "271566": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "> @\"Mi캖o poslednji klovn\"#p271564 karamelizirani luk je poggers\n\nfixd i dodao bi na to jos i ukiseljeni luk",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "271576": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog u캜enja)",
      "content": "Imal' vegetarijanaca ovdje?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "General_Kenobi (Aborteur)",
          "lobro7 (chetnick)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "272325": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Obradovao sam se 코to sam na코ao chorizo koji nije iz Lidla\n\n![](assets/2022-01-21/00002.jpg)\n\nNa쬬lost, ovo je takvo govno od salame da sam posumnjao da sam dobio koronu i izgubio okus. Onda sam isprobao malo Ekos ma캠arice koja iako je bezokusna opet ima vi코e okusa i potvrdio da je ovo 2. najgora salama koju sam jeo u 쬴votu, odmah iza baranjske kobasice od Belja.\n\nPls don't buy, a ja 캖u i dalje tragati za dobrom chorizo...",
      "votes": {
        "upvoters": [
          "General_Kenobi (Aborteur)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272857": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "orgazmi캜no\n\n![](assets/2022-01-22/00016.jpg)",
      "votes": {
        "upvoters": [
          "bodilyfluids (Dragi prijatelj strojnog u캜enja)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272988": {
      "poster": "Ovo_je_moj_nick",
      "content": "prije\n\n![](assets/2022-01-23/00014.jpg)\n\nposlije\n\n![](assets/2022-01-23/00015.jpg)",
      "votes": {
        "upvoters": [
          "1vq",
          "AntonioB25 (Pleteni mi코)",
          "Filemon",
          "General_Kenobi (Aborteur)",
          "Jale (캜akijale)",
          "Joskica",
          "KitKat (H(x))",
          "Kuhar",
          "Omnitron ((-_-) )",
          "Smolaa",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "bodilyfluids (Dragi prijatelj strojnog u캜enja)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "jadzia-dax (Jadzia Dax)",
          "lobro7 (chetnick)",
          "login",
          "maPre",
          "menace_master",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "rija",
          "temsi (dipsy)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273058": {
      "poster": "[deleted]",
      "content": "@\"Ovo_je_moj_nick\"#p272988 svaka cast izgleda izvrsno",
      "votes": {
        "upvoters": [
          "Ovo_je_moj_nick"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273463": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "ajmo ovogodi코nje kobasice na sunce\n\n![](assets/2022-01-25/00016.jpg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Ovo_je_moj_nick",
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273478": {
      "poster": "Kuhar",
      "content": "@\"Mi캖o poslednji klovn\"#p273463 \n\nNisu kobasice al je doma캜a 코unkica..\n\n![](assets/2022-01-25/00017.jpg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "General_Kenobi (Aborteur)",
          "Ovo_je_moj_nick",
          "[deleted]",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273481": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Kuhar\"#p273478 Ma sve su코eno mo쬰",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273783": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "stigao i 코peki캖 hehe\n\n![](assets/2022-01-26/00007.jpg)\n\n![](assets/2022-01-26/00008.jpg)",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "Filemon",
          "General_Kenobi (Aborteur)",
          "Kuhar",
          "[deleted]",
          "jadzia-dax (Jadzia Dax)",
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273785": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@\"Kuhar\"#p273478 gde je belo",
      "votes": {
        "upvoters": [
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273786": {
      "poster": "Log3 (Jaha캜 Kali Yuge)",
      "content": "@\"NISAM ASISTENT\"#p273785 Zoks koks po코mrkao",
      "votes": {
        "upvoters": [
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273787": {
      "poster": "Kuhar",
      "content": "@\"NISAM ASISTENT\"#p273785 \n\nkakvo belo batice, nije to pr코ut",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273789": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@\"Kuhar\"#p273787 ma na koks sam mislio",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273883": {
      "poster": "HeHe (Direktor 쬴vota)",
      "content": "Samo vi jedite meso, pa zbog globalnog zagrejavanja ga ne캖ete mo캖 su코iti. Degenerici jedni",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "ElonDusk (游  )",
          "KitKat (H(x))",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "KitKat (H(x))",
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "273888": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "@\"Mi캖o poslednji klovn\"#p272857 di si ovo piknia?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273895": {
      "poster": "Ovo_je_moj_nick",
      "content": "@\"Spasitelj Hrvatskog naroda\"#p273883 bas zbog zagrejavanja ga mozemo jos vise i lakse susit",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273897": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "koje su najboje mesnice u zg?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273923": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"odvojeniFerid\"#p273888 Konzum i plodine imaju koliko sam vidio, iste cijene otp\n\nEDIT: Da klarificiram, SUPER Konzum i ve캖e Plodine. One u Zapru캠u imaju jako velik izbor maslinovih ulja i octeva",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273925": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"odvojeniFerid\"#p273897 Nezz jel najbolja ali Igomat je prili캜no dobra uz pristupa캜ne cijene",
      "votes": {
        "upvoters": [
          "jadzia-dax (Jadzia Dax)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273985": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@\"Mi캖o poslednji klovn\"#p273925 nisam nikad bila, ali iz vise neovisnih izvora sam cula istu tvrdnju",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274001": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Jadzia Dax\"#p273985 Evo ja 캖u jo코 re캖i da jedem rare, medium rare (najvi코e) i medium steakove od njihovog mesa i nisam jo코 obolio 游땑",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "jadzia-dax (Jadzia Dax)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "274007": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog u캜enja)",
      "content": "Ka쬰te da sam vegetarijanac, pa jesam, to je ta캜no.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274320": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "di nabavit najbolja jaja, imao sam priliku jesti pokvarena jednom s placa, nije bilo ba코 baza",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274324": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"odvojeniFerid\"#p274320 To mora코 na캖 reputabilnog dilera, i to je na쬬lost dosta dugotrajan posao, jer 캜ak i doma캖i za koje vidi코 da imaju koko코i ti znaju ubaciti jaja iz marketa - 캜uo sam pri캜e da najvi코e vole Kaufland zbog niske cijene i jer im je lagano maknuti 쬴g, ali nisam 캜uo kako to to캜no mi캜u 쬴g 游땐 \n\nOkej su i ona ne코to skuplja iz marketa - npr. 콯ito i Agrokoka nisu bila problemati캜na za mene, bar to jedem kad nemam jaja od dilera stare.\n\nProbaj se raspitati kod ljudi koji 쬴ve na ruralnijim mjestima, mo쬯a imaju neki kontakt, to ti ide tako verbalno.",
      "votes": {
        "upvoters": [
          "iMakeApps (12345678901234567890)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274330": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "@\"Mi캖o poslednji klovn\"#p274324 nisan zna to da mi캜u 쬴g, tnx, buden se raspita",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274336": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"odvojeniFerid\"#p274330 Jedan od dobrih indikatora doma캖ih jaja ti je raznolikost u veli캜ini. Dakle ljudi koji prodaju doma캖a jaja uglavnom ne va쬿 jaja da ih sortiraju - evo, ja to u 쬴votu bar nisam vidio, mo쬯a ovi moji seljaci su samo preprimitivni.\n\nUglavnom bit 캖e dosta raznolika u veli캜ini. Jednom sam imao kutiju koja je imala 2 jaja od 30g i 120g. Mislim da ni za jedno ni za drugo 캜ak nema코 klasifikaciju (jer je raspon od 35 do 70g)",
      "votes": {
        "upvoters": [
          "HeHe (Direktor 쬴vota)",
          "iMakeApps (12345678901234567890)",
          "member",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276086": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "ovo dobiju forumske zlo캖ice hehe\n\n![](assets/2022-02-01/00020.jpg)\n\nina캜e jako je fino, mo쬯a i moj favorit nakon prosciutto",
      "votes": {
        "upvoters": [
          "HeHe (Direktor 쬴vota)",
          "Omnitron ((-_-) )"
        ],
        "downvoters": [
          "atp0lar ( 游낍勇꽥뚾勇꽥 游낍勇꽳릛걱 游쉻릖쐑마t셣뽹0숇ar)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "BreadCat",
          "Filemon",
          "Ovo_je_moj_nick",
          "atp0lar ( 游낍勇꽥뚾勇꽥 游낍勇꽳릛걱 游쉻릖쐑마t셣뽹0숇ar)",
          "iMakeApps (12345678901234567890)",
          "nnn (dinoo)"
        ],
        "tuga": []
      }
    },
    "276683": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "di ima divljeg mesa kupit? koliko vidim vecina mesnica ne drzi to bas",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276684": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@\"odvojeniFerid\"#p276683 Metro C&C",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276805": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Budimo iskreni, jedina prava i originalna pizza\n>! Suck ![](assets/2022-02-03/00042.jpg)\n\n>! my ![](assets/2022-02-03/00043.jpg)\n\n>! Bosnian ![](assets/2022-02-03/00044.jpg)\n\n>! Cock ![](assets/2022-02-03/00045.jpg)",
      "votes": {
        "upvoters": [
          "Amon",
          "Bobinator",
          "Bog (Charlie Brown)",
          "BreadCat",
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "KitKat (H(x))",
          "Kuhar",
          "STAGGER_LEE",
          "feel_d_boot (iNut)",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA D콯IN)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Bog (Charlie Brown)",
          "BreadCat",
          "Filemon",
          "HeHe (Direktor 쬴vota)",
          "KitKat (H(x))",
          "Ollie",
          "feel_d_boot (iNut)",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA D콯IN)",
          "maPre"
        ],
        "wtf": [
          "Jakic007",
          "Log3 (Jaha캜 Kali Yuge)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "277322": {
      "poster": "Kuhar",
      "content": "![](assets/2022-02-05/00004.jpg)\n\nDan moze poceti",
      "votes": {
        "upvoters": [
          "Juren",
          "Red_Baron"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "278589": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "najzdravije jelo u menzi cosplay\n\n![](assets/2022-02-09/00026.jpg)",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon"
        ],
        "wtf": [
          "HeHe (Direktor 쬴vota)"
        ],
        "tuga": []
      }
    },
    "278590": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@\"Mi캖o je najja캜i Pokemon\"#p278589 realno, manje ulja ima u casandra bolonjezu nego u kasandra tjestenini bez iceg",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Kuhar",
          "Man (쉭숉aM쉭쉭)",
          "Mioch",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "steker"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "278616": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"mAca Lukas\"#p278590 Kupio sam specifi캜no june캖i but da simuliram tu suhu, zapaljivu teksturu\n\n-5% masno캖e jbt",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "278913": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Mi캖o je najja캜i Pokemon\"#p272857 ovaj je jo코 bolji, ali je zato skuplji od bolje cuge...\n\n![](assets/2022-02-10/00016.jpg)\n\nhigh end salatni ocat btj, a onaj jabu캜ni je bolji za meso, ri쬿, pe캜eno povr캖e...",
      "votes": {
        "upvoters": [
          "General_Kenobi (Aborteur)",
          "bodilyfluids (Dragi prijatelj strojnog u캜enja)",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "280257": {
      "poster": "steker",
      "content": "Najbolje jabuke za cheesecake?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Bog (Charlie Brown)",
          "Ovo_je_moj_nick"
        ],
        "tuga": []
      }
    },
    "280307": {
      "poster": "Ovo_je_moj_nick",
      "content": "@\"steker\"#p280257 ovo ti je ko da pitas, koje meso je najbolje za vegetarijanski quiche",
      "votes": {
        "upvoters": [
          "spejs"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Mrcina (Yoso)",
          "jadzia-dax (Jadzia Dax)"
        ],
        "wtf": [],
        "tuga": [
          "steker"
        ]
      }
    },
    "280309": {
      "poster": "[deleted]",
      "content": "@\"steker\"#p280257 paprika rog",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286590": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "https://www.youtube.com/watch?v=dRoAXbOQhDI\n\nok, kaze NKFRZ da u nekim mjestima rusije je nestasica secera\n\nmoje pitanje je WTF, koji vrag radite sa secerom u kuhinji? ja sam jednu kilu secera imala 8 godina, a ni to nisam potrosila vec je nastradala jer sam ju drzala neprimjereno u istoj posudi s brasnom\n\ndrugu kilu sam kupila nakon tog incidenta i stoji zatvorena godinu dana\n\nnow, kuzim da ti secer treba ako radis kolace, al nekak mi se cini da to trenutno nije visoko na listi prioriteta?",
      "votes": {
        "upvoters": [
          "johndoe12 (enaiks)",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286593": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Jadzia Dax\"#p286590 만캖er je bitan sastojak za svaki kruh i ve캖inu peciva, ide 4%.",
      "votes": {
        "upvoters": [
          "jadzia-dax (Jadzia Dax)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286594": {
      "poster": "[deleted]",
      "content": "@\"Jadzia Dax\"#p286590 nekad je potreban ako nemas vremena iskuhat 코ug od poma da presjece kiselinu malo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286596": {
      "poster": "HeHe (Direktor 쬴vota)",
      "content": "@\"mAca Lukas\"#p276805 based",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287360": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "I hecking love carbonara\n\n![](assets/2022-03-25/00006.jpg)",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "Omnitron ((-_-) )",
          "lobro7 (chetnick)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287365": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@\"Mi캖o konjoser 캛ehinja\"#p287360 koji biber koristis?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287371": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"NISAM ASISTENT\"#p287365 Obi캜no Kotanyi s mlincem, tj. reusam taj mlinac, al svejedno koristim Kotanyijev papar.",
      "votes": {
        "upvoters": [
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287374": {
      "poster": "Ovo_je_moj_nick",
      "content": "zakaj je spek sirov?",
      "votes": {
        "upvoters": [
          "Log3 (Jaha캜 Kali Yuge)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287376": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"Ovo_je_moj_nick\"#p287374 nije sirov jer je dimljen, ali 3 razloga\n\n- idem na put danas pa nisam htio prljati tavu\n- 코pek je bio dosta mastan (tipa 10% meso, 90% mast), a nisam ga ba코 imao previ코e\n- vi코e volim tako radi okusa",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287377": {
      "poster": "Ovo_je_moj_nick",
      "content": "@\"Mi캖o konjoser 캛ehinja\"#p287376 \n\nprobaj nesto slicno ovom drugi put\n\nhttps://www.youtube.com/watch?v=yAEVZcRaTzE\n\njedan od boljih recepata",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "289042": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "jedan redpill za gym brose\n\n![](assets/2022-04-04/00005.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "290154": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Malo dijetnog 游땓\n\n![](assets/2022-04-10/00010.jpg)",
      "votes": {
        "upvoters": [
          "BreadCat",
          "Omnitron ((-_-) )"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293687": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "![](assets/2022-04-29/00008.jpg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "bodilyfluids (Dragi prijatelj strojnog u캜enja)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "298285": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "[How to make breastmilk butter](https://hustlemomrepeat.com/how-to-make-breastmilk-butter/)",
      "votes": {
        "upvoters": [
          "Ollie"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Omnitron ((-_-) )",
          "Red_Baron"
        ],
        "tuga": []
      }
    }
  }
}