{
  "title": "[URS] O predmetu",
  "creator": "Jakic007",
  "slug": "urs-o-predmetu",
  "tags": [
    "FER",
    "Ugradbeni ra캜unalni sustavi"
  ],
  "posts": {
    "2333": {
      "poster": "Jakic007",
      "content": "Iz cega je najbolje ovo uciti? Preze? Ne cine mi se bas nesto iskreno.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2357": {
      "poster": "keykey",
      "content": "@Jakic007#2333 \n\nnavodno po skupljenim pitanjima iz starih ispita游뱡游낖",
      "votes": {
        "upvoters": [
          "Jakic007"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "185580": {
      "poster": "Ak08 (obama)",
      "content": "jel se zna sta za labose?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190753": {
      "poster": "jobi (azex)",
      "content": "@Ak08#185580  ima li novosti?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "192705": {
      "poster": "Ak08 (obama)",
      "content": "@jobi#190753 dosli su zadaci za do ponedjeljka",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "193609": {
      "poster": "MrSebo67",
      "content": "Koja je sad procedura, znaci ja sam rjesio zadatke. Jel ja sad kolegi dajem plocicu da on samostalno rjesi. Kako se odgovara u ponedjeljak. Ima dvoje ljudi jednu plocicu, a pise da cemo trebati demonstrirati rjesenje. Jel tko slao mail?",
      "votes": {
        "upvoters": [
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "193628": {
      "poster": "Upforpslone",
      "content": "@MrSebo67#193609 Ja mislim da se podrazumjeva da se rjesava u paru, pa valjda netrebas dat kolegi plocicu jer ste kao rjesili zajedno, al da glupo su to smislili koja je poanta da se radi od doma ako se radi u dvoje..",
      "votes": {
        "upvoters": [
          "MrSebo67"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "193637": {
      "poster": "Mikki",
      "content": "@MrSebo67#193609 U uputama na stranici 26 pise da se radi samostalno, a znaci li to svaki par samostalno ili svaki student samostalno je jedan veliki upitnik. Predlazem da sibnete mail, a ako vam ne odgvore do pon da sigurnosti radi svatko napravi sam za sebe, manje stete ako je u paru a vi imate svako svoje nego obrnuto.",
      "votes": {
        "upvoters": [
          "MrSebo67"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "193824": {
      "poster": "Ak08 (obama)",
      "content": "Poslala sam mejl, mo쬰mo raditi s kolegom s kojim smo u paru i mo쬰mo imati oboje isti kod, bitno je da svako zna o 캜emu se radi\n\nU ponedjeljak nam ne캖e trebati plo캜ica nego 캖emo samo morati pokazati kod i objasnit ga",
      "votes": {
        "upvoters": [
          "Elle",
          "Mikki",
          "MrSebo67",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "195608": {
      "poster": "Ak08 (obama)",
      "content": "Kako vam je ispitivanje proslo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "195631": {
      "poster": "BigZ1",
      "content": "@Ak08#195608 imam za 3 minute pa vam napisem",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Elle",
          "Mikki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "195644": {
      "poster": "BigZ1",
      "content": "Bilo je prvo pitanje samo kakao nam se cinio labos, bude vas 4 i pita vas svakog zasebno, otvorite kod svoj i onda tipa po kodu, Prvi zadatak su pitanja tipa -> kako ste nastimali pinove i sto ste napravili u kodu i tjt\n\nzasto portove ne moramo za input definirati (jer su vec definirani default kao input)\n\nDrugi zadatak -> sta radi usart_putchar funkcija i kako smo to spojili i zasto cekamo da usart sucelje bude spremno (jer ne zelimo da ne budemo u kontroli ukratko), kako interpretiramo rezultat u mV (1023 je max iznos i tako gledamo) dijelimo s time i kako zelimo da output bude u rasponu do 3.3V pomnozimo s time, zasto cekamo konverziju i zasto i STO upisujemo u clear flag (upisite 1 a ne 0 pa sam sutio na to pitanje)\n\nTreci zadatak pitanja -> Sto je to vremenski multipleks i zasto smo a tu koristili (spojeni su serijski a ne paraleleno itd.)  i koje smo portove koristili za display a koje za ispis select i tako",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Al_Pakino (Al Pakino)",
          "BigBoi",
          "Drmolirius",
          "Elle",
          "Kum",
          "Mikki",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "196385": {
      "poster": "Mikki",
      "content": "Jel uspio netko saznati u koje vrijeme mozemo doc po plocice?",
      "votes": {
        "upvoters": [
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "196549": {
      "poster": "Mikki",
      "content": "@Mikki#196385 update: do 3 se moze doc odg su mi na mail",
      "votes": {
        "upvoters": [
          "Elle",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218510": {
      "poster": "Avendo",
      "content": "Ima li tko kakvu skriptu ili tips n tricks kako u캜iti tj kako je on u캜io za kontinuiranu nastavu (idem na rok)",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Upforpslone",
          "rtnbot (Sharba10)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "219662": {
      "poster": "Avendo",
      "content": "@Avendo#218510 Pls",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "rtnbot (Sharba10)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "219695": {
      "poster": "Elle",
      "content": "@Avendo#219662 drugi tre캖i i 캜etvrti ciklus dosta vaznosti pridaju programskim zadacima, tako da je najbolje s razumijevanjem proc zadatke s predavanja\n\nza prvi ciklus u materijalima imas stare ispite gdje mozes vidjet kakva se teorijska pitanja javljaju\n\niz cetvrtog ciklusa se isto zadaci ponavljaju od prethodnih godina",
      "votes": {
        "upvoters": [
          "Avendo",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Kum"
        ]
      }
    },
    "219862": {
      "poster": "paradajz",
      "content": "Jel netko ima i da je voljan podijeliti materijale i prezentacije, 2. i 3. dio me najvi코e interesiraju? Maknuli su pristup preko fer weba pa ne mogu skinut vi코e.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220292": {
      "poster": "BigZ1",
      "content": "@paradajz#219862 EDIT: rje코eno. hehe",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220486": {
      "poster": "[deleted]",
      "content": "Ne znam kad vam je URS, ali ako netko ho캖e, javite mi se private pa vam po코aljem neku zbirku svih ispitinih pitanja koja sam uspio na캖i. Dosta pitanja je odgovoreno, iako nisu sva. Ima zadataka i teorije.",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Drmolirius",
          "Mikki",
          "Upforpslone",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "221597": {
      "poster": "Upforpslone",
      "content": "Moze neko ko je uspio dobit skriptu od supermavrina mi ju prosljedit, javio sam mu se al nije bio na forumu zadnjih dana",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222030": {
      "poster": "zloglasniKonjokradica (ooga booga)",
      "content": "@Upforpslone#221597 takoder",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223785": {
      "poster": "Avendo",
      "content": "Kakav je bio ljetni rok, dojmovi, koncept ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223840": {
      "poster": "Upforpslone",
      "content": "@Avendo#223785 1 i 4 cjelina su bili ponovljeni zadaci sa materijala, tako da prodi to na materijalima, 2. cjelina je bilo 10 bodova teorije i to nije bilo tesko, za to ti je najbolje proc prezentacije i 7 bodova programski zadatak (slanje preko usarta svake 1 ms tako nesto, bio je dosta zeznut zadatak meni), 3. cjelina je bilo 4 bodova teorije i 13 bodova programski zadaci (isto su bili dosta teski meni)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "224313": {
      "poster": "Jokke",
      "content": "캛uo sam da je ovaj predmet dosada bio dosta lo코 (i po organizaciji i po gradivu) pa me zanima dal se promijenio sad na FER3 kad je D쬬po preuzeo. Mo쬰 netko ko je ove godine odslu코ao dat neki kratki summary?",
      "votes": {
        "upvoters": [
          "nairobi (light_grandma)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "224355": {
      "poster": "Upforpslone",
      "content": "@Jokke#224313 Dio koji D쬬po predaje je odli캜an (8 bitni mikrokontroleri), i dio od prof Vu캜i캖a je dobar (32 bitni mikrokontroleri). Predavanja su kvalitetna, labosi 캜ak i zanimljivi. \n\nNa쬬lost ostale dvije cjeline predmeta su ostale iste kao i prije, lo코e.",
      "votes": {
        "upvoters": [
          "Jokke",
          "Mikki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "224478": {
      "poster": "Jokke",
      "content": "@Upforpslone#224355 Hvala. Po tebi dal dobro preva쬰 lo코e, tj dal mislis da je vrijedno istrpit lo코e gradivo zbog dobrog?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "225115": {
      "poster": "Upforpslone",
      "content": "@Jokke#224478 Ako te zanimaju mikrokontroleri i zelis naucit kako oni funkcioniraju i kako se programiraju onda se isplati, a za ove stare djelove imas na materijalima tipove zadataka koji se ponavljaju pa to nauci za ispit, netrebas niti pratit ta predavanja bas",
      "votes": {
        "upvoters": [
          "Jokke"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274096": {
      "poster": "Upforpslone",
      "content": "@\"macaklin\"#p273409 \n## Ugradbeni ra캜unalni sustavi\nNa FER3 su promijenili predmet, prije je imao 3 cjeline sad 4:\n\n1. cjelina je ostala ista kao i prije, taj dio mi nije ba코 bio ne코to, predavanja su dosadna, labos je ne코to u vhdlu 코ta nema veze s tim 코to 캜ovjek pri캜a na predavanjima, plus je 코to se pitanja na ispitima iz ovog dijela ponavljaju, a kako se taj dio nije mijenjao ima ih na materijalima.\n2. cjelina je skroz nova i ona mi se najvi코e svidjela, predavanja su dosta kvalitetna i na labosu se radi ono o 캜emu se pri캜alo na predavanjima(dobije코 plo캜icu i mora코 ne코to jednostavno isprogramirati u c-u, kao na arudinu recimo)\n3. cjelina ima isto kvalitetno predavanje, ali labos je puno zahtjevniji nego u 2. cjelini, mana ovih novih cjelina sto nema nikakva baza pitanja na ispitu(posto se prvi put predavalo) i zadaci iz ovog dijela na ispitu nisu jednostavni. \n4. cjelina je ista kao 3. od starog predmeta pa se opet pitanja ponavljaju, ali predavanja mi nisu bila ne코to i opet je labos ne코to u vhdl-u i bez veze je.\n\nPreporu캜io bi ti da upi코e코 URS jedino ako te to podru캜je ba코 zanima, tj konkretno 8 i 32 bitni mikrokontroleri jer to je tema 2. i 3. cjeline koje su stvarno kvalitetno obra캠ene i mo쬰코 dosta nau캜iti, ali 1. i 4. cjelina su dosta lo코e i meni su jedino slu쬴le za dizanje bodova na ispitu jer se pitanja ponavljaju, ali nemoj da te to zavara ispit svejedno nije lagan i ja sam na kraju imao jedva 2 haha\n\nTe쬴na: **8 / 10**\n\nKorisnost: **9 / 10** za 2. i 3. cjelinu, **2 / 10** za 1. i 4. cjelinu predmeta\n\nBih li preporu캜io/la predmet: **Da** ako te zanimaju 8 i 32 bitni mikrokontroler, ali pazi jer predmet nije najugodniji",
      "votes": {
        "upvoters": [
          "Kuhar",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274202": {
      "poster": "BigZ1",
      "content": "@\"Upforpslone\"#p274096 nadodao bih na ovo da sam mentoru (Mladen Vucic) rekao kako je njegovo gradivo opsirno i za 3 tjedna nastave malo previse i kako bi mozda cak i bolje bilo prvu cjelinu izbacit jer je retardirana i odma 8-bitni kad bi mogao biti i njegovo 6 tjedana da se nauci jedan dio pa drugi dio i zadnja cjelina da ostane (na njoj se da skupit bodova i meni je osobno skroz okej bila jer VHDL mi je super i bio sam prije na alatima no to nije bitno sad). Mislim da bi tada predmet bio super i svasta bi se pokrilo i napravilo. \n\nPredmet sam prosao sa 2 kontinuirano i nisam nest puno ga radio jer nest sam znao a nesto sam se provukao,no ucenje za ZI je bilo bas papreno tako da se kolegom iznad slazem.",
      "votes": {
        "upvoters": [
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277957": {
      "poster": "Spuk",
      "content": ".",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282070": {
      "poster": "Jeff",
      "content": "Da li se gradivo URS-a mo쬰 samostalno pro캖i ako nismo upisali predmet. Htio bih ga pro캖i, ali mislim da mi nije pametno se obavezati na jo코 dodatan predmet jer sumljam da 캖u uspijeti 3 predmeta uz zavr코ni.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282073": {
      "poster": "Jeff",
      "content": "@\"Jeff\"#p282070.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "298009": {
      "poster": "LanaRelej (Lana Relej)",
      "content": "@\"Jeff\"#p282070 Malo je kasan odgovor, al i ja sam se na코la u sli캜noj situaciji. Ono 코to sam vidjela od materijala i 캜ula od kolega nije bilo ba코 ne코to, tako da nisi puno propustio. Vjerojatno vi코e mo쬰코 nau캜iti samostalno iz neke knjige poput [Programming Embedded Systems in C and C++](https://www.oreilly.com/library/view/programming-embedded-systems/1565923545/). Ova konkretno je namijenjena kao uvod i pretpostavlja da si upoznat s C-om, digitalnom logikom i nekim osnovama arhitekture ra캜unala, 코to sigurno jesi.\n\nZa VHDL ti toplo preporu캜am [Alate za razvoj digitalnih sustava](https://www.fer.unizg.hr/predmet/azrds_a) kojem je nositelj prof. Vu캜i캖. Ak nemre코 upisati na캠i materijale od predavanja (3 skripte) i labose (1 skripta), a ima코 i zada캜i캖a s ispita. Ne znam kako bi isprobao kod, po코to ti oni tamo na labosima daju svoje plo캜ice od Xilinxa, ali mo쬯a mo쬰코 prilagoditi zadatke za na코e ULX3S plo캜ice s DIGLOG-a, ako ju jo코 ima코.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}