{
  "title": "Oblikovanje i usustavljivanje rasprava",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "oblikovanje-i-usustavljivanje-rasprava",
  "tags": [
    "Službeno"
  ],
  "posts": {
    "2721": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Evo, čisto mali kratki priručnik kako bih ja i ostatak vodstva (za sad @moose) voljeli da izgledaju neke stvari xD\n\n# Oznake\n\nDakle, kao i na materijalima, postoji nekoliko podkategorija sadržaja:\n\n- Alati (novitet - objave, rasprave i otklanjanje pogrešaka s alatima)\n- Ispiti (MI, ZI, KPZ, rokovi, blicevi i sl.)\n- Izlaganja (Predavanja, auditorne, masovne instrukcije, seminari i sl.)\n- Laboratorijske vježbe\n- Organizacija (novitet - traženje grupa, okupljanja, izleti i sl.)\n- Vježba (ZZV tj. zadaci za vježbu, zadaci iz zbirke, pitanja oko postupaka i sl.)\n- Zadaće (domaće zadaće, školske zadaće i sl.)\n\nBilo bi jako lijepo kad bi mogli sami označavati sadržaj po ovome. Pronaći ove kategorije možete tako da krenete upisivati njihov naziv, pa će vam se popis filtrirati.\n\nTrenutno pretraga rasprava radi jako loše, ne pretražuje po naslovima (tj. ne zna se, na nekim inačicama ipak odluče da je to dobro pa uključe funkcionalnost, pa isključe, uglavnom pretpostavite kao da ne radi), a vrlo uskoro će se dati pretraživati sadržaj po više od jedne oznake, pa će se tako lakše pronalaziti sadržaj, uz naravno predmetne oznake. Označiti ovo meni i @moose nije nešto previše teško, ali opet, nije automatizirano (za sad hehe).\n\nUkoliko ne budu štimale oznake, mi ćemo nakon nekog vremena (kad vidimo grešku) istu i otkloniti dodavanjem prazne oznake.\n\nStvari tipa O predmetu ili Pitanja i odgovori ne zahtjevaju oznake jer se tiču svega pomalo. Ako vam nešto nije logično smjestiti u ove kategorije, ni ne trebate, šanse su da to ne pripada jednoj kategoriji.\n\n# Nazivi rasprava\n\nBilo bi lijepo kad bi format naziva rasprava bio:\n\n```\n(redni broj, ako ga ima) (vrsta sadržaja, npr. \"Laboratorijska vježba\") - (akademska godina)\n```\n\ngdje zagrade označavaju grupe i nisu dio naslova.\n\nSve što ima 3 ili više riječi se treba skratiti (npr. Zadaci za vježbu -> ZZV) jer je tlaka sve to pisati, a svima je jasno što je ZZV. Isto npr. vrijedi za KPZ. Sve s 2 riječi i manje bi bilo lijepo napisati punim nazivom, s prvim velikim slovom, a ostalo malim početnim slovom, ako pravila pravopisa ne kažu drukčije.\n\nDa, jasno mi je da se može napisati 1. Labos, no tu postoji nejednoznačnost s npr. Labosima profila (što su predmeti, ne vježbe). Isto tako, znam da je svima jasno što je DZ, i ako vam je stvarno teško napisati to puno, napišite DZ, mi ćemo to prepraviti, nije problem, ali razlog zašto je to tako je jer vjerujem da kratice manje od 3 slova mogu postati nejednoznačne (a ne želim kao FER skraćivati npr. \"domaće zadaće\" u \"DOMZAD\").\n\nFinalno, što se tiče godine, neće biti rasprava za svaku godinu ako taj sadržaj ostane isti. Npr., recimo da sljedeće godine 1. laboratorijska vježba iz ARH1 bude ista. Onda će postojati isključivo rasprava \"1. laboratorijska vježba - 2020/2021\" u kojoj će jednom objavom biti naznačeno otkud počinu odgovori za akademsku godinu 2020/2021, a prije toga bit će pripojena rasprava iz 2019/2020. Glupo je za istu stvar imati [imath]n[/imath] rasprava koje govore o istim problemima i zadacima. Mi ćemo se pobrinuti oko preimenovanja i tog odjeljivanja godina, ne brinite.\n\n# Sažetak\n\nOznačujte kategorijama:\n\n- Alati\n- Ispiti\n- Izlaganja\n- Laboratorijske vježbe\n- Organizacija\n- Vježba\n- Zadaće\n\nForma naslova (zagrade označavaju grupe, nisu dio naslova):\n```\n(redni broj, ako ga ima) (sadržaj, npr. \"Laboratorijska vježba\") - (akademska godina)\n```\n\nNema sankcija za nepoštivanje, ali puno nam pomažete održavati koliko toliko preglednost :)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Njet",
          "RS7",
          "Svarog (Veles)",
          "ViBorg",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "hrljavi_caval (rljaviČaval)",
          "in1",
          "member",
          "mentally_disturbed_llama",
          "moose (sugar BoOo!!)",
          "tinvickovic (augusteen)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2773": {
      "poster": "njofra",
      "content": "Jeste li razmisljali da u naslovu kao prefiks stavite kraticu premeta (npr. \"[ARH1] 1. Laboratorijska vježba\")? Ili bar tag prikazati na neki nacin da bude uz naslov teme? \n\nTrenutno je jako nepregledno sto pripada kojem predmetu ako gledas sve rasprave na FERu, sto mozda nije toliko bitno ako trazis nesto specificno, ali problem je ako zelis npr. pogledati threadove predmeta koje si prosao ako mozda mozes dodati/odgovoriti nesto korisno.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "Galke",
          "Gulbash",
          "Hrvoje (Hrvoje45)",
          "SuperSjajan3",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "in1",
          "indythedog",
          "mrleongalaxyum (Neovlašteni serviser)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2774": {
      "poster": "Amali (Amajli)",
      "content": "@njofra#2773 Ili da tagovi bar budu ispod naslova ko na mobitelu, tako bi i bilo vise mjesta da se vide svi tagovi ako ih ima vise\n\nIako ak ce se moc filtrirat po vise tagova to ce prestat bit problem tad, perhaps?",
      "votes": {
        "upvoters": [
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "mrleongalaxyum (Neovlašteni serviser)",
          "njofra"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2775": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@njofra#2773 Da, razmišljam o tome ali ne znam koju konvenciju uzeti. Jer ono, FERova konvencija je prva tri slova predmeta za 2 i manje riječi, kratice za sve više, al tipa [ARHRAC] izgleda kao rak. S druge strane, ne želim stavljati teret na ljude da toliko detaljno to rade.\n\nVrlo je moguće da ću umjesto toga napraviti ekstenziju koja prefiksira naziv samo prividno, pošto je taj naslovni prefiks vrlo lagano zaključiti iz oznake. Isto sam inicijalno mislio napraviti i za sekundarne oznake ali onda bi ih trebao previše da to bude samo lookup.\n\nUglavnom, ako se nešto može riješiti lookupom, onda će se tako i riješiti. Zato mislim da je za sad bezveze siliti ljude da pišu te kratice kad ne postoji ni dogovor oko njih.\n\nEDIT: @moose mi je predložio genijalnu stvar:\n\n![](assets/2020-03-24/00033.jpeg)\n\nOvo nešto **ne bi** trebalo biti preteško postići proširenjem, ali nisam 100% siguran kako (znam otprilike). Međutim, mislim da je realno očekivati da ovo bude implementirano do kraja tjedna.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "Galke",
          "Mioch",
          "Svarog (Veles)",
          "in1",
          "indythedog",
          "moose (sugar BoOo!!)",
          "mrleongalaxyum (Neovlašteni serviser)",
          "njofra"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2791": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Nešto slično je obavljeno, zapravo ono što je @Amali  predložila, jer za to ne treba ekstenzija. Slobodno javite ako ima nekih problema s time. Ako ne bude preteško pokušat ću ipak napraviti ovo 1. kasnije, to mi se čini preglednije.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "ink",
          "mrleongalaxyum (Neovlašteni serviser)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2885": {
      "poster": "Grumio",
      "content": "Vidio sam da ima repozitorij fizika 2 koja je po FER2 programu. Za FER3 program su izmijenili gradivo i imam knjigu koja pokriva to gradivo i koristi se na predavanjima. Postoji li mjesto gdje mogu uploadat taj pdf?",
      "votes": {
        "upvoters": [
          "GTX9800",
          "mrleongalaxyum (Neovlašteni serviser)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "2924": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Grumio#2885 Ako je legalno dijeliti knjigu, do kraja tjedna će biti dignut repozitorij (vjerojatno one drive?) gdje se lagano može predati bilo koji legalni materijal i koji se sinkronizira s pravim materijalima.\n\nAko nije legalno dijeliti knjigu onda možeš na vlastitu odgovornost, preko nekog VPNa ili čega već, staviti je na libgen ili scihub (ovisno o tipu literature) i podijeliti link, ali onda bi trebao biti svjestan što radiš.",
      "votes": {
        "upvoters": [
          "Filemon",
          "GTX9800",
          "Grumio",
          "Jakic007",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "39075": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "# Novitet\n*datuma 12.06.2020.*\n\nDodane kratice kao prefiks rasprava u predmetnom dijelu. Konačan format nije kompletan, ali je URL za tu oznaku dobar indikator kako bi trebala ići kratica. Trenutno nije nužno prilikom stvaranja teme staviti kraticu, to ću ja napraviti ako neka ne bude u redu.\n\nTrenutna pravila su:\n\n- skraćenice imaju uglavnom velika slova (postoje sitne iznimke) i opasane su uglatim zagradama, npr. `[AVSP]`, te su normalizirane u standardnih 26 latinskih slova\n- skraćenice od 1 ili 2 riječi stvaraju se uzimanjem 3 slova svake riječi, npr. **Fiz**ika [imath]\\rightarrow[/imath] `[FIZ]`, **Ope**racijski **sus**tavi [imath]\\rightarrow[/imath] `[OPESUS]`\n- skraćenice jedne riječi koja je kompozicija riječi (npr. elektroenergetika je spoj elektro i energetika) gleda riječi kao zasebne, a na kraj dodaje posljednje slovo, npr. **Ele**ktro**ene**rgetik**a** [imath]\\rightarrow[/imath] `[ELEENEA]`\n- skraćenice tuđica kao što je npr Izrada web-projekt se gledaju kao nazivi od 3 riječi (pa skraćenica nije `[IZRWEB]` nego `[IWP]`)\n- skraćenice predmeta od 3+ riječi stvaraju se spajanjem prvih slova svake riječi (čak i u slučaju veznika), npr. **V**jerojatnost **i** **s**tatistika [imath]\\rightarrow[/imath] `[VIS]`\n- numerirani predmeti skraćuju se tako da se broj nadodaje na skraćenicu koja bi nastala da predmet nije numeriran, npr. Fizika 2 [imath]\\rightarrow[/imath] `FIZ2`\n- predmeti s posebnim obilježjem skraćuju se tako da se to obilježje nadoda nakon crtice skraćenici predmeta izuzimajući to obilježje, npr. Arhitektura računala 1 E [imath]\\rightarrow[/imath] `ARHRAC1-E`\n- predmeti koji u nazivu imaju skraćenice ne kompresiraju skraćenicu, npr. Osnove izrade PHP aplikacije [imath]\\rightarrow[/imath] `[OIPHPA]`\n- predmeti s 4 slova se ne skraćuju, npr. Perl [imath]\\rightarrow[/imath] `[PERL]`\n- kolizije predmeta razrješavaju se tako da se krene od posljednjeg komadića i on se proširi sljedećim slovom, ali ovog puta [u]sitnim slovima[/u] \\*\n- ukoliko prilikom razrješavanja kolizije kolizija nije rješena, kreće se na sljedeći komadić (gledano odozada) i pokušava se proširiti njega\n- ukoliko se razrješavanjem kolizije dođe do prvog komadića, ponovno se kreće proširivanje odozada\n- kolizija s prioritetom (ona koja će ostati ista, koja se neće razrješavati) je za onaj predmet koji je postojao ranije - ako se radi o predmetima uvedenima iste godine, prioritet na skraćivanje ima predmet koji je u uzlaznom abecednom poretku ranije\n\n## Dodatak - razrješavanje kolizije\n\n>! .\n\n> \\* -  u ovom kontekstu komadić je dio skraćene cjeline, tj. u ARHRAC1-E komadići su `ARH` i `RAC` (`1` nije skraćeno, `E` je dodatak), dok bi kod VIS-a komadići bili `V`, `I` i `S`)\n\n> Da bih dočarao razrješavanje kolizije, recimo da imamo 6 naziva predmeta, poredanih po redoslijedu uvođenja:\n\n> - Vjerojatnosti i statistika\n> - Vjerojatnost i statika\n> - Vjerojatnost i Superman\n> - Vjerojatnost i stepenice\n> - Vjerojatnost i Studoši\n> - Vjerojatnost i Sarajevo\n\n> Onda se oni skraćuju redom:\n\n> - `[VIS]`\n> - `[VISt]`\n> - `[VISu]`\n> - `[VjISt]`\n> - `[VjIStu]`\n> - `[VISa]`\n\n> Naravno ovakve kolizije nisu vjerojatne, bitno je samo da imamo alate s kojima ih možemo razrješavati. Druge stavke skraćivanja bi se trebale potruditi da to ovog ne dođe.\n\nZbog kompleksnosti ovog sustava se ne očekuje od vas da ih prevodite, to će ionako u budućnosti biti automatizirano.\n\nEDIT: Klarificiran sustav za 1 riječ i još neki rubni slučajevi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "39078": {
      "poster": "Hrvoje (Hrvoje45)",
      "content": "> @micho#39075    [OPESUS]\n> \nbruh",
      "votes": {
        "upvoters": [
          "Filemon",
          "Galke",
          "InCogNiTo124",
          "njofra"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "KingGeedorah (King Geedorah)",
          "Mioch",
          "__builtin_popcount (std::popcount)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "39087": {
      "poster": "InCogNiTo124",
      "content": "@Hrvoje#39078 imam snazne negativne osjecaje ka opesus, postoji li mogucnost iznimaka",
      "votes": {
        "upvoters": [
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "njofra"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "39090": {
      "poster": "Hrvoje (Hrvoje45)",
      "content": "@InCogNiTo124#39087 \n\nja bi rekao da za neke predmete trebaju bit kolokvijalne kratice; os, upro itd.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Galke"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "39096": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@InCogNiTo124#39087 Ne želim komplicirati više sustav, iznimke trenutno postoje samo za Elektroenergetiku jer moram još smisliti kako će se hendlati to, a i FER ide prema ovom sustavu (npr. trenutačno je link na stranicu OS-a s kraticom `opsus`. Razumijem da je na prvu neprirodno jer cijeli život to zoveš OS, ali nemoj kriviti mene, krivi ljude koji su osmislili neskalabilan hashing algoritam nazivlja predmeta.\n\nEDIT: Vidim da sam zaboravio spomenuti i Elektroniku kao iznimku, moram to dodati.\n\nEDIT2: Dodana standardizacija, sad sve poveznice na neku oznaku predmeta imaju odgovarajuću lower-case skraćenicu",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190069": {
      "poster": "InCogNiTo124",
      "content": "Ja sam tek sad skuzio da se predmetne rasprave \"pitanja i odgovori\" te \"o predmetu\" ne otvaraju za svaku ak godinu nego samo jedna za predmet\n\nJel to zeljeno ili? Msm da tak nisu radili na fer2netu (rip)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190072": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@InCogNiTo124#190069 Da, ali uskoro će biti zamijenjeno drugačijim sustavom, samo želim par stvari prije toga još napraviti",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "292989": {
      "poster": "anon00",
      "content": "Zasto se postovi vezani za gradivo meduispita odvajaju u temu gradivo? \n\nKuzim da nije nuzno krivo, ali mi se cini preglednije imati 5 tema \"Meduispit 202X/202Y\" za svaku godinu i da je u njima sve vezano za taj meduispit (pa tako i zadaci) nego imati 5 godina pitanja, zadataka i odgovora natrpanih u jednu temu \"Gradivo\". \n\nZamisli situaciju da dodes na ovaj forum za 3 godine i pripremas se za MI. \n\nUdes u temu \"Gradivo\" i nades na 5356 postova koji su vezani za: MI-ZI-Rok-Rok-Rok-Mi-Zi-Rok-Rok-Rok... \n\nTu je jos i problem to sto se predmeti s godinama znaju mrvicu izmjeniti pa se ubacite/izbacite neke stvari koje se obrađuju, a pogotovo  ce to biti slucaj sad na fer3.  \n\nMeni osobno bi bilo puno preglednije imati N tema \"Meduispit\" i kad se pripremas za njega samo procitas postove iz proslogodisnje teme ili bilo koje druge prijasnje godine",
      "votes": {
        "upvoters": [
          "AntonioB25 (Pleteni miš)",
          "BrkMateaBeusana (Umarell)",
          "Ferkonja (Ferkonja         ‮ajnokreF )",
          "Log3 (Jahač Kali Yuge)",
          "Mioch",
          "Stark",
          "Sulejman",
          "Viks",
          "[deleted]",
          "gladiator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "292995": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"anon00\"#p292989 Zato što su te teme vezane uz konkretne međuispite, a gradivo je gradivo i kao takvo ga je teško svrstati po godinama. Poanta bi bila te stvari u smislu rješenja i pitanja ionako šikati na materijale, a ne na forum.\n\nPitanja sa konkretnog međuispita ostaju u temi, ili su u Gradivu ako su tamo inicijalno postana kao što i nalaže priručnik.",
      "votes": {
        "upvoters": [
          "Juren"
        ],
        "downvoters": [
          "BrkMateaBeusana (Umarell)",
          "Ferkonja (Ferkonja         ‮ajnokreF )",
          "Grdobina2000 (Grdobina)",
          "Sulejman",
          "Zk6dO73 (burw0r)",
          "in1",
          "mAcaLukas (mAca Lukas)",
          "nnn (dinoo)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293082": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "@\"anon00\"#p292989 Glupo je sve trpat u različite rasprave, pogotovo na predmetima gdje ima manje od 100 studenata pa imat 100 različitih rasprava",
      "votes": {
        "upvoters": [
          "nnn (dinoo)"
        ],
        "downvoters": [
          "Sulejman"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}