{
  "title": "Zadnje proÄitana knjiga",
  "creator": "jadzia-dax (Jadzia Dax)",
  "slug": "zadnje-procitana-knjiga",
  "tags": [
    "OpuÅ¡teno"
  ],
  "posts": {
    "3278": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - The Stand](https://www.goodreads.com/book/show/11232016-the-stand)\n\nprigodan materijal u ovo doba, nasrecu me korona potjerala u izolaciju inace bi mi trebalo do ljeta\n\npoprilicno sam sigurna da mozete uzet i verziju koja nije uncut edition ðŸ¤£\n\n4/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Rendom",
          "Svarog (Veles)",
          "amnael",
          "indythedog",
          "neytiri",
          "spenadla"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "STAGGER_LEE",
          "Svarog (Veles)",
          "mAcaLukas (mAca Lukas)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "3279": {
      "poster": "STAGGER_LEE",
      "content": "[Miroslav KrleÅ¾a - Na rubu pameti](https://www.goodreads.com/book/show/13162630-na-rubu-pameti)\n\n(ja sam) problematiÄna liÄnost, moralnobolesna pojava",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Svarog (Veles)",
          "[deleted]",
          "amnael",
          "xpn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4374": {
      "poster": "Amali (Amajli)",
      "content": "## [Phillip Pullman - His Dark Materials](https://en.m.wikipedia.org/wiki/His_Dark_Materials)\n\nFantasy + kritika religije + nesto fizike\n\nRadnja samo ide, ne cini mi se da je bilo dijelova gdje se nista ne dogadja ili previse opisa koji ubijaju radnji, iako osobno su me malo overwhelmali nacini opisa tu i tamo (ali to je personal preference). Srecom ne ide u bas previse detalja, bar koliko se sjecam (postoji sansa da sam te dijelove mentalno srezala na osnovno pa nez).\n\nNeki odnosi su mi bili cudni, al glavni lik ima oko 12 godina. Nekoliko zadnjih poglavlja trece knjige mi je bilo kind of odd and underwhelming.\n\n### Ocjene\n#### The Northern Lights/Golden Compass: \n**3.5 / 5**\n>! Nije preprosjecno jer ima neke fora ideje, al prilicno se samo za sebe cini ko neki obicni fantasy.\n>\n#### **The Subtle Knife:**\n**4 / 5**\n>! Tu dolazi dosta vise novih stvari u igru i postane puno zanimljivije.\n\n#### **The Amber Spyglass:**\n**4 / 5**\n>! Opet uvodi neke jako zanimljive stvari i nove dinamike i skoro pa je 5 / 5\n\nAli kraj mi je bio sve vise i vise cudan, i na kraju me nije ostavio sretnom ili tuznom ili bilokakvom osim onak \"Eh? Okay\".\n\n#### **Overall:**\n**4 / 5**",
      "votes": {
        "upvoters": [
          "Amon",
          "EstebanVihaio",
          "Filemon",
          "Svarog (Veles)",
          "amnael",
          "jadzia-dax (Jadzia Dax)",
          "setuid0"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4552": {
      "poster": "Alcatraz",
      "content": "[Dalton Trumbo - Johnny Got His Gun](https://www.goodreads.com/book/show/51606.Johnny_Got_His_Gun)\n\nOdavno nekoj knjizi nisam dao 5/5 na goodreadsu no ova je to definitivno zasluzila. Progutao sam ju u par sati ovaj vikend jer nisam mogao prestati citati.\n\nJako mucna i teska anti ratna knjiga koja prica o sudbini americkog vojnika nakon prvog svjetskog rata. Ja nisam znao nista vise o njoj prije citanja, a isto bi preporucio i vama. Efekt je puno jaci kada ne znate sto vas ceka jer se mozete puno bolje poistovjetiti sa glavnim likom. Ja sam par puta morao prestati citati i uzeti pauzu jer mi je bilo too much.\n\nNakon napada na Pearl Harbor jedno je vrijeme bila i zabranjena zbog tematike kojom se bavi, a autor blacklistan iz hollywooda. Po njoj je snimljen film i jedna pjesma od Metallice (koju ovdje necu imenovati jer spoila dosta radnje :D )\n\nVjerojatno nije najbolje stivo za ovo vrijeme izolacije tako da citate na vlastitu odgovornost.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "M-16",
          "Rendom",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "amnael",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4579": {
      "poster": "Amali (Amajli)",
      "content": "Okay vidim da svi koriste goodreads linkove pa budem i ja sad\n\n## [Andy Weir - The Martian](https://www.goodreads.com/book/show/18007564-the-martian)\n\nHumour + survival + innovation + techy + sciencey\n\nNeki se zale da je previse lighthearted (nije dovoljno trilerasto i rezi-zile) za situacije s kojima se Watney susrece - uistinu nije ako razmisljas o takvim stvarima i nije vjerojatno da itko to prodje bez breakdowna, pa ako zelite hrpu losih emocija i breakdowna oko situacija, nemojte ovo citati. Uostalom bazirano je na logovima, a nije given da ce netko ic pisat o svom mentalnom zdravlju u losim trenutcima ili se kasnije htjet prisjecat u bilokojoj situaciji.\n\nMeni je knjiga bila ultra zabavna za citanje jer je uzasno dinamicna i puna humora koji je stila koji se meni svidja (mostly sarcasm), i bila mi je kompletno uzasno emocionalno engaging unatoc hrpi humora i unatoc svemu kaj neki pljuju u komentarima.\n\nMinor spoiler al sam kao general idea koja je... ocita.\n>! Meni je knjiga bila super unatoc \"ponavljanju\" (nes se cesto sjebe pa ide popravljat etc etc apsolutno ocekivano) koje neki spominju kao downside. Like, what did they expect? Everything going smoothly and nothing new ever breaking or presenting a new challenge to solve? Knjiga ne bi bila ni upola toliko duga tako, nit imalo realna.\n\n### Ocjena\n**5 / 5**",
      "votes": {
        "upvoters": [
          "Alcatraz",
          "Amon",
          "M-16",
          "Svarog (Veles)",
          "[deleted]",
          "indythedog",
          "mentally_disturbed_llama",
          "meta",
          "njofra",
          "tekamolo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4638": {
      "poster": "Vasili (Fasili)",
      "content": "[Richard Matheson - I Am Legend](https://www.goodreads.com/book/show/40940649-i-am-legend)\n\nInaÄe ne Äitam o apokalipsi, zombijima i sl. , ali dao sam ovoj knjizi priliku jer sam gledao film sa Will Smithom koji je kao nastao po njoj, ali knjiga i film skoro uopÄ‡e nemaju veze jedno s drugim. \n\nUkratko kompletna knjiga mi je fenomenalna i kraj je bio jednostavno WOW (vrijedi se Äitati samo radi kraja). Knjiga se vrti oko solo survivora apokalipse koji pokuÅ¡ava razumijeti vampire (knjiga je iz 1954, njegovi vampiri su totalno drugaÄiji od svega Å¡to imamo danas i imaju puno veÄ‡u dubinu) i Å¡to je dovelo do njh kroz jako znanstveni pristup vodeÄ‡i eksperimente i sliÄno. TakoÄ‘er dosta se govori i o psiholoÅ¡kom stanju lika koji lagano puca jer nema s kim priÄat.\n\nDosta ljudi se Å¾ali na knjigu zbog loÅ¡eg pisanja i jer nema akcije (ubijanja), ali meni stil pisanja ne smeta i sviÄ‘a mi se viÅ¡e znanstveni pristup cijeloj situaciji.\n\n### Ocjena 5/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "EstebanVihaio",
          "M-16",
          "Svarog (Veles)",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4785": {
      "poster": "snoot_booper (snoot_boopator)",
      "content": "@Alcatraz#4552 Pogledao film nakon sto sam skuzio da metallica u pjesmi One prica o toj prici. Pao u tesku egzistencijalnu krizu nakon gledanja filma, ne znam dal sam spreman za knjigu hahah",
      "votes": {
        "upvoters": [
          "Alcatraz",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4789": {
      "poster": "snoot_booper (snoot_boopator)",
      "content": "### Marina AbramoviÄ‡ - Prolazim kroz zidove\n(Auto)biografija srpske performans umjetnice Marine AbramoviÄ‡, o njenom odrastanju u Jugoslaviji, o njenom Å¾ivotu i karijeri... All around jako neobiÄna knjiga, vrlo je zanimljivo Äitati o Å¾ivotnim shvaÄ‡anjima, emocijama i opÄ‡enito mislima jednog toliko netipiÄnog pojedinca. PreporuÄam da pogledate neke njene performanse, to def nije za svakog i treba imat Å¾eludac za to, ali meni je ful zanimljivo",
      "votes": {
        "upvoters": [
          "jocelyn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4907": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "### H.P. Lovecraft - The Call of the Cthulhu\nJedna od najpoznatijih novela autora Äiji je naslovni lik stekao kultni status i vjerovatno prva u nizu postova jer sam zagrizao u kolekciju ðŸ˜ \n\nPriÄa opisuje mladiÄ‡a viÅ¡e srednje klase koji prolazi kroz spise pokojnog praujaka arheologa/lingvista drevnih jezika. Ujo je umro pod sumnjivim uvjetima dok je istraÅ¾ivao krvoloÄni kult Å¡tovatelja Drevnih, Äiji je glavni sveÄ‡enik Cthulhu. PriÄa se dalje nastavlja pozivom rekurzije jer on objaÅ¡njava kako je naÅ¡ao spis u kojem praujak piÅ¡e o simpoziju 20 godina ranije na kojem ga je mladi policajac pitao da odgonetne natpis na maloj statui Cthulhua Äiji pronalazak naravno on u detalje opisuje, pa ga prepozna i kolega koji krene priÄati o svom susretu iz mlaÄ‘ih dana.. You get the point, voli priÄu kopat u dubinu.\n\nKroz cijelu priÄu i opis je jeziva atmosfera i neki osjeÄaj _krivog_ ne zato Å¡to su negativci krvoloÄni, ili Cthulhu velik i moÄ‡an, nego jer se protagonist osjeÄ‡a i je bezmoÄ‡an i beznaÄajan naspram sila koje su tu bile davno prije njega i biti Ä‡e daleko nakon njegove vjerojatno skore i sumnjive smrti.\n\nDrugi ambient kojeg autor postavlja je onaj rasizma i averzije prema prljavoj, neobrazovanoj sirotinji. Protagonist i svi pozitivci su obrazovani bijelci viÅ¡e ili srednje viÅ¡e klase, umjetnici, pjesnici, Älanovi sveuÄiliÅ¡ta i policija. ÄŒak je i jedini dobar lik iz niÅ¾e klase opisan kao iznenaÄ‘ujuÄ‡e obrazovan. S druge strane, svi sumnjivi, nepovjerljivi i izravno zli likovi su crnci, mulati, Indijanci, Meksikanci, radnici s dokova i generalno sirotinja. Ne kaÅ¾em da je u krivu, samo da nije suptilan u svom rasizmu.\n\nUkratko, sjajan kratki horor za ispunit posljepodne ovih dana, siguran sam da je dostupan na nekom od poznatih izvora.\n\n4.5/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "M-16",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "sintetika (vandaLara)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4908": {
      "poster": "[deleted]",
      "content": "@mAcaLukas#4907 \n\nPreseliÅ¡ se sa Å½itnjaka i odmah poÄneÅ¡ Äitat knjigeðŸ¤”",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "4909": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@ElitePer#4908 Da bar, al naÅ¾alost ili na sreÄ‡u, joÅ¡ sam na Å½itnjaku do daljnjeg iako gledam i razmatram stanove po FB grupama. Samo od te aktivnosti poÅ¾elim spaliti ovaj grad to nestabilnih, nearmiranih, neizoliranih temelja",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5046": {
      "poster": "STAGGER_LEE",
      "content": "[Italo Calvino - If on a Winter's Night a Traveler\n\n](https://www.goodreads.com/book/show/374233.If_on_a_Winter_s_Night_a_Traveler)\n\n10 zapoÄetih a nezavrÅ¡enih priÄa s paralelnim zapletom izmeÄ‘u \"Äitatelja\" i \"Äitateljice\", na momente je teÅ¡ko pratit ali bez obzira na to odliÄna knjiga",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "mAcaLukas (mAca Lukas)",
          "xpn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5088": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - The Dead Zone](https://www.goodreads.com/book/show/10859100-the-dead-zone)\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5442": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Lemmy Kilmister, Jannis Garza - White Line Fever](https://www.goodreads.com/book/show/48643925-autobiografija-frontmana-grupe-motorhead)\n\nu principu reizdanje originalne autobiografije iz 2002, uz kratak dodatak i pogovor koji pokriva ostatak perioda\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Rendom"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5850": {
      "poster": "Paulie_Walnuts",
      "content": "**Philip Roth - Zavjera protiv Amerike**\n\n4.5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "5984": {
      "poster": "Amali (Amajli)",
      "content": "# The Witcher\n## Andrzej Sapkowski\n\n***\n\n### [The Last Wish](https://www.goodreads.com/book/show/40603587-the-last-wish)\n\nPrva knjiga serijala, makar je sastavljena od razliÄitih kratkih priÄa iz Geraltovog Å¾ivota pa je viÅ¡e kao nulta, prequel. PriÄe su kind of uokvirene/voÄ‘ene jednom trenutnom kratkom priÄom. Samo se ta trenutna i mislim druga po redu ne pojavljuju u seriji, ako je netko gledao, no i ove iz serije su ipak napisane malo ili viÅ¡e drugaÄije.\n\nPriliÄno jednostavan stil, jako Äitljivo. MraÄniji fantasy sa zanimljivim idejama i dobrim glavnim likom, a i generalno su mi likovi dobri. Daje mi vrlo fantasy osjeÄ‡aj, ako to ima smisla.\n\nJako mi se svidjelo pa nastavljam dalje sa Sword of Destiny, joÅ¡ jednim skupom kratkih priÄa koje su takoÄ‘er prequel glavnom serijalu.\n\n#### Ocjena\n**5 / 5**",
      "votes": {
        "upvoters": [
          "Amon",
          "BalkanStar",
          "Dome",
          "Jakic007",
          "JeleeII",
          "Krilo (PastaItaliana)",
          "Lenobius",
          "Svarog (Veles)",
          "[deleted]",
          "feel_d_boot (iNut)",
          "johndoe12 (enaiks)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "6121": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "### Marko VidojkoviÄ‡ - E baÅ¡ vam hvala\nBy jugonostalgiÄari for jugonostalgiÄari\n\nGodine 1989. skupina visokopozicioniranih vjernih komunista sruÅ¡i avion s ameriÄkim plaÄ‡enicima, MiloÅ¡eviÄ‡em, TuÄ‘manom, IzetbegoviÄ‡em.. koji je iÅ¡ao na tajni sastanak za odluÄivanje raspada Jugoslavije. S obzirom da se nisu sastali, Jugoslavija se nije raspala i sada je svetska velesila u kojoj je rak rijetka pojava, marihuana legalizovana, a svaka pruga mag-lev. Ipak, s obzirom da je raspad Jugoslavije bio toliko bitan za univerzum, posledice dakve divergencije vremenskih tokova poÄinju se osetiti u vremensko-prostornom kontinuitetu.\n\nKnjiga sadrÅ¾i jako puno jeftinih trikova da bi stariju populaciju podsjetila na \"ljepÅ¡a\" vremena koju pokuÅ¡ava provuÄ‡i kao \"world building\". Nema potrebe da mi 8 puta u knjizi napomeneÅ¡ da glavni lik vozi Zastavu 1001, elektriÄno Äudo tehnike iz Kragujevca s pored kojeg nitko ni ne Å¾eli nemaÄka kola. Ima par dobrih fora i dijalozi su puno realniji nego Å¡to lokalni autori inaÄe smisle, ali kraj je cheezy as fuck i predvidiv. Koncept je fora, izvedba je osrednja, poruka kurÄeva.\n\n3 od 5 kraka na zvezdi",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "HeHe (Direktor Å¾ivota)",
          "STAGGER_LEE",
          "Svarog (Veles)",
          "indythedog"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "6532": {
      "poster": "Jimothy",
      "content": "John Grisham - Gray Mountain\n\nKrenulo je zanimljivo, ali je zavrÅ¡ilo razoÄaravajuÄ‡e. Ni blizu njegovih najboljih knjiga.\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "6871": {
      "poster": "Alcatraz",
      "content": "[Atul Gawande - Being Mortal: Medicine and What Matters in the End](https://www.goodreads.com/book/show/20696006-being-mortal)\n\nPrvi dio knige je puno laksi za citati i prica o tome kako se nositi sa staroscu, sa zdravstvenim problemima, gubitkom samostalnosti i kako postoje nacini na koje mozes imati ispunjen zivot unatoc svim ogranicenjima.\n\nDrugi dio onda uzima malo mracniji zaokret i fokusira na suocavanje sa smrcu, kako se nositi s tim zadnjim trenucima, kada ima smisla nadati se i pokusavati, a kada odustati i shvatiti da je gotovo i samim time sebi te zadnje trenutke uciniti sto ugodnijima. Govori i o napretku medicine koja se vise fokusira na popravljanje problema iako nekad mozda i na samu stetu pacijenata. \n\nDosta teska knjiga za citati. U jednu ruku mi daje nadu da da zivot u starosti moze biti ugodan i imati smisao, a u drugu me ispunjava strahom i neizvjesnoscu kakve sve komplikacije i zivotne borbe mogu nastati i kako se pomiriti sa svojom smrtnoscu i prolaznoscu. Pokazala mi je u neku ruku da je umrijeti laksi dio cijelog procesa, puno je teze do tog trenutka doci bez gubitka dostojanstva i po svojim pravilima.\n\n5/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7135": {
      "poster": "Amali (Amajli)",
      "content": "# The Witcher\n## Andrzej Sapkowski\n\n***\n\n### [Sword of Destiny](https://www.goodreads.com/book/show/25454056-sword-of-destiny?utf8=%E2%9C%93&language_code=en#communityReviews)\n\nDojmovi nisu prerazliciti od prve, ova mi je mozda cak i nesto draza - ima nesto vise filozofiranja o witcherima i kodu i bicima i sudbini. Zadnje dvije price su mi daleko najbolje.\n\nOno sto sam zaboravila jos za prvu reci je da, bar ove kratke price, imaju neke dijelove koji su iz nasih bajki - npr. mala sirena, snjeguljica, i jos neke kojih se ne mogu sjetit i neke koje ne znam. Ali nije bas 1:1 i dobro je napravljeno. \\:D\n\nSve u svemu...\n#### Ocjena\n**5 / 5**",
      "votes": {
        "upvoters": [
          "Amon",
          "BalkanStar",
          "Jakic007",
          "Lenobius"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8020": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@STAGGER_LEE starts touching himself\n\n![](assets/2020-04-10/00013.jpeg)",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124",
          "Svarog (Veles)",
          "[deleted]",
          "feel_d_boot (iNut)",
          "xpn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Dome",
          "Filemon",
          "InCogNiTo124",
          "Mioch",
          "Svarog (Veles)",
          "ZliDule",
          "iNavy (mornar Ica)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "8728": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "### H. P. Lovecraft - The Dunwich Horror\nJoÅ¡ jedan Lovecraft-ov klasik u kojem ovaj put ulogu zlih ljudi ne igraju crnci i hispanici, nego incestoidni seljaci iz zabaÄenog dijela Massachusetts-a. Na vrhu planine uz koju se njihovo selo smjestilo, nalazi se oltar sliÄan Stonehenge-u koji stoji tamo od prije njihovog dolaska. OdreÄ‘ene dane u godini oltar gori, iz tla se Äuju glasovi, a psi podivljaju. Lokalci su veÄ‡ navikli. Onda jednoga dana albino kÄ‡erka  lokalnog Äudaka rodi sina koji ubrzano raste pa s 3 godine veÄ‡ Äita i izgleda kao da mu je 10. PoÄnu drevnim zlatnicima otkupljivat stoku od susjeda iako im se krdo nikad ne poveÄ‡ava. Dalje neÄ‡u spoil-at, kome se Äita, vrijedi.\n\nHoror aspekt priÄe nije temeljen na iznenaÄ‘enjima, plot twist-evima ili velikim otkrivanjima. Lovecraft kroz cijelu priÄu daje naslutiti Å¡ta se deÅ¡ava, Äime bi moglo kulminirati i postepeno gradi sveukupno jezivu sliku. Ne udara Äitatelja ÄekiÄ‡em po glavi s tim kako je reveal pametan, nego polako sastavlja cjelokupnu priÄu u vaÅ¡oj glavi. I Äak tako posigne jeziviju priÄu. That said, sama priÄa nije toliko straÅ¡na, plus dan opet spasi visokoobrazovani bijelac iz viÅ¡eg sloja. Yay racism.\n\nSolidnih **4 / 5** tentacle monstersa, iako je Call of Cthulhu meni osobno bolji",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "Gulbash",
          "Svarog (Veles)",
          "sintetika (vandaLara)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8729": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "BTW s obzirom da Lovecraft-a Äitam iz dost fancy izdanja koje sam pokupio na Interliberu, kad sam iÅ¡ao dodati knjigu na Goodreads skonto sam da je to dio serijala. Ladies and gents, I present to you [Knickerbocker Classics Slipcase Editions](https://www.goodreads.com/list/show/127119.Knickerbocker_Classics_Slipcase_Editions)\n\n![](https://m.media-amazon.com/images/S/aplus-media/vc/f4701e91-3714-463b-a0cc-0273d859395c._SL300__.jpg)\n\nThey're fancy as fuck",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "EstebanVihaio",
          "Filemon",
          "LauraPalmer",
          "M-16",
          "Svarog (Veles)",
          "amnael",
          "idontwannabemyself",
          "indythedog",
          "laranotreallycroft",
          "sintetika (vandaLara)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8851": {
      "poster": "Jimothy",
      "content": "**Mario Puzo - The Godfather**\n\nOdliÄan film, odliÄna knjiga. Definitivno preporuÄam.\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "EstebanVihaio",
          "Kushim",
          "Svarog (Veles)",
          "indythedog",
          "jadzia-dax (Jadzia Dax)",
          "koode7",
          "spenadla"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "9647": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Cujo](https://www.goodreads.com/book/show/11740848-cujo)\n\nilitiga, u nasem prevodu Äuko\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "indythedog",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "indythedog",
          "mAcaLukas (mAca Lukas)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "13386": {
      "poster": "amnael",
      "content": "[Anton PavloviÄ ÄŒehov - Moj Å¾ivot](https://www.goodreads.com/book/show/312865.My_Life)\n\nNovela moj Å¾ivot pisana je u prvom licu i govori o mladiÄ‡u koji se sukobljava sa svojom obitelji i okolinom zbog njegovog naÄina Å¾ivota. Iako su njegovi preci bili plemiÄ‡kog podrijetla, on Å¾eli raditi fiziÄki posao da bi zaradio za kruh. Novela dosta opisuje naÄin rada u manjem gradu u Rusiji krajem 18. stoljeÄ‡a, a zanimljivo bi bilo napraviti usporedbu s naÄinom rada kod nas sada. Kraj same knjige je dosta poboljÅ¡ao dojam o noveli.\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "[deleted]",
          "indythedog",
          "mAcaLukas (mAca Lukas)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "14513": {
      "poster": "Lukki",
      "content": "### Albert Camus - Kuga\nKnjiga govori o stanju u fiktivnom gradu kojeg je zahvatila kuga. Bila mi je jako zanimljiva za Äitati baÅ¡ zbog ove karantene koja nas je zahvatila. Definitivno preporuÄam.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "ZliDule",
          "[deleted]",
          "amnael",
          "klukas",
          "xpn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "22479": {
      "poster": "amnael",
      "content": "[Gogolj - PriÄa o tome kako su se zavadili Ivan IvanoviÄ‡ i Ivan NikiforoviÄ‡ ](https://www.goodreads.com/book/show/12219615-the-tale-of-how-ivan-ivanovich-quarreled-with-ivan-nikiforovich?ac=1&from_search=true&qid=JsMUG7wyJp&rank=1)\n\nKratka priÄa koja na bizaran naÄin pokazuje kako zbog inata i vlastitog ega dugogodiÅ¡nji prijatelji mogu postati smrtni neprijatelji.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "InCogNiTo124",
          "STAGGER_LEE",
          "[deleted]",
          "indythedog",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "31840": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Christine](https://www.goodreads.com/book/show/11740839-christine)\n\nT-1000 + Rubber\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "32211": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Anthony Burgess - A Clockwork Orange](https://www.goodreads.com/book/show/227463.A_Clockwork_Orange)\n\njedna od stvari koja je ispala bolje kada je bila pretocena u film\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "DazedAndConfused",
          "EstebanVihaio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "39538": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Pet Sematary](https://www.goodreads.com/book/show/10583.Pet_Sematary)\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "39567": {
      "poster": "lup",
      "content": "[Octavia E. Butler - Kindred](https://www.goodreads.com/book/show/60931.Kindred)\n\ncrnkinja koja zivi u americi 1970ih je prisiljena vratiti se u proslost da spasi svog pretka, sina robovlasnika, od smrti.\n\njako dobro napisano, spisateljica je izvrsno pricarala realnost americkih plantacija i zivota i bijelaca i crnaca u to doba te unutrasnji sukob osobe koja se morala vratiti u to doba\n\n5/5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "39827": {
      "poster": "Mulder",
      "content": "**AnÄ‘elo Jurkas - Bez rocka trajanja**\n\nHrpetina dobre glazbe iz starije i novije povijesti s prostora bivÅ¡e Juge. Da, ima poneki krindÅ¾ tada popularan danas \"kultan\" album tu i tamo, ali ima i hrpetina underground stvari koje sigurno nisu poznate toliko. Autor piÅ¡e lucidno i oÄito je da zna znanje, ponekad zna bit mrvicu preufuran ali i to pridonosi Å¡tihu knjige. Zvjezdica manje jer nema Å ajete, hehe.\n\n4 /5\n\n**Robert W. Chambers - Kralj u Å¾utom**\n\nEh, naravno da sam ovo proÄitao zbog S01 True Detectivea, moÅ¾da sam i zbog toga oÄekivao malo viÅ¡e... nadnaravnog. Prvih par priÄica je peak egzistencijalni horor kojeg je i sam Lovecraft proglasio svojom inspiracijom. Te nadnaravne priÄe su povezane fiktivnom dramom \"Kralj u Å¾utom\", koja ostavi mentalni utisak na svaku osobu koja proÄita to djelo. Ukratko, takvi ljudi polude. Drugi dio knjige Äini takoÄ‘er nekoliko priÄica, od kojih je jedna savrÅ¡en primjer magijskog realizma, jedna impresionistiÄki doÄarava gnjusne strahote rata, a ostalih par su praktiÄki slice of life priÄe ameriÄkih studenata koji su povezani preko boemske Latinske Äetvrti u Parizu. ÄŒak i te slice of life Å¡torije su zanimljive za Äitati jer je i sam autor studirao u Parizu, pa se osjeti daÅ¡ak autentiÄnosti i iskrenosti u tim priÄama.\n\nUglavnom, nadnaravni, kozmiÄki horor dio knjige je savrÅ¡en, ali nedostaje joÅ¡ takvih priÄica, unatoÄ tome Å¡to je i ostatak knjige dobro napisan. Sad vidim koliki je utjecaj Chambers imao na Lovecrafta, a usput i vidim koliko je Lovecraftov horor Å¡lampav u usporedbi s Chambersovim. Obavezno Å¡tivo za fanove prve sezone True Detectivea, fanove kozmiÄkog i egzistencijalistiÄkog horora, te fanove slice of life animea.\n\n4 /5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "amnael",
          "ardi (sprut)",
          "lup"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42219": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Arthur C. Clarke - 2010: Odyssey Two](https://www.goodreads.com/book/show/414967.2010)\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42413": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Arthur C. Clarke - 2061: Odyssey Three](https://www.goodreads.com/book/show/35816.2061)\n\nnekako mi vuce na epizodu star treka u kojem moraju prekrsiti prime directive\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42468": {
      "poster": "koode7",
      "content": "https://www.goodreads.com/book/show/37903770-norse-mythology\n\nNeil Gaiman - Norse Mythology\n\nPisac nas uvodi u knjigu kako su uopÄ‡e priÄe saÄuvane iz perioda kada je krscanstvo krenulo harati nordijsku religiju i kulturu, a kasnije od toga kako su nastali bogovi podzemlja te primjerice, kako je Thor dobio Mjollnir. ðŸ˜€ \n\nizuzetno chill stivo, preporucam.\n\n5/5",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44836": {
      "poster": "haworthia (bulrog)",
      "content": "Bok ljudi, ovo sam objavio na storiju na instagramu, ali mogao bih i ovdje ostavit :D \n\n\nIâ€™m looking for people to participate in a huge book exchange. Just buy your favorite book (just one) and send it to a stranger (Iâ€™ll give you details in a private message). Youâ€™ll receive roughly 36 books sent to you, yours to keep. Theyâ€™ll be favorite books from strangers around the world! If youâ€™re interested in taking part, just message me â€œINâ€ and Iâ€™ll send you details.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44838": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@haworthia#44836 ne.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "[deleted]",
          "aperture"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44854": {
      "poster": "haworthia (bulrog)",
      "content": "@jadzia-dax#44838 ja sam objavio pa tko se zelit javit ce se javit :D\n\nNije bed ako nista ne napisete ako ne zelite sudjelovat :D",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45086": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Andromeda - almanah nauÄne fantastike: SF1](https://www.goodreads.com/book/show/16106550-andromeda---almanah-nau-ne-fantastike)\n\nspecijalno izdanje Galaksije koje sadrzi razne stvari na temu SFa\n\n[Poul Anderson - The Corridors of Time](https://www.goodreads.com/book/show/890300.The_Corridors_of_Time)\n\n2 grupe ratuju u vremenu, not great not terrible\n\n3 / 5\n \nUkupno: 4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45530": {
      "poster": "lup",
      "content": "[ Pyotr Kropotkin - The Conquest of Bread](https://www.goodreads.com/book/show/1113155.The_Conquest_of_Bread)\n\n![](assets/2020-06-27/00054.png)\n\n5/5",
      "votes": {
        "upvoters": [
          "Sveti_Ilija (Sveti Ilija)",
          "amnael",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "47413": {
      "poster": "InCogNiTo124",
      "content": "Zero: The biography of a dangerous idea @Filemon#43194 \n\nPopsci knjiga, vrlo je engaging, autor je savrseno opisao mentalno stanje i filozofiju mislilaca raznih civilizacija, povezuje s religijom, vrlo imersivno. Prolazi kroz povijest matematike (i pred kraj fizike i astronomije), spominje razne matematicare i prikazuje ih kao osobe a ne povijesne crtice. Naucio sam dosta stvari, vecinom fun factova, ali i to da nulu (i beskonacnost) zaista uzimamo for granted i da nema puno razloga da nam ti koncepti budu tako ociti i jasni kao sto danas jesu, a u povijesti ni nisu bili (then again nema nista intuitivnije od nule i beskonacnosti. Mindfucc, al pozitivni)\n\nGreat book, 5/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "JayOhAit",
          "amnael",
          "indythedog",
          "lup",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "47534": {
      "poster": "Amali (Amajli)",
      "content": "## Mali princ\n### Antoine de Saint-ExupÃ©ry\n\nNije mi dosad dosla pod ruke iako sam cula za nju poveci broj puta\n\nSad, cute, very wholesome\n\n#### Ocjena:\n**5/5**",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "InCogNiTo124",
          "Tinx (pingvin)",
          "[deleted]",
          "amnael",
          "indythedog",
          "ink",
          "ivicato",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "48365": {
      "poster": "Amali (Amajli)",
      "content": "Yes, I read\n# [**Warrior Cats**](https://warriorcats.com)\n## Erin Hunter\n----\n\n### #1 The Prophecies Begin\nKnjige\n1. [Into The Wild](https://www.goodreads.com/book/show/111332.Into_the_Wild)\n2. [Fire and Ice](https://www.goodreads.com/book/show/275000.Fire_and_Ice)\n3. [Forest of Secrets](https://www.goodreads.com/book/show/831194.Forest_of_Secrets)\n4. [Rising Storm](https://www.goodreads.com/book/show/295086.Rising_Storm)\n5. [A Dangerous Path](https://www.goodreads.com/book/show/336245.A_Dangerous_Path)\n6. [The Darkest Hour](https://www.goodreads.com/book/show/49006.The_Darkest_Hour)\n\nTL;DR - macke koje vode zivot u sumi, klanovi, ratovi, politika, religija, tradicije, pravila i krsenja istih, loyalty, blahblah. Mildly fantasy ako gledamo all the StarClan and nine lives shit, al nema bas puno toga. Macke i prophecies.\n\n**Knjige pisane za klince**, ima ih shitton, svaka zasebno i nije nesto preduga (u prosjeku 7-8 h citanja u komadu). Ima blesavih dijelova, ima dijelova di se pitam jesu li zaista svi likovi tako glupavi i nepronicljivi pa moze biti blago naporno.\n\nNevertheless, knjige za djecu, zabavno je za citat i lagano, ima vjerojatno neke deep shit poruke negdje u nekim govorima i dogadjanjima.\n\nU ovom konkretnom arcu su mi zadnje tri bolje od prve tri, cini mi se da su prve tri mrvicu sporije iako mi je u petoj bilo excruciating koliko nitko nije nikaj povezivao i koliko se glavni issue ignorirao do zadnjih nekoliko poglavlja, nez vise ni kaj se drugo dogadjalo van tog najglavnijeg plota.\n\nNa pocetku svake knjige postoje repetitivniji dijelovi koji kroz krace opise uz imena il neke dijaloge podsjecaju na dogadjaje iz prethodnih knjiga, bilo iz zadnjih poglavlja prethodne ili nekih davnijih cak knjiga. Ponekad korisno kad je vise knjiga izmedju dogadjaja i tebe pa se vise ne sjecas detalja (npr jel overheard il je direktno otkrivena informacija jer je bilo pet dijelova kroz knjige o tome vec).\n\nAlso, iako je vrlo obviously kid book series, ima stvarno brutalnih dijelova iako nisu bas previse scary il odvratno opisani, but there is some more blood and killing shown in the later books.\n\n#### Ocjena kao knjiga za djecu: 5 / 5\n#### Ocjena kao knjiga kad citas malo stariji: 4 / 5\n\nSpoiler \"rant\"\n>! jebem ti macke koje zive s par bijelih macaka koje su nazvane po svom bijelom krznu, plus tu su i neki bar djelomicno bijeli macici, i onda nadju unwelcome newcomera podjebavat jer ima bijelo krzno. _Look at your best warrior you damned idiots_.\n\nEnd notes - ofkors da cu citat i dalje, al ne ocekujem da ce bit puno razlicitiji dojmovi od ovoga do sad, jedino ak ce mi se likovi vise svidjet il cu ih vise mrzit, who knows. Ak mi se actually svide, though, postoji \\~65% sanse da ce umrijet u tom arcu, bar prema ovim prvim knjigama.",
      "votes": {
        "upvoters": [
          "Amon",
          "lup"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "49265": {
      "poster": "JBear",
      "content": "Ne znam spadaju li pod ovu temu grafiÄki romani/stripovi, ali eto\n### WATCHMEN\nVjerojatno najpoznatiji strip ikad. Autor legendarni Alan Moore, crtao Dave Gibbons.\n\nPriÄa je fantastiÄna, ali ono Å¡to je meni bilo tolko dobro su likovi koji su odliÄno napisani. Moore pokazuje kako bi to stvarno izgledalo da postoje superheroji, ali se fokusira na to kakve osobe su sposobne uopÄ‡e to napraviti te kako to djeluje na sam njihov Å¾ivot. PriÄa je odliÄna, stvorena za ovakav medij te je kraj jedan od najboljih koje sam proÄitao u bilo kojem mediju. Isto tako je odliÄno nacrtan.\n\n10/10\n### BEASTS OF BURDEN\nOvo je jedan moÅ¾da malo manje poznati strip od Dark Horse-a. Napisao Evan Dorkin, nacrtala Jill Thompson.\n\nJako zanimljiva radnja koja se vrti oko grupa inteligentnih pasa iz susjedstva koji istraÅ¾uju paranormalne aktivnosti koje se dogaÄ‘aju u okolici. ZvuÄi moÅ¾da djetinjastvo, ali stvarno nije. Strip je pisan kao avantura, misterij, komedija te horor. Nije baÅ¡ za one koji se jako veÅ¾u za Å¾ivotinje iz fiktivnih djela.\n\n8/10",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "EstebanVihaio",
          "amnael",
          "indythedog",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "55093": {
      "poster": "InCogNiTo124",
      "content": "How to lie with statistics - Darrel Huff\n\nMoji motivi za citanje ove knjige bili su pogresni - htio sam vidjeti kako se tocno sve moze manipulirati statistikom. Ispada, nikako. Ali, sa prikazom statistickih rezultata... Jako puno.\n\nKnjiga je bila dodatna literatura iz SAPa i obicno nitko ne cita ni pravu literaturu, kamoli dodatnu. E pa, super je. Knjiga prolazi (jako i malo) poznatim primjerima iz 20.st gdje statistika navodi na krivi trag - prvo se obraduju slucajne pogreske (sampling bias, survivorship bias), a onda i one malo manje slucajne (odsjecanje y osi, neproprocionalni prikazi, povrsina vs duzina itd itd).\n\nKnjiga je pisana onak 1954 (**!!!**) ali je jos uvijek dosta primjenjiva na sve one grafice koji cesto bivaju objavljeni po novinama, fejsevima, a i nekim znanstvenim radovima. Stovise, knjiga je toliko stara da se citanjem doslovno moze primjetiti kako su to bila neka sasvim drugacija vremena i da neke napisane stvari danas ne bi prosle - primjer je bio sa anketom u nekom casopisu kojeg, citiram, \"cita srednja i visa klasa, a ne crncuge\", pa je to kao dovelo do neke pogresne analize.\n\nU svakom slucaju da se dobro nauciti obrana od statistkickih manipulacija... a malo i same manipulacije \\:)\n\n5/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Emma63194",
          "[deleted]",
          "amnael",
          "ink",
          "lup",
          "member",
          "wutangfan (HugoStiglitz)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "57530": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Julijan Å ribar, Boris Motik - Demifisticirani C++ (4. izdanje)](https://www.goodreads.com/book/show/43188504-demistificirani-c)\n\novo je potrajalo, poprilicno dobra literatura za nekog tko pocinje ili vec neko vrijeme ima iskustva kao quick referenca\n\nno generalno ne pokriva nikakav napredniji sadrzaj\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Emma63194",
          "InCogNiTo124",
          "Ollie",
          "[deleted]",
          "amnael",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Red_Baron",
          "STAGGER_LEE"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "57627": {
      "poster": "EstebanVihaio",
      "content": "[Eleanor Oliphant Is Completely Fine](https://www.goodreads.com/book/show/31434883-eleanor-oliphant-is-completely-fine)\n\nGlavni lik je Eleanor Oliphant, socijalno osakaÄ‡ena tridesetogodiÅ¡njakinja s traumatiÄnom proÅ¡losti i kroz knjigu se prati njeno sudjelovanje u svakodnevnom Å¾ivotu. \n\nSluÄajno kupljena knjiga na ljetnom sajmu - dosadaÅ¡nje iskustvo mi pokazuje kako random izabrane knjige najpozitivnije i najugodnije iznenade. Vrlo Äitljivo, vrlo smijeÅ¡no Å¡tivo - takvo Ä‡e biti svakom Äitatelju koji pristupi knjizi bez nekih velikih oÄekivanja. Kao lik, Eleanor je zamiÅ¡ljena kao iznimno ekscentriÄna osoba, Å¡to je prvotno vrlo smijeÅ¡no, ali kroz knjigu postaje sve zanimljivije kako se otkrivaju razlozi i okolnosti pod kojim se razvila u takvu individuu. Ako Äitatelj ne obraÄ‡a dovoljno paÅ¾nje, knjiga ga nagradi vrlo zgodnim plot twistom u posljednjoj treÄ‡ini. \n\nMislim da se mnogi mogu pronaÄ‡i u liku Eleanor Oliphant, pa makar se poistovjetili s njom u samo jednom fragmentu vlastite osobnosti. Zaista mislim da je opravdano zaÅ¡to je ova knjiga osvojila nagradu 2017. iako je debut novel. Tople preporuke.\n\n> _\"A philosophical question: if a tree falls in a forest and no one is around to hear it, does it make a sound? And if a woman who's wholly alone occasionally talks to a pot plant, is she certifiable? I think that it is perfectly normal to talk to oneself occasionally. It's not as though I'm expecting a reply. I'm fully aware that Polly is a houseplant.\"_\n\n10/10",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Emma63194",
          "[deleted]",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58827": {
      "poster": "InCogNiTo124",
      "content": "[Surrounded by idiots - Thomas Erikson](https://thomaserikson.com/en/books/surrounded-by-idiots/)\n\nAs opposed to a popular opinion oko ferovaca, ja zapravo volim pricat s ljudima. Nekad sam u centru i zbijam sale, nekad sam po strane i slusam i pitam. Ali, s nekim ljudima nikako ne mogu odma doc do nekog razgovora. Ne znam kako osobe razmisljaju i na sto god da ja kazem dobijem totalno neocekivani razgovor i onda bude awkward silence. Kao da se informacija izgubi u kanalu. Ili su oni samo idioti?\n\nE pa, knjiga mi je otkrila da su razliciti ljudi zapravo - razliciti (neocekivano ikr), ali svejedno uz svu razlicitost generalno se grupiramo u uzorke slicnog ponasanja. Ponasanja je autor povezao s bojama, pa imamo svadave i uzurbane Crvene, pricljive i vesele Zute, letargicne i uplasene Zelene i smirene hladne i precizne Plave. Dalje knjiga opisuje traitove svakih, kako reagiraju, kako medusobno interagiraju te kako suzivjeti sa svakim od tipova na radnom ali i u privatnom zivotu. Iz knjige bas prsti osobno iskustvo autora, tocno se vidi da je ucio iz zivotnih situacija, zna navesti primjere za sve, zna reci kad su iznimke i zasto su iznimke.\n\nBudimo realni, nista sta pise u knjizi nije sad nesto spektakularno revolucionarno. Ako si introspektivna osoba, koja je provela bar malo vremena promatrajuci druge, sve ovo ces vec znat. Ja sam gotovo complete oposite i nis nisam o tom znao lmao i uvijek sam bio sokiran kako su ti tipovi dobro definirani te me je fasciniralo koliko se cesto vecina znacajka skupa pojavljuju kod osoba koje poznajem, al svejedno je logicno i intuitivno. No, neosporivo je da je masa tih informacija na jednom mjestu jako korisna stvar, i za naucit ako ne znas, ili za neki reference kod komuniciranja s drugim osobama.\n\nDosta je korisna sekcija i o stresu - prolazi sva 4 tipa osobnosti i gleda sto ih najvise stresira te kako se copeaju s time. Za kraj jedna povijesna crtica gdje se dotako stare grcke (sangvinici, kolerici i ostali) i azteka (vatra voda zemlja zrak) koji su basically dosli do istih zakljucaka prije tisucu godina - uber zanimljivo.\n\nNe znam koja ocjena al onak 4.5/5 barem, veliki plus joj je citljivost (atmosfera je ko da ste na pivi u Havani, il barem neki neformalni sastanak gdje se zajebava) te mogucnost koristenja ko mini manual za humanse xD iduca na redu mi je od njega \"Surrounded by psychopaths\"\n\n>! also ak itko mari, ja sam zuto crven i prezirem plave lp",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "EstebanVihaio",
          "Filemon",
          "KiflaKiflic",
          "Quentin",
          "[deleted]",
          "idontwannabemyself",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58966": {
      "poster": "Amali (Amajli)",
      "content": "@InCogNiTo124#58827 \n\nMoj note o knjizi, premisljala sam se dal da napisem nekaj il ne, pogotovo nakon kaj je Inco ostavio review.\n\nNo dobro\n\nProzdrzla sam ju kroz nekoliko dana.\n\nNije dosadna, neformalna je i jako lagana i prilicno fora za citanje. Lijepo je organizirano po cjelinama, unutar svake se koncentrira na neki aspekt ponasanja/osobnosti pa prodje po svim tipovima, a sve ima primjere iz njegovog zivota koji jasno docaravaju razlicite tipove.\n\nDefinitivno je to nesto sto je pisano s ciljem da bude neformalnije i dostupnije puku.\n\nBasically je jako neat little guide za odnos s ljudima, ako nista da osvijesti negativne percepcije necijih ponasanja pa da se na tom poradi, pogotovo u ovisnosti o tipu osobe s kojom se komunicira (doduse tu je pretpostavka da mozes procijeniti tip osobe!).\n\nOsim toga, prilicno je dobro i za konkretiziranje generalne svijesti o samom sebi, bar malo. Npr. ja sam naletjela na jednu recenicu ili paragraf koji je lijepo koncizno i precizno opisao moje stanje uma u odredjenim situacijama koje ja sama nisam znala lijepo opisati kad sam htjela. Takve stvari pomogle su i da se osjecam marginalno manje ko sore thumb.\n\nHmmm, ova knjiga je i dost dobar pregled svih tipova ljudi for general interest, iako su \"samo 4\" kategorije naspram onih 16 mbti. Then again, buduci da nisam nikad trazila, ne mogu sa sigurnoscu reci da **ne postoji** visemanje comprehensive guide/comparison tih 16 kao sto ova knjiga istovremeno objasnjava i dodatno usporeduje ove 4.\n\nDodatno, osobno mi je falilo znanstvenog pristupa _uz_ te opsirne primjere i situacije. Ne mislim bas na odgovore na pitanja tipa \"zasto\", iako bi to bilo infinitely zanimljivije ako uopce postoje odgovori at this point in time, nego cisto nekakvo bar anketno potkrepljenje stvari koje se navode, nekakvi konkretniji dokazi da odredjeni tipovi ljudi imaju odredjena misljenja umjesto anegdotalnih o ciscim jedinkama svakog tipa i \"20 godina iskustva\". Sure, it works, intuitivno je jasna vecina stvari - barem meni kao introvertu. Still, I like stats.\n\n\nZa mene je ovo\n\n4 / 5\n\n|| Jebem ti markdown razlomke ||",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "[deleted]",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59042": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "MBTI ima malo veze sa stvarnoscu. Pretpostavljaju da se ljudi mogu podijeliti dvije kategorije (po skali) na temelju intervalne vrijednosti. To znaci da bi distribucije tih vrijednosti na skalama trebale biti biomodalne, dok su ustvari normalne. Sto znaci da test radi kategorijalne razlike izmedu ljudi koji se vrlo malo razlikuju. To ne znaci da nema cistih crvenih ili cistih INTP, ali za vecinu populacije to ne stoji.\n\nJos k tome reduciraju intervalnu vrijednost na binarnu, sto znaci da se gubi znacajan dio informacije.\n\nMozda je nama to zabavno i ne shvacamo to ozbiljno, ali dosta tvrtka odlucuje na temelju toga da li ces biti zaposlen ili ne",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "Amali (Amajli)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59045": {
      "poster": "Amali (Amajli)",
      "content": "@Johnny_Bravo#59042 \n\nOdes u tvrtke koje ne rade to i mir, pa makar i da bi tebe zaposlili na temelju tog. Ionako ti ne treba firma koja te zaposljava na temelju aspekata tvoje prirode na koje ne utjeces, pogotovo po binarnom, jer je definitivno vecina ljudi neka mijesavina dve krajnosti, a ne ekstremi. Well, mozda ti treba ako si isti ko ekipa koja misli da je to super nacin za odabir.\n\nDoduse ako se dobro sjecam mbti cuda ti stave neki postotak gdje si izmedju I i E, isto za one druge 3, pa ak vec zele zaposljavat po online testovima osobnosti nek bar to pogledaju detaljno jer tek s tim dobijes vise pravu sliku lol. Nije problem u MBTI ni Hipokratovoj klasifikaciji, ni bojama ni elementima, problem je u poslodavcu, and for that refer yourself back to the first paragraph.\n\nNitko nigdje ne kaze, niti u knjizi Surrounded by Idiots niti na MBTI testu, da si samo jedno i tjt. Bas je svugdje jasno da je to nekakva linearna kombinacija. No neovisno o tome, cak i kad binarno zalijepis tag na osobnost vecinom mozes ocekivat da se ta osobnost ponasa najvise na taj nacin. Nece bit 100% match, ne moze ni bit, al je vise accurate klasifikacija od nikakve i, ak nikaj, barem osobi na osobnoj razini moze pomoci shvatiti sebe i da je normalna, pogotovo introvertima u ovom \"ekstrovertiranom\" svijetu.\n\nAlso, studying behaviour and personality is just extremely interesting.\n\nBasically, to ima puno veze sa stvarnoscu ako to gledas ispravno. Nisu krive klasifikacije, krivi su ljudi koji to prepovrsno gledaju.",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59046": {
      "poster": "GTX9800",
      "content": "> @Amali#59045 Nisu krive klasifikacije, krivi su ljudi koji to prepovrsno gledaju.\n\nI jedno i drugo: https://en.wikipedia.org/wiki/Myers%E2%80%93Briggs_Type_Indicator#Criticism",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59152": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@Amali#59045 \n> Odes u tvrtke koje ne rade to i mir, pa makar i da bi tebe zaposlili na temelju tog. \n> \nk? Moj argument je bio protiv pretpostavljenog: 'To je samo za zabavu i nitko to ne shvaca ozbiljno'.\n> Nitko nigdje ne kaze, niti u knjizi Surrounded by Idiots niti na MBTI testu, da si samo jedno i tjt. Bas je svugdje jasno da je to nekakva linearna kombinacija\n> \nTest ti sam kaze cinjenicom da razvrstava ljude u kategoriji, a ne daje samo broj na skali kao priznati testovi licnosti\n\n> al je vise accurate klasifikacija od nikakve \n> \nNajveca moguca pohvala za test licnosti. Brojati koliko osoba kaze rijeci u minuti i to usporediti s prosjekom je isto tocnija procjena ekstraverzije nego nista.\n\n > Also, studying behaviour and personality is just extremely interesting.\n \n Nisam ni rekao da nije. rekao sam da taj test nije to. Ako te zanima polje bolje bi ti bilo citati materijale stvarnih znanstvenika a ne licnosti iz pop kulture. Makar je upitno koliko ti i ti znanstvenici mogu reci o osobnosti.\n> Basically, to ima puno veze sa stvarnoscu ako to gledas ispravno. Nisu krive klasifikacije, krivi su ljudi koji to prepovrsno gledaju.\n> \nNe, test je prilicno kriv. Slabe je pouzdanosti i nikakve valjanosti (iz razloga koje sam spomenuo).",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59237": {
      "poster": "Mulder",
      "content": "**Michel Houellebecq - Platforma**\n\nIzuzetno kontroverzan roman od pisca bez dlake na jeziku. Glavni lik knjige (koji je u neku ruku preslika samog pisca), Michel, uÅ¾asno je apatiÄan lik koji nakon oÄeve smrti odluÄi otiÄ‡i na izlet u Tajland kako bi se maknuo iz Francuske. Na putu upoznaje Valerie s kojom zapoÄinje romansu po povratku doma. Radnja je zapravo jako jednostavna, bez ikakvih zamrÅ¡enja i neizvjesnosti i obrata (osim u jednom specifiÄnom dijelu knjige), ali ona je ovdje sporedna i sluÅ¾i kao katalizator zbivanja, ideologija i druÅ¡tvenih pojava koje pisac kroz svoj lik u knjizi britko i izravno secira. Propast seksualnosti u zapadnom svijetu, surovost radikalnog terorizma, propitkivanje nekih stereotipa u odnosima izmeÄ‘u razliÄitih rasa i naroda, ali i nekih individualnih pitanja poput sreÄ‡e, ljubavi i zadovoljstva koje osoba moÅ¾e doÅ¾ivjeti u svom Å¾ivotu. Naravno, knjiga je krcata soft porn segmentima, ali na kraju knjige je zapravo jasno da nijedan od tih eksplicitnih dogaÄ‘aja nije bio napisan Äisto jer je pisac perverznjak, veÄ‡ su napisani sa svrhom. Ukratko, mislim da je glavna poanta cijele knjige malo smotano iznesena na samom kraju, a to je da svijet uza sve svoje Äari i sadrÅ¾aje i ljude nema smisla bez ljubavi. Cijela ta teza je ispriÄana u jako teÅ¡kom i mraÄnom tonu (pogotovo s obzirom na dogaÄ‘aje koji su prethodili zadnjem dijelu knjige), ali koliko god da je ciniÄna, ima smisla. Uglavnom, nestvarno iskustvo za proÄitati i Å¡okantan kraj su me baÅ¡ osvojili, tako da se nakon rokova bacam na ostala Å¡tiva ovog spaljenog gospodina.\n\n5/5",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59267": {
      "poster": "amnael",
      "content": "[Dalton Trumbo - Johnny je krenuo u rat ](https://www.goodreads.com/book/show/23397148-johnny-je-krenuo-u-rat)\n\nAntiratni roman koji je izaÅ¡ao 2 dana nakon pocetka drugog svjetskog rata, govori o vojniku koji je nastrao tijekom prvog svjeskog rata. Zbog granate je Joe Bonham izgubio ruke i noge, i ne moze govoriti niti cuti, ali nije mrtav. On je mrtvac ciji mozak joÅ¡ uvijek misli.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60333": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Andromeda - almanah nauÄne fantastike: SF2](https://www.goodreads.com/book/show/28119260-andromeda---almanah-nau-ne-fantastike)\n\n-> [Michael Crichton - The Andromeda Strain](https://www.goodreads.com/book/show/7670.The_Andromeda_Strain) => ocekivala sam nesto malo vise, ali ok 4 / 5\n\n4 / 5 \n\n[Andromeda - almanah nauÄne fantastike: SF3](https://www.goodreads.com/book/show/28728164-andromeda---almanah-nau-ne-fantastike)\n\n-> [Clifford D. Simak - Time and Again](https://www.goodreads.com/book/show/876499.Time_and_Again)\n\n-> [Gerard Klein - The Day Before Tommorow](https://www.goodreads.com/book/show/1680747.The_Day_Before_Tomorrow)\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "64201": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "[Khaled Hosseini - GoniÄ zmajeva](https://www.goodreads.com/book/show/11230163-goni-zmajeva)\n\nPrvo malo o tome kako me uopÄ‡e zapala ova knjiga. SluÄajno sam je uoÄio u Algoritmovom (rip) Å¡tandu na interliberu prije nekih 7-8 godina jer ju je davno prije toga bila preporuÄila profesorica hrvatskog koja me je prezirala i osjeÄaj je bio uzvraÄen. UnatoÄ mentalnoj slici njene sreÄ‡e jer je na neki naÄin utjecala na moju odluku, kupio sam knjigu jer je bila 20kn. S obzirom na bunt kupljenih knjiga, jako dugo nije doÅ¡la na red pa sam je posudio staroj kad me pitala jel imam iÅ¡ta na hrvatskom. Nedugo nakon toga me kolega na f2n pitao da mu je prodam za poklon nekome (sry buraz, saÅ¡ vidit Å¡ta bi), ali je mater u meÄ‘uvremenu posudila knjigu susjedi, pa kolegici s posla, pa tetki koja je knjigu odnjela na 6mj u NjemaÄku, pa drugoj kolegici, pa roÄ‘akinji koja je knjigu vratila na 8 mj u NjemaÄku... Knjiga mi je doÅ¡la nazad u ruke prije par mjeseci pa sam odluÄio iskoristiti priliku prije nego je izgubim zauvijek. Sure enough, nakon Å¡to sam proÄitao knjigu, mater je opet uzela za neke svoje planove.\n\nRadnja kroz Å¾ivot prati mladog Afganistanca iz bogate Kabulske Äetvrti koji slugu/prijatelja etniÄku manjinu. Å½ene, kao u islamu, tako i u romanu, su nebitne. NeÄ‡u dalje priÄat jer je najbolje u knjigu uÄi bez znanja i oÄekivanja, Äak bi bilo dobro da ste historijksi malo nepismeni.\n>!Samo Ä‡u reÄ‡i da je glavni lik pizdun i Å¡upak (i to kroz cijeli Å¾ivot, kurca ne nauÄi), Äale isto, ali na drugi naÄin.\n\nHosseini Å¡uta vaÅ¡e srce u muda te ga raznosi bombom.\n\n**9/10** muÄ‘ahedinskih brada",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "EstebanVihaio",
          "Filemon",
          "InCogNiTo124",
          "KitKat (H(x))",
          "[deleted]",
          "amnael",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "64548": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Skeleton Crew](https://www.goodreads.com/book/show/12994558-skeleton-crew)\n\nnekako ipak vise preferiram kad se raspise kompletno nego ukratko, al ok\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "66859": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Ernest Hemingway - The Sun Also Rises](https://www.goodreads.com/book/show/3876.The_Sun_Also_Rises)\n\nnjeh\n\n3 / 5\n\n[Arthur C. Clarke - 3001: The Final Odyssey](https://www.goodreads.com/book/show/63432.3001)\n\nzanimljiv kraj, nesto bolji od prethodnog dijela\n\n4 / 5",
      "votes": {
        "upvoters": [
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "71318": {
      "poster": "Mulder",
      "content": "**Michel Houellebecq - H.P. Lovecraft: Protiv svijeta, protiv Å¾ivota**\n\nEh, Houellebecq svrÅ¡ava po Lovecraftu al ne mogu se baÅ¡ u puno stvari sloÅ¾it s njim. DoduÅ¡e, dotiÄe se tema aseksualnosti i Lovecraftovog rasizma Å¡to je uvijek good point to talk about, ali stvarno ne dijelim s autorom fascinaciju Lovecraftovim dijelima. Jebiga, nemam Å¡to pametno previÅ¡e dodat.\n\n2.5/5\n\n**Michel Houellebecq - Elementarne Äestice**\n\nFascinantno mi je kako Houellebecq uspijeva biti toliko ekstremno kritiÄan, mizogin, mizantropiÄan, toliko negativan da nakon Äitanja njegovih djela filozofija nihilizma djeluje kao nekakav opuÅ¡ak cigarete baÄen na trotoar. Knjiga o dvojici polubraÄ‡e, svaki sa svojim problemima i Å¾ivotnim nedaÄ‡ama koje su krenule od trenutka kad ih je rodila njihova seksualno liberalna hipi majka. Prvi, Michel, radi kao molekularni biolog i jedan je od najboljih u svojoj struci, a njegov polubrat Bruno je prosvjetni radnik. Prvi je seksualno i emotivno prazan, pogonjen samo znanjem, a drugi je pogonjen samo seksualnom poÅ¾udom i frustracijama. Knjiga zapravo nelinearno prolazi kroz razliÄite periode njihova Å¾ivota, pokazuje zaÅ¡to su ta dvojica u svojim starim godinama takvi kakvi jesu, iz kakvih su okolina proizaÅ¡li i u kojim druÅ¡tvenim okolnostima su odrasli. Nevjerojatno je Å¡to Houellebecq jako fluidno mijenja fokus sa znanosti na sociologiju i filozofiju i obratno, istovremeno zadrÅ¾avajuÄ‡i jasan tok dogaÄ‘aja koji nose radnju. Jedino Å¡to mislim da je malo traljavo je povremeno preveliko onaniranje pisca oko nekih tema i epilog koji mi iskreno nije sjeo jer malo uniÅ¡tava cijeli taj negativan, beznadan ton knjige. Mislim jebiga, cila knjiga se vuÄe na granici zamislivog pesimizma koji se lako upija i preslikava na vlastiti Å¾ivot, a taj epilog kroz filozofiju i kratku futuristiÄku fikciju daje gotovo djetinjasto, naivno rjeÅ¡enje svih Å¾ivotnih problema. E i da, knjiga ima masu erotskih scena, al one u Platformi su bile ipak bolje,,, heh\n\n4 /5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "[deleted]",
          "amnael",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "72648": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - It](https://www.goodreads.com/book/show/830502.It)\n\npa neznam, napeto je i zanimljivo za procitat, ali bas da osecam neki strah ko sto ljudi kazu, nije istina\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "72841": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Carl Sagan - Contact](https://www.goodreads.com/book/show/61666.Contact)\n\npocinje zanimljivo, ali s vremenom neko jednostavno gubi na tome\n\n3 / 5",
      "votes": {
        "upvoters": [
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73595": {
      "poster": "[deleted]",
      "content": "@jadzia-dax#72841 kompa, jesu te knjige upute za konstantno zaglupljivanje?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73605": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@GAVRAN#73595 a gle ako se os udrit njom, vjerojatno mozes",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "Filemon",
          "Gussy (huba buba)",
          "Mulder",
          "[deleted]",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "77594": {
      "poster": "pipi (cicipjorica)",
      "content": "**Anthony Burgess - Paklena naranÄa**\n\nPriÄa se zasniva na 15-godiÅ¡njem Alexu koji sa svojom ekips i sliÄnim gengovima  Äini pravo zajebanu distopijsku subkulturu. On i njegova maloljetna banda zabavu pronalaze u brutalnim zloÄinima, a naÄin na koji u istima uÅ¾ivaju ih Äini joÅ¡ viÅ¡e izopaÄenim i mraÄnim.\n\nBurgessova Å¡aÅ¡ava nonÅ¡alancija izraza i Å¾argonizmi (ludo kreativan mix s ruskim) dodatno pojaÄavaju grotesku tih \"ultranasilnih\" i muÄnih dijelova. \n\nPrvi dio Ä‡e vam se moÅ¾da uÄinit Å¡okantno tupim, al smislen je za jaÄi daljnji dojam. U drugom se teÅ¾iÅ¡te stavlja na alexovu izmuÄenu psihu. Naime, naÅ¡ devijantni omladinac je u meÄ‘uvremenu prisilno  pretvoren u \"stroj na navijanje\", tj. psihosomatski su mu zgaÄ‘eni prijaÅ¡nji uÅ¾itci i sad slijedi hard cope. \n\nKnjiga fino okrzne i filozofiju morala i baca opÄ‡enitu kritiku licemjerju druÅ¡tva.\n\nKraj je toliko apsurdan da Ä‡u ga shvatit ciniÄno. \n\nP.S.\n\nHvala Äika Burgess, odsad mi je \"tolÄokiranje\" it izraz za odalamit nekog, a bilo bi najs proÄitat i izvorno jer ovo je sigurno jedna od knjiga koja je dosta izgubila prijevodom. \n\nðŸ‘ŠðŸ»ðŸ‘ŠðŸ»ðŸ‘ŠðŸ»ðŸ‘ŠðŸ»/5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "InCogNiTo124",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself",
          "jadzia-dax (Jadzia Dax)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "81113": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Adam Higginbotham - Midnight in Chernobyl: The Untold Story of the World's Greatest Nuclear Disaster](https://www.goodreads.com/book/show/51294277-midnight-in-chernobyl)\n\nnovelizacija well, pogodite cega, iako je sadrzajno skroz ok, urednik je komad budale koji zasluzuje otkaz, knjiga sadrzi impresivnih 104 stranice biljezaka koje nekim magicnim cudom nisu uopce oznacene u tekstu nego bi covjek trebao magicno pogadati na sto se referenciraju\n\nnaravno uz tu kolicinu, nelogicno bi bilo staviti ih uz tekst, ali vecim dijelom su gluposti koje su mogle biti izbacene, a relevantne kontekstualno smislene biljeske biti ostavljene\n\nsadrzajno 4 / 5, izvedbeno 3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "81131": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Cycle of the Werewolf](https://www.goodreads.com/book/show/43618193-cycle-of-the-werewolf)\n\nautorov kratak trenutak inspiracije vukodlacima, no nista posebno\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "81622": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "Kvizopedija 1\n\nodlicno stivo za kvizove, pitanja su originalna i kvalitetna Ne treba ni spominjati da ce vam se rezultati na domacim kvizovima znacajno poboljsati jer domaci autori nerijetko inspiraciju pronalaze bas u ovoj knjizi.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "JayOhAit",
          "Svarog (Veles)",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "89733": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Douglas Adams - The Hitchhiker's Guide to the Galaxy: A Trilogy in Five Parts](https://www.goodreads.com/book/show/35496596-the-hitchhiker-s-guide-to-the-galaxy)\n\ndobar, ok, meh, meh, meh\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Emma63194",
          "Hooloovoo",
          "Mrcina (Yoso)",
          "Red_Baron",
          "mAcaLukas (mAca Lukas)",
          "spejs"
        ]
      }
    },
    "91260": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Misery](www.goodreads.com/book/show/10614.Misery)\n\n4 / 5",
      "votes": {
        "upvoters": [
          "blast"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "95976": {
      "poster": "[deleted]",
      "content": "Elizabeth Chadwick - NajveÄ‡i vitez\n\nknjiga je sranje nisam doso ni do 30. str. kolko je prekrcana pridjevima i pokusavanjem da bude wow zadivljujuca",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "Mulder"
        ]
      },
      "reactions": {
        "haha": [
          "Kikyy99"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "102091": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - The Tommyknockers](https://www.goodreads.com/book/show/17660.The_Tommyknockers)\n\na ono, da je nastavilo kako je krenulo bilo bi ok, ovako je ah eh?\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107208": {
      "poster": "InCogNiTo124",
      "content": "[Amy Shira Teitel - Breaking the chains of gravity: the story of spaceflight before NASA](https://g.co/kgs/r1kHez)\n\nDost lose u biti. Ocekivao sam neki linearni tok dogada i dobio sam tak nes, no uz to doslo je i puno losih stvari. Ko prvo, u par poglavlja zenska je stalno ponavljala fraze poput \"gingerly\" ili \"it was all but \\*nesto\\*\" sto me iritiralo. Nadalje, umjesto onak nekog objektivnog opisa, dobio sam zadacnicu koja iz treceg lica prica pricu. Cesto govori o avioncicima i raketama ali nigdje slike ili nekog tehnickog opisa, samo umjetnikov dozivljaj toga. Cesto da bi stvorila napetost ulazi u mozak trenutnog glavnog lika (svako poglavlje je netko drugi otprilike) i pise stvari kao \"mislio je\", \"osjecao je\", \"bojao se\", onako zeno idgaf gib stori.\n\nUz to, sve je ofc pisano u imperial unitsima uzas\n\nOther than all that, kjut pricica really, saznas za puno imena, objasni dosta povijesnog konteksta iza svacega sto je zapravo najs, iako malo romantizira te rane njemacke znanstvenike kao \"oni su samo htjeli viditi svoje rakete kak lete i bili su primorani uci u nazi stranku da to dozive\" reko sure thing sweetie. Isto tako previse je USA centric, ne znam zasto sam ocekivao da ce pokrit i sovjetsku raketnu povijest, samo se u jednom poglavlju pojavilo \"von braun i eisenhower su bili na gala zabavi kad ono sputnik im leti iznad glave i von braun je napravio scenu tamo\" lol\n\nSve u svemu `<3 / 5`",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107213": {
      "poster": "Grumio",
      "content": "Jel netko citao knjige tipa neuromancer?\n\n Mislim da sam otkrio da mi je najdrazi SF setting cyberpunk, pa bi bilo super ako netko moze preporucit koju knjigu za razbibrigu.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107386": {
      "poster": "johndoe12 (enaiks)",
      "content": "@Grumio#107213 iskorisiti cu jedan citat o toj knizi: citati neuromancer je kao slusati talijansku operu, ne razumijes rijeci ali osjetis emociju. meni je dobar i brave new world bio nakon toga",
      "votes": {
        "upvoters": [
          "Grumio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107408": {
      "poster": "Mike (Klaud Konzultanta)",
      "content": "@Grumio#107213 BaÅ¡ ga Äitam i to Äitanje razvlaÄim nekih pola godine. Stil pisanja bi opisao kao feverish dream i nije baÅ¡ najrazumljiviji, Å¡to je piÅ¡Äev naÄin gradnje atmosfere i dobro mu to ide, ali ostavlja zbunjujuÄ‡i dojam. Jako je fascinantno izgraÄ‘en svijet i u nekim stvarima zvuÄi proroÄanski, no opet je smijeÅ¡no kada ponekad vidiÅ¡ neke stvari poput brojanja radne memorije u megabajtima i to bi trebalo biti wow.\n\nLikovi me nisu previÅ¡e uhvatili, karakterizacija je kaubojska, ali tek sam na pola knjige pa neÄ‡u dovoditi sudove o tome. Mislim da nije dobra knjiga za vratiti se Äitanju novela na engleskom, pogotovo ako ti engleski nije materinji, zbog gore navedenih razloga. Mislim da sam tu pogrijeÅ¡io Å¡to se nisam malo zagrijao s nekim razumljivijim Å¡tivom prije pa da ne izgubim interes tako lako.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Grumio",
          "Svarog (Veles)",
          "johndoe12 (enaiks)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107691": {
      "poster": "Kushim",
      "content": "Brave new world je meni najbolja distopijska/utopijska knjiga ikad, if anyone gives a fuck",
      "votes": {
        "upvoters": [
          "DazedAndConfused",
          "InCogNiTo124",
          "aperture",
          "ataxia",
          "johndoe12 (enaiks)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107717": {
      "poster": "Kushim",
      "content": "Zadnje sto sam procitao je Remarqueovo \"Na zapadu nista novo\". Knjiga me potresla i obogatila. Knjiga prikazuje probleme i njihove uzroke svih izgubljenih generacija. Mozda knjiga govori o WW1, ali je zapravo svevremenska. \n\nSuper mi je sto sam ranije citao dosta knjiga na temu antropologije i sociologije, ali su one rijetko kada govorile o izgubljenim generacijama. Sad je ova knjiga dosla kao nadopuna razumijevanja izgubljene generacije koja je \"odrasla\" u domovinskom ratu, a s kojima smo okruzeni.",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107956": {
      "poster": "DazedAndConfused",
      "content": "@jadzia-dax#66859 Disclaimer: ovime ne pokuÅ¡avam pokrenuti bilo kakvu raspravu, iskreno me zanima tuÄ‘e miÅ¡ljenje. \n\nE sad Hemingwayev The Sun Also Rises mi je jedna od najdraÅ¾ih knjiga koje sam ikada proÄitao i jako me zanima perspektiva nekoga kome se knjiga nije osobito svidjela pa ako imas vremena da mi u par reÄenica saÅ¾meÅ¡ Å¡to te odbilo.",
      "votes": {
        "upvoters": [
          "Jaster111"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "107965": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@DazedAndConfused#107956 prema mojim zadnjim saznanjima rasprava jos uvijek nije zabranjena, iako uvjerena sam da krizni stab ima nesto protiv ljudi koji razmisljaju\n\nnemam bas nesto za pridonjeti svojem objasnjenju, jednostavno prilikom citanja nisam bas bila narocito odusevljena, iako je proslo tek par mjeseci odkad sam ju procitala ne secam se skoro nicega vise od toga sto sam procitala\n\nmozda ja nisam pokopcala nesto dobro tokom citanja ili profulala (i.e. [Catch 22](https://www.goodreads.com/book/show/168668.Catch_22) mi je ostavio slican dojam) a i u usporedbi s ostatkom sto sam procitala od Hemingwaya (For Whom The Bell Tolls, A Farewell to Arms i The Old Man and the Sea) mi je bilo losije iskustvo; i od zadnje troje navedenog je proslo vise vremena a sjecam ih se bolje od ovoga sto je bilo pre par mjeseci",
      "votes": {
        "upvoters": [
          "DazedAndConfused",
          "Red_Baron"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "110195": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "[Spider Robinson - Callahan's Crosstime Saloon](https://www.goodreads.com/book/show/218677.Callahan_s_Crosstime_Saloon)\n\nDouglas Adams * puns\n\nBar kojeg vodi mix Kamila i Stephen-a Fry-a kojeg naÄ‘e i posjeÄ‡uje samo klijentela kojoj je to potrebno. Svako piÄ‡e je $0.50 kao i ÄaÅ¡a, a na svakom gostu je izbor hoÄ‡e li ÄaÅ¡u ostaviti na Å¡anku i uzeti novce nazad ili nazdraviti pred kaminom i ÄaÅ¡u razbiti u vatru. Kroz godine tamo prolaze svakojaki ljudi i neljudi kojima takav pristup i ostala klijentela pomaÅ¾u u tome da se otvore, razgovaraju o svojim problemima i preÄ‘u preko njih.\n\nSvakog utorka imaju Punday takmiÄenja i realno to je sve Å¡to trebate znati da bi vas knjiga privukla.\n\n9/10 jer sam morao Äitat loÅ¡e formatiran epub, fiziÄke kopije nema dostupne nigdje za Å¾ivu glavu",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "111758": {
      "poster": "Elendur19 (Zagor)",
      "content": "[Patrick Rothfuss - The Name Of The Wind](https://www.goodreads.com/book/show/186074.The_Name_of_the_Wind?from_search=true&from_srp=true&qid=3OnDbiX5aj&rank=1)\n\nPrva knjiga iz trilogije The Kingkiller Chronicle. Zapravo se radi o Äovjeku koji prekriva svoj pravi identitet te radi kao gostioniÄar u malome gradu. No priÄe kruÅ¾e o njegovim nemoguÄ‡im pothvatima te Kote (laÅ¾no ime) odluÄuje ispriÄati vlastitu priÄu putujuÄ‡em piscu, te kaÅ¾e da Ä‡e mu za to trebati tri dana (zato i trilogija). \n\nKnjiga je odliÄna, detaljno razraÄ‘ena te imate osjeÄ‡aj kao da proÅ¾ivljavate njegovu mladost uz njega. \n\n4.5 / 5",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "111829": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@Elendur19#111758 trilogija koliko je ASOIAF u sedam dijelova. Jako sporo Äitaj drugi dio, naÄekat Ä‡eÅ¡ se za treÄi",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Elendur19 (Zagor)",
          "johndoe12 (enaiks)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "111835": {
      "poster": "Elendur19 (Zagor)",
      "content": "@mAcaLukas#111829 Ma proÄitao sam ju veÄ‡ i nije mi dobra kao prva, nekako mi se Äini da je odugovlaÄio i niÅ¡ta pre korisno se nije dogodilo. Ne znam kako Ä‡e u toj zadnjoj sve zavrÅ¡iti",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "111999": {
      "poster": "Stubla",
      "content": "Sun Tzu - UmijeÄ‡e ratovanja\n\nKratka i zanimljiva knjiga (tehniÄki u 6.st.PK bio priruÄnik za kineske vojskovoÄ‘e), koja govori o tome da moraÅ¡ dobro poznavati i sebe i protivnika, da bi vaÅ¡a pobjeda u borbi bila zagarantirana. Mnogi je primjenjuju i dan danas u poslovnom svijetu.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "InCogNiTo124",
          "KitKat (H(x))",
          "Mariox",
          "Tinx (pingvin)",
          "amnael",
          "spampers (majmunska boginja)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113111": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Nenad MarjanoviÄ‡ - Å½ivot s idi(j)otima](https://www.goodreads.com/book/show/50055960-ivot-s-idi-j-otima)\n\nugodna stvar o KUDu\n\n5 / 5\n\n[Bjarne Stroustrup - The C++ Programming Language](https://www.goodreads.com/book/show/12508475-the-c-programming-language)\n\nprosli puta kada sam procitala demifisticirani me netko pitao koliko mi je trebalo, pa, rekla bih da sam ovu citala vise manje zadnjih pola godine aktivno:\n\n![](assets/2020-12-21/00033.png)\n\niako knjiga ima materijala za 2 godine provesti nad njom ako cete rjesavati i excerciseove, ja sam ih preskocila\n\n5 / 5\n\nDmitry Glukhovsky - [Metro 2033](https://www.goodreads.com/book/show/7942042-metro-2033), [Metro 2034](https://www.goodreads.com/book/show/24355647-metro-2034), [Metro 2035](https://www.goodreads.com/book/show/33113864-metro-2035)\n\nprvi dio mi je bio nekako previse isprekidan, drugi je imao kontinuitet ali dosadnjikav, treci pogada negdje sredinu\n\nne znam dali je do prijevoda ili autora, ali tu i tamo sam se na nekim likovima izgubila\n\nsve u svemu nelosa stvar za bacit oko\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Emma63194",
          "[deleted]",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113117": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@Elendur19#111835 VidiÅ¡, iako je prva moÅ¾da objektivno bolja jer radi taj ogroman build-up i legendu oko Kvothe-a, druga mi je draÅ¾a jer napokon dobijaÅ¡ sliku kako je netko tako mlad stvorio takvu legendu oko svoga lika i kako je ta legenda poprimila oblik. Barem dio navedenih postignuÄ‡a s pozadine korica prve knjige se objasni do kraja druge.\n\n@johndoe12 thoughts?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113159": {
      "poster": "johndoe12 (enaiks)",
      "content": "@mAcaLukas#113117 \n\nMeni rijetko da je prva knjiga iz neke trilogije najbolja (izuzev Final empire, to je stvarno bolestan twist na zadnjih 50 stranica). Pa tako i u ovom sluÄaju, Name of the Wind je setting up the stage and the figures, upoznajemo se s likovima, neÅ¡to malo akcije u sredini i na kraju knjige, tek toliko da te namami da Å¾eliÅ¡ Äitati i drugu knjigu, E onda kreneÅ¡ Äitati drugu knjigu i tu je masa dogaÄ‘aja, Kvothe se bolje snalazi u svojim vjeÅ¡tinama, postaje poznatiji itd. U drugoj knjizi je meni osobno najdosadniji dio bio kada je Kvothe bio u onoj nekoj zemlji gdje ne priÄaju puno i uÄio borilaÄku vjeÅ¡tinu. Jedva Äekam 3.dio i oÄekujem da Ä‡emo zamrziti Kvothe u tom dijelu, barem se nadam. Jer ako ispadne da je dobio one nicknameove jer su ljudi krivo protumaÄili njegove dobre i moralne namjere, dÅ¾abe si kreÄio Rothfuss..\n\nSad se moram nadovezati i na First Law trilogiju.. u prvoj knjizi se pitaÅ¡ zaÅ¡to svi hejtaju Bloody Nine-a, pa izgleda kao tako zanimljiv i misteriozan Äovjek, uvijek na oprezu. U drugoj knjizi shvatiÅ¡ da moÅ¾da boluje od neke psihoze ili split personalitya, a u treÄ‡oj skuÅ¾iÅ¡ da zbog te voje bolesti je poubijao sve Å¡to Å¾ivi oko njega, prijatelje, neprijatelje, you name it, vidiÅ¡ da mu nema pomoÄ‡i i da ga ljudi s razlogom hejtaju, ali je svejedno legenda haha",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Pengwing",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113163": {
      "poster": "BreadCat",
      "content": "> @johndoe12#113159 izuzev Final empire, to je stvarno bolestan twist na zadnjih 50 stranica\n\nÅ irim evanÄ‘elje Brandona Sandersona. \n\nDugo nisam Äitao i onda sam krenuo sa Mistbornom cca prije 3 mjeseca. Od onda sam proÄitao 4000 stranica njegovih djela i stvarno je sve bolje i bolje. Nakon originalne trilogije Mistborna koja je imala baÅ¡ vrhunski ending sam krenuo na Stormlight Archive koji je meni osobno puno bolji universe. Sad je Rhythm of War izaÅ¡ao nedavno, al nisam krenuo Äitat trebao bih i to brzo poÄet.\n\ntl;dr Äitajte Sandersona",
      "votes": {
        "upvoters": [
          "Elendur19 (Zagor)",
          "Filemon",
          "KitKat (H(x))",
          "Pengwing",
          "johndoe12 (enaiks)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113169": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@jadzia-dax#113111 Koliko smisla ima citati knjigu o C++ bez rjesavanja exerciseove? Nekako mi to nije ekvivalentno gledanju CPP cona gdje u par h obrade neku specificnu temu  npr generiranje random broja. Ipak je to 1000+ str i jos je knjiga zapravo na neki nacin reference za c++",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113172": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@iLabaviUmeDaZabavi#113169 target audience definitivno nije netko tko je pocetnik, vec intermediate publika ili netko kome treba reference kao sto i sam kazes, uciti iz toga je ekvivalentno samoubojstvu iz zasjede\n\nu tom skupu, excerciseovi imaju vecu korist kao ideje za mentoriranje nekoga a ne za vlastitu vjezbu; ne tvrdim da ih 100% treba ignorirati, naprotiv ima excerciseova koji su definitivno challenging i netrivijalni na kojima bi i naprednija publika naucila nesto; ali nisam sigurna jeli ROI dovoljno velik za to, odnosno bolje mi zvuci procitati ih pa ce se prije ili kasnije u profesionalnom kontekstu pojaviti nesto gdje bi ta ideja mogla dobro doci\n\nmislim da je veca vrijednost u kompletnom overviewu (barem je meni bila), u usporedbi s CppConom, koji ti daje tockasti pregled neke teme, a cinjenica je da je jezik takav da i nakon duzeg vremena bavljenja s njime sigurno postoje stvari koje su ti promakle, ili ti jednostavno nikada nisu trebale\n\ntakoder ne sugeriram da se excersiceovi nebi trebali rjesavati, u slucaju Demifisticiranog, koji je namjenjen vise za pocetnike definitivno bih isto preporucila",
      "votes": {
        "upvoters": [
          "Emma63194",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113342": {
      "poster": "Mulder",
      "content": "nabavio ebook reader, 2021 goodreads challenge sigurno odraÄ‘ujem WOO\n\n**James Ellroy - The Black Dahlia (L.A. Quartet, #1)**\n\nEpiÄni hard boiled noir o jednom od medijski najluÄ‘ih krimi sluÄajeva ikad. Naravno, roman je polufikcija (ubojstvo Elizabeth Short se dogodilo i nikad nije otkriven ubica), ali tako je metodiÄki napisan i prezentiran da nije teÅ¡ko povjerovati kako se neÅ¡to opisano u romanu i stvarno dogodilo. Cijelu radnju doÅ¾ivljavamo kroz oÄi Buckyja Bleicharta, bivÅ¡eg boksaÄa koji je postao pandur. On i njegov isto ex boksaÄ bestie, Lee Blanchard, zajedno prolaze kroz sve nedaÄ‡e koje im sluÄaj Dahlije zadaje, kako u poslovnom, tako i u privatnom smislu. I to je najveÄ‡a Äar ove knjige, iako je cijeli sluÄaj gotovo perfektno policijski prezentiran, puno je vaÅ¾nija komponenta psihiÄke traume koju je cili sluÄaj ostavio na sve upletene. Do kraja knjige dogaÄ‘a se toliko twistova i turnova (moÅ¾da i mrvicu previÅ¡e), ali najviÅ¡e pati psiha svih ukljuÄenih. Ellroy jako pitko piÅ¡e kalifornijski sleng sa hrpom pandurskog Å¾argona Å¡to joÅ¡ samo pojaÄava dojam stvari koje Äitatelj \"saznaje\" iz Bleichartove nakupine sivih stanica. Knjiga ima ubojstva i odurnih gore opisa, ima seksa, ima mentalne i moralne dekadencije, sve skupa zamotano u holivudsko bljeÅ¡tavilo i iluzije. Sve Å¡ta Ä‘aku treba heh\n\n**4.5/5**\n\n\n**James Ellroy -  The Big Nowhere (L.A. Quartet, #2)**\n\nA mislim jebemu, ovo je stvarno vrh vrhova. PriÄa o tri pandura koje povezuje politiÄka istraga nad komunjarama u Holivudu, al svaki od likova ima neku svoju sporednu Å¡toriju. Ellroy opet roka taj old skul pandursko-uliÄni Å¾argon, frajer piÅ¡e s tolikim stilom da je nevjerojatno velik guÅ¡t upijat fraze i rijeÄi ostavljene u nekim proÅ¡lim vremenima. Rekao bi da se u ovoj knjizi nalazi joÅ¡ viÅ¡e lowlife scuma, pimpova, narkiÄ‡a, ljudi s margina druÅ¡tva nego u proÅ¡loj knjizi, ali svi su jako efektno kontrirani s glamuroznim, privilegiranim holivudskim guzonjama i lijevom buroÅ¾azijom, tako da praktiÄki ovdje imamo doticaj sa svim moguÄ‡im druÅ¡tvenim kastama. Dosta je velik fokus na komunjare i homoseksualce tijekom knjige (buduÄ‡i da je main plot vezan uz Red Scare a jedan od side plotova uz queer ubojstva) Å¡to je jako fora s obzirom na poloÅ¾aj i doÅ¾ivljaj u druÅ¡tvu koji su ti ljudi imali. Nez, nemam nekih zamjerki, pogotovo nakon zadnjih 70-ak stranica koje su Äisti adrenalin zapisan u rijeÄima, kraj koji lijepo zaokruÅ¾uje cilu priÄu i legit pogodi Äitatelja sa hrpom obrata i otkrivanja (al ne previÅ¡e kao Å¡to je bio sluÄaj u Black Dahliji). Tldr vrhunski pismeni neo-noir i prekulerski napisana knjiga, jako sam zadovoljan.\n\n**5/5**\n\n**James Ellroy - L.A. Confidential (L.A. Quartet, #3)**\n\nTreÄ‡a knjiga u seriji, istovremeno i knjiga koje me bilo najviÅ¡e strah iÄ‡ Äitat Äisto iz razloga Å¡to mi je filmska adaptacija jedan od najdraÅ¾ih filmova, bilo me strah da Ä‡u znat plot i da Ä‡e mi iskustvo Äitanja bit oblikovano prema gledanju filma. ALI!! NiÅ¡ta od toga, film je jako lagodno hrpetinu priÄe izmijenio i pojednostavio (Å¡to je super stvar za gledat). Ugl, knjiga prati trojicu pandura Äiji se pandurski Å¾ivoti vrte oko ubojstva u kafani Nite Owl. Da bude tipiÄno Ellroyevski, radnja se proteÅ¾e kroz nekoliko godina, ogromna je koliÄina likova i informacija za probavit i povezat, pogotovo Å¡to se oko centralnog sluÄajeva lijepi nemali niz sporednih sluÄajeva koji opet imaju neke svoje aktere i rasplete. Uglavnom, jako je puno toga za probavit i Ellroy se ne trudi pretjerano vodit Äitatelja za ruku Å¡to zna bit zamorno Äisto zbog epiÄno velikog opsega zbivanja u knjizi. Malo je i off-putting velik broj poglavlja jer opet vrijedi 1 poglavlje = perspektiva 1 lika, a sa hrpetinom kratkih poglavlja i velikim brojem dogaÄ‘aja ful se lako pogubit. Uglavnom, meni osobno najslabija knjiga u Quartetu do sad, ali i dalje se radi o jako dobrom Äitanju. \n\n**4./5**\n\n\n**James Ellroy - White Jazz (L.A. Quartet, #4)**\n\nZadnja knjiga u L.A. Quartetu, najkraÄ‡a od svih i najdivljaÄkija. Ellroy dovodi do vrhunca svoj stil pisanja do te mjere da frajer samo roka reÄenice ko mitraljez i hrpetina tih kratkih misli bi kao trebale stvorit sliku o tome Å¡to se dogaÄ‘a unutar il van lika, al nerijetko bude samo uÅ¾asno konfuzno. Plot prati korumpiranog pandura Davea Kleina koji radi na sluÄaju kraÄ‘e u kuÄ‡i bogate dilerske obitelji koji su snitchevi LAPD-u. Uglavnom, krene dosta smor al kasnije se dogaÄ‘aju i ubojstva i mlaÄ‡enja i seks i sto drugih divljih stvari i pojavljuje se sto razliÄith njuÅ¡ki joÅ¡ luÄ‘ih od Kleina, tako da je dosta lagano \"navijat\" za njega do kraja knjige. Naravno, pojavljuju se i likovi iz prijaÅ¡njih knjiga i Ellroy donekle fino zaokruÅ¾uje cilu priÄu koja se proteÅ¾e joÅ¡ od Big Nowherea. E sad, problem je White Jazza Å¡to koristi masu trikova i identiÄnih raspleta kao u proÅ¡lim knjigama, a ne pomaÅ¾e ni radnja doÅ¾ivljena kroz jednog lika. U Black Dahliji je to funkcioniralo jer je tamoÅ¡nji glavni lik Bleichart bio uglavnom katalizator dogaÄ‘aja i sluÄaj je bio popriliÄno fokusiran na jedno ubojstvo, ali White Jazz u sebi pakira toliko razliÄitih plotova i likova da je teÅ¡ko iz perspektive jednog lika pohvatat sve konce. Å teta Å¡to Ellroy nije koristio viÅ¡e likova kao u prijaÅ¡nje dvi knjige, cila knjiga bi imala puno viÅ¡e smisla i hrpa stvari bi se jasnije posloÅ¾ila. Uglavnom, radi se o jako adrenalinskom i brzopoteznom Äitanju, konstantno se dogaÄ‘a neki muvment i neki novi wow wtf se dogaÄ‘a dogaÄ‘aj i nije loÅ¡a knjiga, al osobno bi volio da je ovih par prije nabrojanih sitnica drukÄije odraÄ‘eno.\n\n**3.5/5**\n\nsve skupa: ako volite dobar krimiÄ‡ i cijenite ameriÄki sleng 40-ih i 50-ih, ako drkate na noir filmove kao i ja i ako vam je milo vidit n-rijeÄ napisanu na svakoj drugoj stranici, def se isplati Äitat ovaj serijal. obavezno na engleskom i obavezno uz povremeni sipp viskija. pozz!",
      "votes": {
        "upvoters": [
          "JeleeII",
          "Kushim",
          "[deleted]",
          "[deleted]",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "113759": {
      "poster": "Amali (Amajli)",
      "content": "@BreadCat#113163 ako mozete podnijeti taj stil pisanja, that is\n\nJa sam probala stormlight i aps ga nmg izgurat, bar ne s gustom, jedino ak postane puno bolje nakoonnnn 7. poglavlja na kojem sam stala, al afaik taj infodump stil se ne mijenja. Stil mi ubije svu zelju za upoznat se s likovima koji zvuce...pa okej. Nisam odusevljena ko svi reviewovi koje sam cula i procitala, a nije mi prvi put da sam se tako opekla na te neke popularnije pisce o kojima naletis uglavnom samo na hvalospjeve, pisce koji ponekad i stancaju knjige i knjige koje su jos i debele i di su likovi obicno mladji od 20. Dojam mi je od pocetka \"amateur, infodump, and/or not thoroughly edited\". Nacitala sam se stvari koje su mi imale uzasan stil i ndms vise. I guess sanderson je zaista bio idealan fit za pisanje kraja wheel of time koji isto nisam mogla prozvakat dalje od <10 poglavlja, tu su mi negdje, iako sam za WoT uspjela nakon kaj me udavio nac da govore ljudi \"nije za svakoga\" i da moze bit tesko i dosadno.\n\nOsobno mi to vrijedi i za rothfussa, bilo mi je dost sporo i nije mi smekalo bas, iako i na hrvatskom bolje od sandersona ngl",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114031": {
      "poster": "InCogNiTo124",
      "content": "[The element in the room - Helen Arney, Steve Mould](https://g.co/kgs/ab4b99)\n\nKjut nerdy book, vise za klince doduse, dva autora se izmjenjuju u pisanju prica iz zivota, party trickova i opisa eksperimenata za radit po doma i ostalo. Prolaze se fora djelovi kemije, fizike, matematike i astronomije. Knjiga je doslovce _prepuna_ losih punova i forica and **I love it.** Ako imate necaka/inju ili nekog mladeg ko voli sciency stuff (i zna engleski), savrseno.\n\n5/5",
      "votes": {
        "upvoters": [
          "Amon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114032": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "> @InCogNiTo124#114031 Knjiga je doslovce prepuna losih punova i forica and I love it.\n\nSounds like someone needs some Spider Robinson",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114033": {
      "poster": "InCogNiTo124",
      "content": "@mAcaLukas#114032 \n> Spider Robinson has won a number of awards for his hard science fiction and humorous stories\n\nMislim da si u pravu",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114360": {
      "poster": "[deleted]",
      "content": "@jadzia-dax#113111 Jesi Äitala neÅ¡to od Stepanova? _From Mathematics to Generic Programming_ ili _Elements of Programming_?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114361": {
      "poster": "InCogNiTo124",
      "content": "@tolecnal#114360 ja sam poceo eop citat jednom davno, al nije pre easy read, ja obicno citam pred spavanje a ta knjiga mi uzima puno koncentracije pa nisam dosao dalje od 2 pog. Al planiram nastavit _jednom_",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114362": {
      "poster": "[deleted]",
      "content": "@InCogNiTo124#114361 Da. EoP je dosta teÅ¾ak. Ekipa Äesto preporuÄa proÄitat FM2GP prvo, a onda nastavit s EoP.\n\nNisam ni ja Äitao, prolistao sam samo.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114363": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@tolecnal#114360 nisam, iako da, takve stvari su dosta korisne u dizajnu\n\nsljedece na redu mi je Lakosova biblija, a nakon toga cu vidit, definitivno bi htjela procitati FM2GP, ali vrijeme je limitiran resurs :D",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114384": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - The Dark Tower I: The Gunslinger](https://www.goodreads.com/book/show/29430673-the-gunslinger)\n\nmalo previse, what did i just read dojma\n\n3 / 5\n\n[Stephen King - The Dark Tower II: The Drawing of the Three](https://www.goodreads.com/book/show/29430675-the-drawing-of-the-three)\n\nnapredak od prethodnika\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "114403": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@jadzia-dax#114384 nas dvoje nikako da se sloÅ¾imo oko ocjene neke knjige",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Filemon",
          "Svarog (Veles)",
          "jadzia-dax (Jadzia Dax)",
          "johndoe12 (enaiks)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "114830": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Jack Williamson - Humanoidi](https://www.goodreads.com/book/show/11970.The_Humanoids)\n\nnakon nuklearnog rata ljudi su napravili humanoidne strojeve koji bi ih zastitili od vlastite tehnologije kojima je prva naredba \"Sluziti i slusati i cuvati Covjeka od Zla\". well shit hits the fan jer humanoidi brane ljudima sve sto ih moze dovesti u opasnost ukljucujuci i aktivnosti poput voznje bicikla\n\nako postoji netko kome takav zivot smeta, taj jednostavno bude izoliran i napucan euforidom\n> Nasa droga, euforid, brise teret nepotrebnog sjecanja i tjeskobu nekorisnoga straha. Prekinuvsi  koroziju stresa i napora ona utrostrucuje kratku zivotnu dob ljudskih bica. ... Nase je usluge stite od bilo koje potrebe ili zla. Ako vas to suvise brine, mozda bi koristilo da i vi uzmete euforid\n\nvrlo ugodno iznenadenje na koje sam slucajno naletila, ostavlja pomalo distopijski feeling\n\n5 / 5\n\n[Jack Williamson - The Humanoid Touch](https://www.goodreads.com/book/show/898029.The_Humanoid_Touch)\n\nfast forward ~ 1000 godina na udaljeni planet, potomcima ljudi koji su pobjegli humanoidi su mit\n\nguess who's back?\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115574": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[William Golding - Lord of the Flies](https://www.goodreads.com/book/show/7624.Lord_of_the_Flies)\n\npa, nista mu nefali, ali isto tako nije nista revolucionarno\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115603": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Friedrich Nietzsche - The Anti-Christ](https://www.goodreads.com/book/show/18304.The_Anti_Christ)\n\nmomak ima odredenih problema s krscanstvom, ako ih imate i vi, go ahead\n\n4 / 5",
      "votes": {
        "upvoters": [
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "KitKat (H(x))",
          "Mariox"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "118667": {
      "poster": "InCogNiTo124",
      "content": "[Andriy Burkhov: Machine Learning Engineering](http://www.mlebook.com/)\n\nLik objasnjava sta sve treba napravit u prosjecnom ML projektu, koji su minimumi, koje su dobre prakse, kako najbolje nesto sredit, na sta treba pazit, na sta teeba _jako_ pazit n shit. Jako puno razlicitih slucajeva pokriva. Text je easy read, no ako je normalno pisan, ne mogu se otresti osjecaja kao da je pisano u natuknicama lol kao sta sve treba ispostivat, al fkt je pisano u tekstu. Mozda kratke recenice nez\n\nUgl po 17-na-n-ti put sam si pokazo da je pravljenje modela onak 2% posla, i to je ionako sve vec automatizirano, prave baje dobro pretprocesuiraju podatke. Also, naucio nest novo iz statistike\n\n4/5 jer iako je kvalitetna sa savjetima, nije sad nest mindblowing, osim sta makne caroliju (ili ono sto je od nje ostalo) od ML podrucja",
      "votes": {
        "upvoters": [
          "Cereal_Killer (vagab0nd0)",
          "Red_Baron",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "jadzia-dax (Jadzia Dax)",
          "kix7 (Fish99)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "122360": {
      "poster": "Mulder",
      "content": "**Michael Gira - The Consumer**\n\nKolekcija kratkih priÄa koje je Gira pisao tijekom 90-ih i 80-ih. Dosta naslova su naslovi raznih pjesama od Swansa i ostalih Gira related projekata i fora je proÄitat tu neku priÄu iz koje pjesma vuÄe inspiraciju. E sad, sve bi to bilo super da izmeÄ‘u priÄa ima ikakve prevelike varijacije. Teme su uglavnom Å¡okantne i gnjusne, a variraju od pedofilije, nekrofilije, bdsm stvari, tjelesne dekompozicije (to pogotovo, u jednom trenutku mi je postalo naporno proÄitat joÅ¡ jedan opis raspadanja tijela u nekakvu Å¾elatinu or smth) pa sve do nekih squatter priÄa, Äudnih fetiÅ¡a i raznih psiholoÅ¡kih vizija nastalih tijekom Girnih droga tripova. NajveÄ‡i problem priÄa je Å¡to su sve na isti kalup i Å¡to Gira piÅ¡e jako naporno u smislu da koristi puno previÅ¡e metafora i usporedba (drinking game: popi guc pive svaki put kad proÄitaÅ¡ \"like\") i prenakrcava reÄenice do te mjere da se lako pogubit u tekstu. PriÄe na poÄetku su fora jer je stil svjeÅ¾, ali se kroz 30-ak stranica jako brzo ustali. Negdje od polovice su ultra kratke priÄe od po stranice il dvije, to sam preletio jer mi se iskreno nije ni dalo viÅ¡e Äitat. Mislim, ovo je knjiga za die hard Swans fanove i eventualno neke bolesnike koje vole Äitat ovakve Å¡kifece, neÄ‡e niko normalan gubit vrime s ovim. Za kvalitetno bolesno Gira iskustvo preporuÄam posluÅ¡at 20-minutnu spoken word \"pjesmu\" I'm An Infant, I Worship Him sa split albuma Hard Rock kojeg je snimio sa Lydiom Lunch negdje sredinom 80-ih.\n\n3 /5\n\n\n**Scott Tennent - Spiderland (33â…“ #75)**\n\nKnjiga ne samo o jednom od najboljih albuma ikad, nego i o povijesti benda i scene iz koje dolaze. Frajer koji je napisao ovo piÅ¡e jako toplo, nostalgiÄno i u kombinaciji s nepretencioznosti njegovog izraÅ¾aja i iskrenosti dvojice od 4 Älanova benda koji su pristali na intervju, ovih 120-ak stranica Å¡to knjiga nudi je poslastica za svakog fana albuma i benda. Kao analiza glazbe i utjecaja elemenata albuma na bendove koji su doÅ¡li nakon Slinta, osobno nisam proÄitao bolje Å¡tivo. Ipak, za potpuniji dojam o bendu, ciloj toj Louisville sceni iz koje su proizaÅ¡li i za intervjue sa svim Älanovima benda kao i Å¡irom paletom sugovornika, dokumentarac Breadcrumb Trail iz 2014. je ipak esencijalniji medij.\n\n4 /5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "125989": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Steve Klabnik - The Rust Programming Language](https://www.goodreads.com/book/show/25008661-the-rust-programming-language)\n\nvrlo ugodna stvar za uvod u jezik, prakticnih primjera za samostalno kucanje u rangeu `[malo fali, taman)`\n\ntaman tu negdje da se dalje borite s kompajlerom i googlom samostalno\n\n5 / 5",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "127522": {
      "poster": "EstebanVihaio",
      "content": "[Iain Reid - I'm Thinking Of Ending Things](https://www.goodreads.com/book/show/29445758-i-m-thinking-of-ending-things)\n\nDeÄko i djevojka se voze autom do obiteljske farme i onda se viÅ¡e ne voze.\n\n80% knjige je dosta slow burn i jasno mi je kako to moÅ¾e odbiti Äitatelja, ali zato jednom kad se zaplet poÄne rasplitati zanimljivo je uoÄiti sve detalje koji direktno upuÄ‡uju prema poanti priÄe. OdliÄna knjiga za debut novel, lako Å¡tivo, ali ne slaÅ¾em se da je konaÄno objaÅ¡njenje radnje _toliko_ mInD-bLoWiNg koliko su recenzije govorile. \n\n8.5/10, tople preporuke.",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129298": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Dmitry Glukhovsky - FUTU.RE](https://www.goodreads.com/book/show/27300577-futu-re)\n\npa iskreno, neznam, u konacnici mi se cini predugacko i nekako vrti u krug\n\n3 / 5",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129347": {
      "poster": "laranotreallycroft",
      "content": "[Mother of learning](https://www.royalroad.com/fiction/21220/mother-of-learning)\n\nOgromni free web novel za kojeg sam kasnije saznala da ga je Äak napisao neki hrvat.\n\nFantasy setting, lik se naÄ‘e u time loopu i treba skuÅ¾it kak da izaÄ‘e.\n\nU poÄetku malo cringe zbog same karakterizacije lika al generalno odliÄan worldbuilding. Za suckere za time travel ko ja definitivno reccomend, meni trenutno jedna od najdraÅ¾ih knjiga.\n\n5/5",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Pengwing",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "amnael",
          "kix7 (Fish99)",
          "mAcaLukas (mAca Lukas)",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "132581": {
      "poster": "EstebanVihaio",
      "content": "[Esi Edugyan - Half Blood Blues](https://www.goodreads.com/book/show/11076123-half-blood-blues)\n\nSvjedoÄi se dogaÄ‘ajima grupe crnih jazz glazbenika u Berlinu i okupiranom Parizu poÄetkom WW2. ÄŒitatelj sve vidi iz perspektive Sidneya Griffithsa, Afro-Amerikanca koji se moÅ¾e obiljeÅ¾iti kao \"white passing\" jer ima blijeÄ‘u put i svijetle oÄi. Prate se dogaÄ‘aji iz '92., kada se preostali Å¾ivuÄ‡i Älanovi **_Hot-Time Swingersa_** (grupa od dva Afro-Amerikanca, dva Nijemca, jednog Å½idova arijevskog izgleda i jednog _Mischlinga_, iznimno talentiranog Afro-Nijemca imena Hieronymus Thomas Falk), upute na jazz festival napravljen u Äast trubaÄa Falka, nestalog 1939., gdje Ä‡e se prikazati i dokumentarac o njegovom Å¾ivotu (barem ono Å¡to se moglo saznati o njemu prije nego Å¡to je uhiÄ‡en, poslan u logor i za popularnu javnost nestao). \n\nZaplet se gradi oko toga (Å¡to je i summary na pozadini knjige naglasio) da samo Sidney Griffiths zna Å¡to se dogodilo s Hierom - a s obzirom da on neÄ‡e niÅ¡ta reÄ‡i o tome, ispostavilo se da je to bunch of baloney i odmah Ä‡u reÄ‡i da ne Äitate knjigu zbog tog motiva jer odgovore neÄ‡ete dobiti (Å¡to me, istina, malo ispunilo gorÄinom, ali shvaÄ‡am  da na kraju to i nije bila poanta priÄe).\n\nOno Å¡to me _oduvalo_: opisi Berlina i Pariza poÄetkom WW2, prikaz druÅ¡tva iz tog doba, prikaz rasnih i nacionalnih razlika (po Äemu se taj period ljudske povijesti i pamti; ima scena gdje likovi odlaze u hamburÅ¡ki zooloÅ¡ki vrt da vide uhvaÄ‡ene plemenske crnce kako stoje ''izloÅ¾eni'' kao egzotiÄne ptice; natjera Äovjeka na razmiÅ¡ljanje o zooloÅ¡kim u generalnom smislu), jednostavan opis dosega apsolutno sebiÄne, primitivne i idiotske ljudske ljubomore i kako ona zna biti zasljepljujuÄ‡a, meÄ‘urasni odnosi, nacistiÄka propaganda, scena jazz kulture iz tog razdoblja (Äak se i Louis Armstrong pojavljuje, Å¡to je dodatni plus ako se mene pita) jer je u knjizi itekako dobro vidljivo istraÅ¾ivanje o jazz kulturi koje stoji iza Esi-_jinih_(?) opisa.\n\nNe mogu reÄ‡i da mi nije bilo teÅ¡ko Äitati neke od stranica ove knjige zbog suosjeÄ‡anja, tuge, ljutnje, ali ponajviÅ¡e **_frustracije_** jer je povijest pokazala kako se svemir zna posrat na Äovjeka i zato Å¡to mi knjiga na kraju nije otkrila ono Å¡to mi je prvotno probudilo interes za nju.\n\nSve u svemu: **8.3/10**\n\nSvakako preporuÄujem, pogotovo ako volite jazz. FantastiÄno je Äitati knjigu dok vam u pozadini svira cotton club playlist, definitivno pridonosi atmosferi i meni je pomoglo da se ultimativno ''_uÅ¾ivim_'' u knjigu.",
      "votes": {
        "upvoters": [
          "Mulder",
          "[deleted]",
          "mAcaLukas (mAca Lukas)",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134415": {
      "poster": "EstebanVihaio",
      "content": "[Mitch Albom - The Time Keeper](https://www.goodreads.com/book/show/13624688-the-time-keeper)\n\nMoÄ‡na, promiÅ¡ljena, pouÄna i sveobuhvatna priÄa o najveÄ‡em resursu koji ÄovjeÄanstvo nikada neÄ‡e moÄ‡i kontrolirati - vremenu. Knjiga je puna smislenih citata i promiÅ¡ljanja koje natjeraju Äovjeka da dublje razmisli o prirodi ljudskog postojanja i o tome kako ga danas definiramo.\n\nPoglavlja su kratka pa se kroz stranice lako proleti, likovi su vrlo dobro razvijeni, a radnja se na kraju zaokruÅ¾i kad vidimo kako se ljudske sudbine mogu ispreplesti jedna s drugom, bez obzira postoje li u proÅ¡losti, sadaÅ¡njosti ili buduÄ‡nosti.\n\nPriÄa je pisana vrlo jednostavnim jezikom, ali u konaÄnici Albom ne iznosi niÅ¡ta Å¡to veÄ‡ svi ljudi (koji se imalo sluÅ¾e alatom slobodne i neprivatizirane misli) nisu barem jednom za svog Å¾ivota pomislili i samostalno analizirali.\n\nTakoÄ‘er, ova knjiga je dom jednom od mojih najdraÅ¾ih citata:\n\n> _â€œTry to imagine a life without timekeeping. You probably canâ€™t. You know the month, the year, the day of the week. There is a clock on your wall or the dashboard of your car. You have a schedule, a calendar, a time for dinner or a movie. Yet all around you, timekeeping is ignored. Birds are not late. A dog does not check its watch. Deer do not fret over passing birthdays. an alone measures time. Man alone chimes the hour. And, because of this, man alone suffers a paralyzing fear that no other creature endures. A fear of time running out.â€_\n\nDrugi put Äitam ovu knjigu i vidim jasne razlike izmeÄ‘u dojma nakon prvog Äitanja i sada - Å¡to pokazuje da se koncepti vremena, vaÅ¾nosti i vrijednosti Å¾ivota, smrti i njene konaÄnosti, s vremenom sloÅ¾e u nekim ÄvrÅ¡Ä‡im kalupima kad Äovjek ipak moÅ¾e priÄati s relativno zrelijim stavovima i pogledima na  svijet i Å¾ivot u/na njemu.\n\nU konaÄnici: **8.7/10**\n\nDa me se pitalo prije tri godine, ovo bi bila Äista desetka, ali sad je to neÅ¡to manje jer mislim da mi jednostavnost ovako teÅ¡ke filozofske teme nije viÅ¡e toliko upeÄatljiva kao kad prvotno proÄitah ove ideje, a i moÅ¾da mi je i jezik bio mrvicu prejednostavan - Å¡to je, dakako, dvosjekli maÄ - ali, ne treba to uzeti kao odluÄujuÄ‡i faktor pri odluci treba li se ova knjiga proÄitati ili ne. Treba, svakako preporuÄujem.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "135600": {
      "poster": "StefBaustelic",
      "content": "Slobodan RibariÄ‡ - GraÄ‘a raÄunala",
      "votes": {
        "upvoters": [
          "Filemon",
          "jadzia-dax (Jadzia Dax)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BreadCat",
          "Erinon",
          "Filemon",
          "HotPotato",
          "InCogNiTo124",
          "KitKat (H(x))",
          "NekocBraca",
          "Red_Baron",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "madoxx"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "136514": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "[Spider Robinson - Time Travelers Strictly Cash](https://www.goodreads.com/book/show/146842.Time_Travellers_Strictly_Cash) \n\nPredstavljeno kao drugi dio Callahan's serijala, zapravo 4 priÄice koje se uklapaju u serijal i 4 random sci-fi priÄe autora.\n\nDvije random priÄe su jako meh, druge dvije su ok, zanimljivog koncepta. PriÄe iz serijala su ok, ali niÅ¡ta posebno, definitivno loÅ¡ije nego u prvoj knjizi. Uz to, poslje svake priÄe ima mali esej o tome Å¡to ga je inspiriralo da ju napiÅ¡e, odakle mu likovi ili zaÅ¡to ljudi nebi smjeli kritizirati njegovog omiljenog autora. Ti eseji su preteÅ¾ito dulji od samih priÄa.\n\nU samom predgovoru objaÅ¡njava kako nije imao dovoljno materijala za izdat drugu knjigu pa je napuco random priÄe, Älanke i eseje koje je napisao i poduplao broj stranica. Doslovno ti objasni da ti je podvalio muÄ‡ak.\n\nDrago mi je da sam piratizirao, ovo definitivno nebi vrijedilo para ni mjesta na polici.\n\n2 /5 jer su priÄe bile ok",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "141008": {
      "poster": "InCogNiTo124",
      "content": "[Andrew Tannenbaum: Modern Operating Systems](https://g.co/kgs/fv2hcW)\n\napsolutna biblija za operacijske sustave i sve povezano s tim. Moze se citati od korica do korica (kako ja preferiram) ili samo kao referenca za tocno odredene stvari. Prolazi se bas sve, od povijesti i pricica, preko hardvera, svih komponenti OSa potanko, virtualizacije (both VirtualBox i Docker). Na kraju knjiga ide u detalje detalja svih popularnih operacijskih sustava. Zadnja poglavlja se cak dotice pravljenje svog os-a. To je covjek koji je dosl cijeli svoj zivot posvetio operacijskim sustavima, i koji je _dosl prozivio_ unix, stare kompjutere, linux (postoji poznata svada njega i Torvaldsa kako se dissaju preko useneta), msdos i sve; mislim da nema bolje osobe za ovo podrucje od njega. I najbolja stvar ikad, puna je poÅ¡alica:\n\n> If cars had improved at this rate [like computers] in the same time period, a Rolls Royce would now cost 10 dollars and get a billion miles per gallon. (Unfortunately, it would probably also have a 200-page manual telling how to open the door.)\n\n\n> The use of redundant information that has no actual value is common in Windows [API].\n\n\n> Having multiple calls that do almost the same thing is a characteristic of Windows\n\n\n> The first general purpose electronic computer, the ENIAC, has 18,000 vacuum tubes and consumed 140,00 watts of power. As a result it ran up a nontrivial electricity bill.\n\n\n> One user may find it acceptable that after 30 seconds of not using the computer it takes 2 seconds for it to respond to a keystroke. Another user may swear a blue streak under the same conditions. In the absence of audio input, the computer cannot tell these users apart.\n\n\n> Putting 1 million unrelated computers in a room is easy to do provided that you have enough money and a sufficiently large room. Spreading 1 million unrelated computers around the world is even easier since it fitnesses the second problem.\n\nObozavam covjeka. Da mi ga jednom uzivo upoznat <3\n\n11/10, a must svima koje to zanima, a topli recommend za sve ostale",
      "votes": {
        "upvoters": [
          "Bisenberg (DonaldPump)",
          "Cereal_Killer (vagab0nd0)",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "JayOhAit",
          "PeroPerica",
          "Red_Baron",
          "Svarog (Veles)",
          "[deleted]",
          "indythedog",
          "jadzia-dax (Jadzia Dax)",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "orange",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141044": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@InCogNiTo124#141008 kul! ne planiram joÅ¡ ovu procitat, ali Ä‡u pocet njegove computer networks kada dovrsim Lakosa, tako da je poprilicno dobro Ä‡ut da momak zna pisat",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142305": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Four Past Midnight](https://www.goodreads.com/book/show/12994576-four-past-midnight)\n\nThe Langoliers - dobro\n\nSecret Window, Secret Garden - iskreno nemam pojma sta sam procitala\n\nThe Library Policeman - ok\n\nThe Sun Dog - ok\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142428": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Richard Bachman (Stephen King) - The Running Man](https://www.goodreads.com/book/show/11607.The_Running_Man)\n\ndobra ideja, provedena ok, nemam nikakvih zamjerki, no istinabog nista revolucionarno\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143180": {
      "poster": "Amali (Amajli)",
      "content": "Mini so-far dump serijala, tko zna kad ce iduci\n\n## [James S.A. Corey - The Expanse](https://en.wikipedia.org/wiki/The_Expanse_%28novel_series%29)\n\nSci-fi\n\nSerijal ima kratke price i glavnu pricu u romanima. Ja citam redom kako je kronoloski u tom svijetu. Brojcek ispred imena predstavlja gdje je u odnosu na romane.\n\n----\n\n### Kratke price\n#### 0.1 Drive\nKao kjut neki backstory za svijet, ne previse bitan. Nis specijalno, al ne prelose za citat. Ja samo volim price pa je meni jako kjut. And sad.\n\n#### 0.3 Churn\nBackstory jednog od glavnih likova, meni bilo full najs iako sam tek krenula sa serijalom pa sam bila malo izgubljena s imenima nekih skupina i political stvarima. Nevertheless, prilicno zanimljivo. Ne znam kako bi mi bilo da sam ovo procitala tek nakon sto sam se upoznala s tim likom kroz glavnu pricu, al i ovak je bilo zanimljivo to imat na umu.\n\n#### 0.5 The Butcher of Anderson Station\nMeni dosta zanimljivo, lijepo iz viewpointa lika koji je dubban butcherom i kako je to zapravo bilo. Spoiler? ||I ovaj lik se pojavi u nekom trenu i to kao dosta bitan.||\n\n#### 1.0 The Last Flight of the Cassandra\nJako kratko, basically pricica nadodana uz TTRPG Expanse. Nis speshl, ja nisam pokopcala kj se mislilo s onim zavrsetkom i na kaj se odnosi, ne znam jel imam prelose pamcenje za subtle hintove u toj sceni il kaj, al dobro.\n\n#### 2.5 Gods of Risk\nZanimljiv mali insight in passing u neka dogadjanja post book 2 iako je fokus na necaku lika iz glavne price. Pa dost zanimljivo po meni iako nista sad mindblowing. Sve ove pricice su onako kjut al nista mindblowing, al fora odmak od glavnog storylinea, uvid u taj svijet. Ovdje se i pojavljuje malo teta koja je lik u knjizi 2.\n\n----\n\n### Romani\n#### 1 The Leviathan Wakes\nIskreno ne mogu reci da imam ikaj protiv ove knjige. Likovi su savrseni nekako, al ne msm kao mary sue stil (jer bih onda imala problema s knjigom), nego bas su specificni i svoji i ljudski i idioti i svasta. Ima opisa svacega, tehnickih stvari ponekad i slicno, dimenzije prostorija ponekad, izgleda prostorija i to sve ako je bitno za worldbuilding, which just goes over my head most of the time, no unatoc takvim stvarima, flow je jako dobro odradjen, razmisljanja likova su vrlo prirodno postavljeno i po meni je radnja ultra dinamicna. Trebalo mi je sto godina da ovo procitam jer me faks previse ometao pa nisam po nekoliko tjedana citala izmedju bingeva, no onda kad bih krenula bih odvalila 10ak poglavlja barem u komadu dok me nesto ne bi omelo da moram radit drugo. Nda. Jako jako engaging, a likovi su stvarno odlicni i stvarno je svaki korak kroz pricu zanimljiv.\n\n#### 2 Caliban's War\nTbh nemam puno za rec. Novi neki likovi, oooodlicni novi likovi, nastavak globalne radnje, dinamika odlicna jos uvijek, kaos jos uvijek, ahhhh sad sam imala vremena pa sam ovo uz kraj prve knjige smazala kroz tjedan dana. Ova mi je cak i bolja od prve, ali ima duplo vise POV-ova pa tako i duplo vise zanimljivih ljudi i njihovih vidjenja zajednickih dogadjaja i njihovih vlastitih dogadjaja uostalom. Presuper.",
      "votes": {
        "upvoters": [
          "Dodo1001",
          "InCogNiTo124",
          "Svarog (Veles)",
          "Zogen",
          "[deleted]",
          "indythedog",
          "jadzia-dax (Jadzia Dax)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143202": {
      "poster": "amnael",
      "content": "[Jon Krakauer - Bez daha : osobni obraÄun s tragedijom na Mt. Everestu](https://www.goodreads.com/book/show/6449029-bez-daha?ac=1&from_search=true&qid=oxP5TrdO16&rank=3) \n\nKao dopisnik za Äasopis _Outside_ Jon Krakauer je sudjelovao u ekspediciji na Mount Everest s ciljem da napiÅ¡e Älanak o komercijalizaciji ekspedicija na Everest. Ekspediciju u kojoj je sudjelovao je vodio Robb Hall koji je veÄ‡ viÅ¡e puta uspjeÅ¡no vodio ljude na vrh svijeta. Plan je bio da se na vrh popnu 10.5. do 14:00, a nakon toga se spuÅ¡taju, bez obzira tko se popeo a tko nije. Tog se dana dogodila najveÄ‡a tragedija na Everestu do tada, ukupno je 12 ljudi iz ove i drugih ekspedicija poginulo u pokuÅ¡aju osvajanja Everesta i uspjeÅ¡nom povratku kuÄ‡i. Manje od 6 mjeseci kasnije, Jon je nakon razgovora sa svim preÅ¾ivjelima i skupljanja informacija napisao ovu knjigu, u kojoj opisuje Å¡to se sve dogaÄ‘alo na Everestu tog dana, i Å¡to je sve prethodilo tom dogaÄ‘aju.",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "Mulder"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143807": {
      "poster": "Gussy (huba buba)",
      "content": "kako funkcionira knjiznica tu u zg? di je glavna i koliko su velike ove kao lokalne? jel ima negdi za potrazit jel ima knjiznica odredenu knjigu?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (MÌµÍ‘Í€ÍÌ©Ì§iÌ¶Ì‚Ì‰ÍÄ‡Ì´Ì¾ÌÌ€ÌoÌ¶Í‚Ì½ÌºÌŸÌ£)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "143841": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@Gussy#143807 uclanis se u jednu, uclanio si se u sve\n\nkatalog: https://katalog.kgz.hr/pages/search.aspx?&currentPage=1&searchById=-1\n\nodes, posudis, vratis na isto mjesto\n\nil 30 il 50 kn je clanarina, nesecam se vise",
      "votes": {
        "upvoters": [
          "Filemon",
          "Kushim",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "148234": {
      "poster": "Amali (Amajli)",
      "content": "[Windsworn - Derek Siddoway](https://www.goodreads.com/en/book/show/35515147-windsworn)\n\nOdsad filtriram/sortiram po [negativnim reviewsima jer je ovo dosta spot on al manje rant-y nego moj irl ispad sinoc pred kraj knjige](https://www.goodreads.com/review/show/2082007128?book_show_action=true&from_review_page=1), sreca pa sam uzela trilogiju prije 2 i pol godine na amazonu kad je bilo free il tipa dollar. Doduse tek sam i pocela citat reviewse nakon sto me nije previse odusevilo prvih par poglavlja pa sam pokusavala naci neku utjehu da ce biti bolje\n\njedva worth the dollar god fuck it, al procitala sam do kraja da mogu mirne duse rec da je piece of uhhh heavily inspired by some popular fiction crap, sreca pa nije nesto dugo jer ionak leti kroz svaki moguci aspekt radnje i razvoja\n\nno dobro, mora se ponekad i procitat losa knjiga da znas kako ne napisati svoju te da mozes vise cijeniti ono sto valja\n\n1 / 5",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "InCogNiTo124",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150414": {
      "poster": "amnael",
      "content": "[Alen BoviÄ‡ - Metastaze](https://www.goodreads.com/book/show/6363550-metastaze)\n\nZakaÅ¡njeli roÄ‘endanski poklon od @Red_Baron i @Bobicki. Knjiga je puno bolja od filma, sa viÅ¡e detalja koji tijekom gledanja filma lako promaknu i boljim opisima. Svi koji su uÅ¾ivali u filmu bi trebali proÄitat knjigu",
      "votes": {
        "upvoters": [
          "Bobicki",
          "Filemon",
          "Kuhar",
          "Red_Baron",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150683": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Zeljko Malnar - Filozofija Republike PeÅ¡Äenice](https://www.goodreads.com/book/show/42140207-filozofija-republike-pe-enice)\n\nmirogojÄek nas svagdasnji\n\n5 / 5\n\n[Joe Hill - NOS4A2](https://www.goodreads.com/book/show/15729539-nos4a2)\n\ndis ain't bad\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Mulder",
          "STAGGER_LEE"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "152319": {
      "poster": "Mulder",
      "content": "**Leopold von Sacher-Masoch - Venus in Furs**\n \nNgl ovo mi je malo ubilo volju za Äitanjem. Å tivo koje bi danas komotno moglo zavrÅ¡it na nekom cuckold redditu, Venus in Furs je zapravo jedna velika hrpetina Å¡porkog fetiÅ¡a mazohizma, ali njen najveÄ‡i grijeh je Å¡to taj mazohizam i uvrnut pogled na odnos muÅ¡karaca i Å¾ena uzima kao neÅ¡to Å¡to je ispravno. Hvala bogu pa je veÄ‡ina svjetonazora iz ove knjige samo samozadovoljavanje pisca koji se irl Å¾eni predao kao rob. Uglavnom, stil pisanja je jako fin, detaljan ali ne naporno nakrcan opisima, knjiga se zapravo jako teÄno Äita i Å¡teta Å¡to sama ideja nije neka normalnija, al eto moÅ¾da bi trebao neku drugu od Sacher-Masocha proÄitat. Jebiga batice, ako ljudi vole da im Å¾ena gazi jaja i biÄuje leÄ‘a super, al to prodavat kao univerzalnu istinu gdje Å¾ene ako nisi smeÄ‡e prema njima budu smeÄ‡e prema tebi je totalno promaÅ¡en balun.\n\n1.5/5\n\n\n\n\n\n**Chris Ott - Unknown Pleasures (33â…“ #9)**\n\nChris Ott mi je najdraÅ¾i glazbeni novinar ikad i jako sam bio nahajpan na Äitanje ovog kad sam skuÅ¾io da piÅ¡e o Unknown Pleasures. Inicijalno tek esej, Ott je proÅ¡irio taj esej u knjigu i to je moÅ¾da i najveÄ‡a mana ovog Äitanja. Knjiga se viÅ¡e bavi kronologijom benda i psihom Iana Curtisa nego Å¡to se bavi albumom, Å¡to je Å¡teta jer Ott tako glatko, pametno i znalaÄki piÅ¡e o zvuku da je pravi guÅ¡t Äitat ga. DoduÅ¡e, za kontekst albuma jest bitno znati pozadinu, dok su posljedice manje viÅ¡e svima znane, ali ako niÅ¡ta, Ott citira poneki film i knjigu za dublje razumijevanje problematike Curtisovog ponaÅ¡anja i povijesti benda. Naravno, Ott ne bi bio Ott da ne napravio neÅ¡to snobovski Å¡aÅ¡avo Å¡to je ovdje dokazao time Å¡to je u postscriptum naveo albume koje je na repeatu sluÅ¡ao dok je pisao knjigu!\n\n3.5/5\n\n**Joe Gross - Fugazi's in on the Kill Taker (33â…“ #129)**\n\nMoÅ¾da i najbolja knjiga u 33 1/3 seriji koju sam do sad proÄitao, unatoÄ dosta Å¡lampavom pisanju. Da, skoro svaka stranica ima neki typo il recikliranu reÄenicu, ali mislim da je to dosta zanemarivo zbog kvalitete sadrÅ¾aja. Osim Å¡to je autor uspio sakupit Älanove benda za intervju kao i neke ljude usko povezane s bendom, on je i pregledao masivnu arhivu live nastupa Fugazija do te mjere da je oÄito da Äovik voli bend viÅ¡e od svega. Ali ipak, pisanje je dosta objektivno i Gross jasno iznosi povijest benda do albuma, povijest pjesama i njihov utjecaj na kasniji stadij benda i njihovih nastupa. Fora je Å¡to je cili dio knjige koji se bavi toÄno albumom podijeljen po pjesmama, pogotovo jer se uz komentare Älanova Fugazija moÅ¾e doÄ‡ do nekih novih saznanja i viÅ¡e cijenit album ko takav. A to je ono Å¡to sam najviÅ¡e izvukao iz Äitanja, puno viÅ¡e cijenim album nakon dubljeg uvida u priÄu oko njega.\n\n4.5/5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "156169": {
      "poster": "[deleted]",
      "content": "**Mali princ - Antoine de Saint-ExupÃ©ry**\n\nKao Å¡to je netko, nekad, negdje sumirao, najbolja djeÄja knjiga za odrasle.\n\n\n5/5\n\nedit: ruÅ¾a mi je totalna komedija, nasmijala me par puta",
      "votes": {
        "upvoters": [
          "Filemon",
          "Koalefant",
          "[deleted]",
          "jadzia-dax (Jadzia Dax)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "156180": {
      "poster": "[deleted]",
      "content": "@FERella#156169 drugi dom",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "157701": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - The Eyes of the Dragon](https://www.goodreads.com/book/show/655707.The_Eyes_of_the_Dragon)\n\nugodna razlika od uobicajenog\n\n5 / 5\n\n[Stephen King - The Waste Lands](https://www.goodreads.com/book/show/29430671-the-waste-lands)\n\na tu negdje kao i prethodni dio serijala\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Kuhar"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "162921": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Mario Puzo - The Sicilian](https://www.goodreads.com/book/show/22026.The_Sicilian)\n\nehm, a kum je jednostavno bio bolji\n\n3.5 / 5\n\n[Mario Puzo - The Last Don](https://www.goodreads.com/book/show/364089.The_Last_Don)\n\nneznam, kao da vise od pola knjige citam great gatsbya, a ne nesto o mafiji\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "162953": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Marko VidojkoviÄ‡ - Äubre](https://www.goodreads.com/book/show/57608522-ubre)\n\n... I sve je tako uobicajeno, kao i uvijek dok se iz divljeg deponija ne krene siriti superkuga, smrtonosna bakterija otporna na antibiotike. Iz beogradskog dubreta u cijeli svijet...\n\niako je autor krenuo pisati ovo prije nego su odredeni dogadaji na svetu poceli, ocigledno je dobrim dijelom inspirirano necime\n\nsetting je dobar, ali glavni lik je too much, moglo je to biti bolje\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "165788": {
      "poster": "amnael",
      "content": "[Alexandre Dumas - Tri muÅ¡ketira](https://www.goodreads.com/book/show/12459730-tri-mu-ketira)\n\nKlasik svjetske knjiÅ¾evnosti. PriÄa je o mladom Gaskonjcu d'Artaganu koji dolazi u Pariz skoro bez para i s nadom da Ä‡e postati muÅ¡ketir. Radnja je smjeÅ¡tena u poÄetku 17. stoljeÄ‡a i prateÄ‡i glavne likove moÅ¾e se dosta saznati o Å¾ivotu u tom dobu kao i neke povijesne Äinjenice koje su se dogodile, a Dumas ih je uklopio u svoj roman. Knjiga je puna spletki, obrata i neoÄekivanih dogaÄ‘aja, radnja ni u jednom trenutku nije dosadna, dosta brzo se odvija i nema nepotrebnih sporednih dogaÄ‘aja ili suviÅ¡nih opisa prostora. Isplati se proÄitat",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "Kushim",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "174892": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Richard Bachman (Stephen King) - The Long Walk](https://www.goodreads.com/book/show/9014.The_Long_Walk)\n\ncini se da je king u pocetnoj fazi bio opsjednut odbrojavanjima\n\niako @jadzia-dax#142428 je bio bolji\n\n3.5 / 5",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "175128": {
      "poster": "koode7",
      "content": "[Cal Newport - So Good They Can't Ignore You](https://www.goodreads.com/book/show/13525945-so-good-they-can-t-ignore-you)\n\nu principu, autorova razmiÅ¡ljanja (inaÄe profesor i doktor raÄunalnih znanosti) o tome Å¡to Äini neki posao kvalitetnim (nastranu Äistog $$$). Kroz knjigu kroz vlastitu potragu za svojom idealnom karijerom daje smjernice Äitatelju u kojem pravcu da je vodi.\n\nNeloÅ¡e, sve u svemu. 3.5/5",
      "votes": {
        "upvoters": [
          "Zogen"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "180216": {
      "poster": "pipi (cicipjorica)",
      "content": "ljudi koji koriste e knjiga chitache: \n\nâ€¢ jel ta e ink fora stvarno manje umara ochi?\n\nâ€¢ jel vam dode ikad da ga zakucate u zid i \n\nipak odete posudit tu knjigu?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Koalefant"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "180772": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@pipi#180216 Umor oÄiju identiÄan knjizi, joÅ¡ si moÅ¾eÅ¡ poveÄat font ako se nisi pomirila s Äinjenicom da slijepiÅ¡ od sjedenja preblizu tim monitorima i sjedenja na ladnom betonu.\n\nZa Äitat je praktiÄnije drÅ¾at dok si u leÅ¾eÄem poloÅ¾aju i sliÄno jer je neÅ¡to poput kindl-a lakÅ¡e od veÄine knjiga a kruÄ‡e.\n\nMeni je jedini problem ako knjiga ima mapu, rijeÄnik ili popis pojmova na koji Ä‡eÅ¡ se Äesto referirat, to je naporno s elektroniÄkom knjigom",
      "votes": {
        "upvoters": [
          "Red_Baron",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "180821": {
      "poster": "pipi (cicipjorica)",
      "content": "@mAcaLukas#180772 narucenoðŸ˜ŽðŸ‘ðŸ»",
      "votes": {
        "upvoters": [
          "Propalica",
          "mAcaLukas (mAca Lukas)",
          "rija"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Koalefant",
          "ZvonkoSisoje",
          "ink",
          "micho (MÌµÍ‘Í€ÍÌ©Ì§iÌ¶Ì‚Ì‰ÍÄ‡Ì´Ì¾ÌÌ€ÌoÌ¶Í‚Ì½ÌºÌŸÌ£)"
        ],
        "wtf": [],
        "tuga": [
          "jadzia-dax (Jadzia Dax)"
        ]
      }
    },
    "181517": {
      "poster": "rija",
      "content": "> @pipi#180216 jel vam dode ikad da ga zakucate u zid i \n\n> ipak odete posudit tu knjigu?\n\nDa, kad se zelim na brzinu vratit nekoliko stranica unazad, a on svaku stranicu ucitava 5 godina. Al ajde za brzinsko prelistavanje, prisjecanje i slicne stvari mozes skinut kindle app na mob/komp pa je i to izvedivo. (Kindle Paperwhite 3, nez kakvi su ovi noviji)",
      "votes": {
        "upvoters": [
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "185111": {
      "poster": "Zogen",
      "content": "[Martha Wells - All Systems Red](https://www.goodreads.com/book/show/32758901-all-systems-red)\n\nSci-fi, prva knjiga u Murderbot serijalu.\n\nKnjiga prati robota (samoproglaÅ¡en Murderbot) koji je dodijeljen znanstvenoj ekspediciji kao zaÅ¡titar na nekom nenaseljenom planetu. No plot se dogodi i naÅ¡ Murderbot mora spasiti svoje klijente bez da im otkrije da viÅ¡e nije pod kontrolom tvrtke koja ga je stvorila.\n\nDosta kratka knjiga sa simpatiÄnim glavnim likom i Äini se kao dobar uvod u serijal (nadam se jer mi je ovo ipak zadnje proÄitana knjiga).\n\n4 / 5",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "KiflaKiflic",
          "Pengwing",
          "[deleted]",
          "ink",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190334": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[A. G. Riddle - The Origin Mistery](https://www.goodreads.com/series/104994-the-origin-mystery)\n\n[The Atlantis Gene](https://www.goodreads.com/book/show/30517378-the-atlantis-gene) - 4 / 5\n\n[The Atlantis Plague](https://www.goodreads.com/book/show/31294120-the-atlantis-plague) - 3.5 / 5\n\n[The Atlantis World](https://www.goodreads.com/book/show/34725589-the-atlantis-world) - 3 / 5\n\npocinje ok, kako vrijeme prolazi sve cudnije\n\n3.5 / 5",
      "votes": {
        "upvoters": [
          "Kuhar",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190595": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Night Shift](https://www.goodreads.com/book/show/10628.Night_Shift)\n\npomalo prosjecno uz tu i tamo koju svjetliju toÄku, _Jerusalem's Lot_, _Trucks_, _Quitters, Inc._ i _The Last Rung on the Ladder_\n\n3.5 / 5",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "192212": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "nemarno bolju temu za ovo, al poÄeo sajam knjiga na velesajmu!https://m.facebook.com/events/3692054404239669/",
      "votes": {
        "upvoters": [
          "Elendur19 (Zagor)",
          "InCogNiTo124",
          "Jale (Äakijale)",
          "Pengwing",
          "Svarog (Veles)",
          "Vasili (Fasili)",
          "Zogen",
          "amnael",
          "ardi (sprut)",
          "mAcaLukas (mAca Lukas)",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "200916": {
      "poster": "InCogNiTo124",
      "content": "Odlucio sam procitat sve tri biblije za podrucje strojnog ucenja, ovdje cu pratit progress\n\n**IML** â€¢ PRML â€¢ ISLR\n\n[Ethem Alpaydin: Introduction to Machine Learning](https://g.co/kgs/e8Q8et)\n\nPrva od tri biblije, Jako opsirno, ima fakat svega. tocno se vidi da je snajdi neke djelove maltene prepiso lol\n\nno, zbog tog sto ima _fakat_ svega dubina obrade nije dovoljno konzistentna. Recimo, decision trees i svm dobe citavo poglavlje di se obraduje apsolutno sve, dok s druga poglavlja vise superficial sa vise nestrukturiranih informacija\n\nsvejedno, super knjiga kao reference. ono, analogni ekvivalent googla, imas problem i odes nades rjesenje skup sa objasnjenjem i mogucim iducim koracima. ne bih rekao da je za ucenje, tho, vise mi se cini da je korisnija ak to vec znas pa trebas podsjetnik\n\n4 / 5",
      "votes": {
        "upvoters": [
          "Pengwing",
          "Red_Baron",
          "Zogen",
          "[deleted]",
          "indythedog",
          "kix7 (Fish99)",
          "mijauexe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "201032": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Ivan IvaÄkoviÄ‡ - Kako smo propevali: Jugoslavija i njena muzika](https://www.goodreads.com/book/show/20342160-kako-smo-propevali---jugoslavija-i-njena-muzika)\n\npljuni i zapjevaj moja jugoslavijo! ako se u knjizi pojavljuju bora Äorbo, mica trofrtaljka, dÅ¾oni Å¡tuliÄ‡, lepa brena, bijelo dugme i zorica brunclik, nema se tu sta razmisljati, podrazumeva se da valja\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Mulder",
          "ZvonkoSisoje",
          "djeno",
          "mAcaLukas (mAca Lukas)",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124",
          "Kuhar",
          "ZvonkoSisoje"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "205333": {
      "poster": "Zogen",
      "content": "### [Terry Pratchett - Discworld](https://en.wikipedia.org/wiki/Discworld)\n\nFantasy/komedija\n\nDiscworld je serijal od 41 knjige gdje se radnja odvija na ravnom planetu kojeg nose na leÄ‘ima Äetiri slona koji zauzvrat stoje na leÄ‘ima divovske morske kornjaÄe koja plovi u svemiru.\n\nIako su sve knjige stand alone u njihovom kronoloÅ¡kom slijedu mjesta radnje i likovi se izmjenjuju iz knjige u knjigu no neki likovi se pojavljuju u viÅ¡e knjiga pa se storyline za specifiÄne likove moÅ¾e gledati [preporuÄenim redosljedom.](https://www.discworldemporium.com/content/6-discworld-reading-order)\n\nJa sam za sad proÄitao pola knjiga (precinije 3.5 njih) koje prate gradsku straÅ¾u jednog grada.\n### The city watch storyline (7. knjiga)\n[Terry Pratchet - Guards! Guards!](https://www.goodreads.com/book/show/64216.Guards_Guards_)\n\nPrva knjiga u kojoj upoznajemo noÄ‡nu straÅ¾u grada Ankh-Morpork. Ta nekoÄ‡ ugledna profesija sada je gotovo postala redudanta jer su sada sva poÅ¡tena i nepoÅ¡tena zanimanja regulirana od strane svojih zasebnih cehova. Pa tako umjesto da straÅ¾a sprjeÄava kraÄ‘e ona jedino moÅ¾e provjeriti da li je ta transakcija obavljena uz adekvatne dokumente. Za svaki sluÄaj da je ovo imalo previÅ¡e smisla grad pada pod opsadu zmaja plemenitog podrijetla i naÅ¡i Äuvari reda i mira su primoreni stupiti u akciju.\n\nSve u svemu duhoviti i obeÄ‡avajuÄ‡i uvod u straÅ¾u kao likove, a i sami grad Ankh-Morpork sa dosta absurdnom, Å¡armantnom i kaotiÄnom upravom.\n\n4.5 / 5\n\n[Terry Pratchet - Men at Arms](https://www.goodreads.com/book/show/400354.Men_at_Arms)\n\nKoliko god Äudan bio taj svijet na ravnoj ploÄi pa time i grad u kojem se radnja odvija ne moÅ¾e se reÄ‡i da nije inkluzivan. Pa tako i naÅ¡a straÅ¾a mora voditi primjerom i dobiva nova pojaÄanja s par pripadnika lokalnih manjina. OÄiti druÅ¡tveni komentari su oÄiti, ali su barem meni osobno najduhovitiji dijelovi njegovih knjiga pa tako i ove. \n\n4.5 / 5\n\n[Terry Pratchet - Feet of Clay](https://www.goodreads.com/book/show/34527.Feet_of_Clay)\n\nDo sada meni najdraÅ¾a knjiga u ovom serijalu. U ovoj knjizi naÅ¡a druÅ¾ina istraÅ¾uje lanac ubojstava. Likovi su i prije samog poÄetka knjige i viÅ¡e nego razraÄ‘eni pa najveÄ‡i trud ide u izgradnju i proÅ¡irenje svijeta koji sa sobom donose moralna pitanja o do sada ne spomenutim graÄ‘anima ovog bujnog grada.\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Fast-and-Fourierous",
          "Hrvoje (Hrvoje45)",
          "Pengwing",
          "amnael",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "216120": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Different Seasons](https://www.goodreads.com/book/show/39662.Different_Seasons)\n\nRita Hayworth and Shawshank Redemption mi je bila super, ali sve ostalo nah\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "216196": {
      "poster": "Kuhar",
      "content": "@jadzia-dax#216120 \n\ntesko je bit bar ko Shawnshank...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "216617": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Max Bunker - U ime mafije](https://www.goodreads.com/book/show/57829771-u-ime-mafije)\n\nostavlja pomalo deus ex machina dojam, al sta sad, kratko i zabavno\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217632": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Zeljko Malnar i Borna Bebek - U potrazi za Staklenim Gradom](https://www.goodreads.com/book/show/6449028-u-potrazi-za-staklenim-gradom)\n\nwell za pocetak ovo je putopis, tako da nocno morasi bolje da potraze svoj fix u filozofiji republike pescenice @jadzia-dax#150683\n\nto bijase receno, nemam prigovora\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Kuhar",
          "STAGGER_LEE",
          "ZvonkoSisoje",
          "djeno"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218263": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Richard Bachman (Stephen King) - Thinner](https://www.goodreads.com/book/show/10605.Thinner)\n\nnastavljamo niz odbrojavanja @jadzia-dax#174892 s jos jednime\n\nu jednom trenu pred kraj me potpuno derailalo, kao da sam pocela citati neku drugu knjigu\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218549": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Joe Hill - Heart-Shaped Box](https://www.goodreads.com/book/show/153025.Heart_Shaped_Box)\n\nugodno od pocetka do kraja, nema dosadnih dijelova, sve se razume\n\n5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218617": {
      "poster": "ivicato",
      "content": "Ima li netko moÅ¾da tko bi htio preuzeti Älanstvo u Svijetu knjige, dajem besplatno? Kupio sam Kindle jer mi bolje odgovara pa mi viÅ¡e fiziÄke knjige i nisu potrebne...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "jadzia-dax (Jadzia Dax)"
        ]
      }
    },
    "218845": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Graham McCann - Only Fools and Horses](https://www.goodreads.com/book/show/13043548-only-fools-and-horses)\n\nugodna retrospektiva i pregled serije\n\n5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "219231": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "![](assets/2021-07-06/00002.png)",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "JayOhAit",
          "Red_Baron",
          "Zogen",
          "[deleted]",
          "ink",
          "johndoe12 (enaiks)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "AVRFreak",
          "Amali (Amajli)",
          "Amon",
          "Elendur19 (Zagor)",
          "Emma63194",
          "Filemon",
          "InCogNiTo124",
          "JayOhAit",
          "Mars (mars_)",
          "Pengwing",
          "Red_Baron",
          "Svarog (Veles)",
          "Zogen",
          "ZvonkoSisoje",
          "ink",
          "lul"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "221883": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Joe Hill - Strange Weather](https://www.goodreads.com/book/show/39348001-strange-weather)\n\nsve zajedno nekako dosadnjikavo, mjestimicno prelazi u not great not terrible teritorij ali ne zadugo\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222158": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[John Lakos - Large-Scale C++ Volume I: Process and Architecture](https://www.goodreads.com/book/show/49122352-large-scale-c-volume-i)\n\nda! bloombergov codebase je medu najboljima koje sam vidjela, razlog je upravo development i dizajn opisan ovdje, naravno ne slazem se s nekim stvarima, ali treba uzeti kontekst u kojem se nalazi kod\n\niako je potpuni behemoth, definitivna preporuka za c++ entuzijaste, bilo bi zanimljivo vidjeti language neutral izdanje ovoga buduci da velik dio ideja prelazi zapravo jezik te je opste primjenjivo\n\nprosli puta me netko pitao koliko mi vremena treba za ovako nesto, well trebalo mi je 6 mjeseci, ali imala sam poprilicno dugu rupu neaktivnosti, tako da realnog citanja vjerojatno 3 mjeseca\n\nhttps://i.ibb.co/kJxkP2B/image.png\n\nne preporucam pokusati procitati vise od 30 stranica odjednom\n\n5 / 5, cekam 2 i 3 dio!!1",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "STAGGER_LEE",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223491": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Joe Hill - Full Throttle](https://www.goodreads.com/book/show/43801817-full-throttle)\n\nnot great, not terrible\n\n3.6 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223502": {
      "poster": "nnn (dinoo)",
      "content": "@jadzia-dax#222158 Kakav je to tracker",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223504": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@nnn#223502 https://www.goodreads.com ofc",
      "votes": {
        "upvoters": [
          "Filemon",
          "nnn (dinoo)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "224192": {
      "poster": "Mulder",
      "content": "**Flavio Rigonat - Partibrejkers: srce kuca tu je**\n\nOvo je viÅ¡e booklet sa lyricsima Brejkersa i ponekim intervjuom iz novina, sve skupa ukomponirano sa Canetovim poetiÄkim opisima nekih situacija i osobnih razmiÅ¡ljanja. Nije loÅ¡e, ali nije ni blizu nekom opÅ¡irnijem pregledu karijere benda ili nedobog biografiji. Bilo bi fora ovo imat u fiziÄkon obliku tho\n\n3./5\n\n**Darko Å eparoviÄ‡ - PristaniÅ¡te**\n\nÄŒitanje koje mi se osobno jako oduÅ¾ilo iako je knjiga izuzetno pitka i zanimljiva, a samim tim morat Ä‡u rereadat prije ili kasnije jer ima niz detaljÄiÄ‡a i misli koje nisam dovoljno dobro procesirao. Ukratko, ovo je poezija u prozi koja prati neimenovanog (anti)junaka koji, nakon Å¡to ga djevojka ostavi, krene od drvenih greda u svojoj kuÄ‡i graditi brod. Cijeli roman je fiziÄki ograniÄen na pristaniÅ¡te, dio rive i Å¾eljezariju, ali kako se mijenja interijer kuÄ‡e, kroz cilu priÄu je zapravo i kuÄ‡a jedno konstantno mjenjajuÄ‡e mjesto radnje. Glavni lik razmiÅ¡lja u detaljima: od postupka otkljuÄavanja vrata (okretanje kljuÄa, mehanizam koji okreÄ‡e zub, otvaranje vrata) do nez, postavljanja spuÅ¾ve na pod prostorije,,, ali baÅ¡ to detaljiziranje banalnih svakodnevnih stvari ima Å¡arm; detaljiziranje i gradnja broda su glavnom liku jedini naÄini za copeat se s odlaskom Å¾enske. A i ono, kad pogledaÅ¡, cili koncept gradnje broda od drvenih dasaka je totalno bizaran, ali opet toliko metaforiÄan da se moÅ¾e protumaÄiti na viÅ¡e naÄina. Nez, ovome baÅ¡ treba dat priliku (moja keva odustala nakon 40 stranica) jer iako nekad djeluje mundane i izgubljeno, Å¡to se viÅ¡e knjiga pribliÅ¾ava kraju stvari imaju smisla i nijedna stranica nije suviÅ¡na. Kraj je pak priÄa za sebe, ne sjeÄ‡am se kad sam se zadnji put najeÅ¾io i skoro rasplakao od jebene knjige, ali tako je nekako neoÄekivano udarilo i ono, nez, wow jebate. Definitivno masterpis, a sad, kolko Ä‡e ljudi to proÄitat, to je tema za neki drugi put\n\n5/5",
      "votes": {
        "upvoters": [
          "Zogen"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "228150": {
      "poster": "ZvonkoSisoje",
      "content": "**Strugatsky Arkady i Boris: GolaÄ‡ na urvini**\n\nFrendov poklon za rodjendan, cekalo ljeto da napokon pocnem citati. Nije moja prva njihova knjiga (procitao vec roadside picnic, doomed city i jos nekoliko kratkih prica).\n\nKnjiga je klasican Strugatsky, pratimo izgubljenog glavnog lika kako se pokusava probiti kroz nerazumljiv i nelogican svijet birokracije nastao oko fantasticne i ljudima nerazumljive pojave. Arkady i Boris kazu da je ovo njihov magnum opus, definitivno vidim zasto to misle jer su nekako uspjeli sav taj absurd podici na novu razinu. Meni kao ljubitelju ruskog  SF-a knjiga je top, al se nece svidjeti svakome\n\n**5/5**\n\n**Strugatsky Arkady i Boris: TeÅ¡ko je biti bog**\n\nJedna od njihovih najpopularnijih knjiga, odmicemo se malo od njihovih klasicnih tema i dolazimo u srednji vijek(sa SF twistom ofc). Knjiga je solidna, jedino se ponekad moze malo pogubiti u imenima svih tih blagorodnih donova\n\n**4.5/5**\n\n**Strugatsky Arkady i Boris: Hotel kod poginulog alpiniste**\n\nJos jedna malo drugacija knjiga, pocinje kao opis zasluzenog odmora policijskog cinovnika a zavrsava kao krimic sa SF twistom na kraju. \n\n**4.5/5**",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "228151": {
      "poster": "STAGGER_LEE",
      "content": "@ZvonkoSisoje#228150 \n\nprosli mjesec sam slucajno na hrt3 naletio na ovaj poljski sf film \n\nhttps://m.imdb.com/title/tt0088083/",
      "votes": {
        "upvoters": [
          "Filemon",
          "ZvonkoSisoje"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "228198": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Firestarter](https://www.goodreads.com/book/show/233667.Firestarter)\n\npocetak mi je bio jako dobar, al onda sam napravila pauzu u citanju i nakon toga se nikako nisam uspjela vratiti u potpunosti u radnju\n\nno i dalje cini mi se da je to moj problem a ne problem knjige\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230688": {
      "poster": "rija",
      "content": "Nisam nasao neku generalnu temu za (e)knjige i kindle pa postam tu.\n\nVec neko vrijeme koristim ereaderiq za trackat snizenja i nisam imao nekih problema, ali u zadnje vrijeme kad god mi ereader dojavi snizenje, ja odem na Amazon i vidim ebook po punoj cijeni. \n\nSada sam probao promjenit region na germany (amazon.de), pa sam otisao na amazon.com i vidio da knjiga tamo kosta 5$ (al ju ne mogu kupit jer sam u drugoj regiji ). Onda sam prebacio region na croatia (amazon.com) i odjednom ista knjiga na amazon.com kosta 13$. Jel se moze to cudo nekako zavarat jer je ocito amazon.com razbijen na neke regije i saleovi nisu svima dostupni vise?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230704": {
      "poster": "rija",
      "content": "@rija#230688 Da odgovorim sam sebi, fake US adresa [vamo](https://www.amazon.com/hz/mycd/myx#/home/settings/payment) i SetupVPN besplatan chrome plugin, bum cijena pala sa $16 na $5. Valjda mi nece zalockat account ðŸ™ƒ",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230705": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@rija#230688 brt ja samo opalim erlajn mode, calibre libraray manager i libgen \n\ntjt",
      "votes": {
        "upvoters": [
          "Filemon",
          "Gussy (huba buba)",
          "InCogNiTo124",
          "Koalefant",
          "mAcaLukas (mAca Lukas)",
          "nnn (dinoo)",
          "pipi (cicipjorica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230715": {
      "poster": "rija",
      "content": "@MarokMarsci#230705 S tim sam krenuo, ali formatiranje mi je cesto bilo puno losije nego oriÄ‘iÄ‘i sa amazona. Plus pristup sa vise deviceva, amazon integracija.. nije mi problem dat nekoliko dolara za to",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230742": {
      "poster": "pipi (cicipjorica)",
      "content": "@rija#230715 balkandownload.\n\nima i chirilicuðŸ™ðŸ»",
      "votes": {
        "upvoters": [
          "Filemon",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230752": {
      "poster": "rija",
      "content": "> @pipi#230742 ima i chirilicuðŸ™ðŸ»\n\nÅ½elim Äitat, a ne vjeÅ¾bat kriptografiju â˜º\n\n_Da ne offtopiÄarim samo:_\n\n**Lemmy Kilmister, Janiss Garza - White Line Fever** \n\nDosta zabavno Å¡tivo, Lemmy je manijak i naravno da ima dobrih priÄa, fora za proÄitat i ako niste neki fanovi njega i Motorheada.\n\n5/5\n\n**Feynman - Surely You're Joking, Mr. Feynman!**\n\nOva mi je jos draza, nobelovac koji priprema predavanja u striptiz klubu i u nuÅ¾di prespava u grmu ispred kampusa, u slobodno vrijeme trolla ljude i nauci svaki skill koji mu se ucini zanimljiv.\n\n5/5",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "InCogNiTo124",
          "Zogen",
          "ivicato",
          "jadzia-dax (Jadzia Dax)",
          "maPre",
          "pipi (cicipjorica)",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "pipi (cicipjorica)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "231816": {
      "poster": "Mulder",
      "content": "**Miroslav KrleÅ¾a - Gospoda Glembajevi**\n\nUf, ovo je takav gigant za proÄitat, promislit, razumit. Definitivno knjiga koja je prevelik zalogaj za veÄ‡inu klinaca u srednjoj, jebiga, ekipa prepiÅ¡e kratku radnju i par natuknica s interneta i to je kao okej i to su kao proÄitali. IroniÄno je zapravo Äa moÅ¾da ni ja sad nisam toliko odrastao da bi se skroz mogao poistovjetit s ovim, al zadnjih lito dan kinda imam neke dogaÄ‘aje koji se mogu preslikat iz Glembajevih i ovo je definitvno knjiga koju treba Äitat kad se dostigne neka zrelost i proÄ‘u neke situacije.\n\nNo, da ne kenjam previÅ¡e u prazno, ovo je stvarno jebena drama. Cili taj filozofsko-naturalistiÄki Ä‘ir je neÅ¡to Äa meni totalno paÅ¡e, od motiva grmljavine preko razgovora koji su sami sebi svrha pa do sitnih detalja, poput Leoneve muÄnine u 3. Äinu koja me toliko fino evocirala na Therese Raquin (iako je tamo muÄnina post-nemoralnog Äina veÄ‡a), KrleÅ¾a jako spretno barata i opisima i dijalozima, tvori jedan tako Å¾ivi ambijent i tako zanimljive likove. Pejsing je mrvicu promaÅ¡en, poÄetak prvog Äina je stvarno teÅ¾ak za probavit, veÄ‡inom jer Å¡jor Krki roka pun kurac maÄ‘arskog i Å¡vapskog u tekst i pogled leluja gori doli dok pohvataÅ¡ sve. TreÄ‡i Äin isto nekako brzo zavrÅ¡i i kao da malo ostaje zbrzan i nedoreÄen, al aj, ostatak drame stvarno jako fino teÄe.\n\nUglavnom, ovo je ekstra, mogob i proÄitat ostale dvije knjige u trilogiji, ko ovo ne proÄita -> pizda\n\n4.5/5\n\n\n\n**Nora Verde - Moja dota**\n\nPrimarno posveta djetinjstvu, naivnosti, bezbriÅ¾nosti, ali i odrastanju, formiranju stava i svijesti svita oko sebe, Moja dota je prekrasna posveta otoÄkom Å¾ivotu i nekom davnom mentalitetu, ali najbolje od svega, svaki Äitatelj moÅ¾e pronaÄ‡i poveznice izmeÄ‘u zgoda iz knjige i nekih vlastitih Å¡torija vezanih uz none i noniÄ‡e. Jako pitko, lako Äitljivo djelo, knjiga leluja izmeÄ‘u ÄakavÅ¡tine i knjiÅ¾evnog hrvatskog, istovremeno uspijevajuÄ‡i ispriÄati priÄu, ali i zaÄiniti izraz Å¡mekom otoÄkog govora. MoÅ¾da jedina zamjerka je na trenutke razbacana kronologija zbivanja te par nedovrÅ¡enih misli i sporednih priÄica, ali u globalu, ovo je definitivno jedna od onih knjiga koje Å¡iroka masa more zavolit i s guÅ¡tom proÄitat.\n\n4.5/5",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "233072": {
      "poster": "djeno",
      "content": "[Vladimir Nabokov - Lolita\n\n](https://www.goodreads.com/book/show/7604.Lolita)\n\nZa vas mlake -- ova je priÄa ima pedofilije i silovanja ako vas to uznemiruje skippajte. Klasik knjiga i preprouÄio bi svima da proÄitate. TragiÄna tema koja je napisana kroz jako lijepe rijeÄi. Nekakv konflikt kao kad pokuÅ¡ate nekom objasniti da ste bili na jako lijepoj sahrani. Kroz priÄu proÄ‘e se kroz zanimljivu tematiku kao Å¡to je: kako osoba poÄne imati pedofilne tendencije, kako se ljudi koji su pedofili osjeÄ‡aju, tko inicira takav odnos itd. Glavni lik osim Lolite koja je curica na kojoj se temelji radnja ove knjige, priÄa i o odnosu sa drugim curicama i kako se oni razlikuju. Svakako uÅ¾asno zanimljiva, lijepo napisana ali tragiÄna priÄa. \n\nPreporuÄio bi Äitati je na engleskom jer je Nabokov bio ruski doseljenik u Americi te je knjiga izvorno na engleskom. Knjiga ima dosta kurÄenje francuskog i puno francuskog teksta ubaÄenog u opis i razgovor likova tako da ako Å¾elite to prevoditi da dobijete puni doÅ¾viljaj izgubit Ä‡ete dosta vremena. Ako ima neka verzija knjiga koja ima napisane automatske pijevode topla preporuka. BaÅ¡ zbog tog razloga nije Äista petica.\n  \n\n4.5 / 5\n\n[Bret Easton Ellis -  American Psycho ](https://www.goodreads.com/book/show/28676.American_Psycho)\n\nPo knjzi je reÅ¾isirani istoimeni kultni klasik. Ako ne znate o Äemu se radi prvo pogledajte film, a onda proÄitajte knjigu. Ukratko radnja prati Patricka Batemana yuppieja iz New Yorka koji radi na Wall Street, ali ima  tendecije za drogiranje, ubojstva itd. BIJELI HETEROSEKSUALNI MUÅ KARAC BI REKAO --- BASED I JA ISTO.  Za ovaj sluÄaj reÄ‡i Ä‡u da je film > knjiga. Ako Å¾elite se dodatno upustiti u radnju Äitati viÅ¡e o unutarnjim monolozima o glazbi, odjeÄ‡i i opÄ‡enito malo dodatne radnje proÄitajte knjigu. Knjiga zna biti gory i imaju jako detaljne scene seksa pa ak vam to smeta jebiga. \n\nU knjizi se jako previÅ¡e detaljno opisuje kultura skupe luksuzne odjeÄ‡e Å¡to je meni osobno bilo dosta zamorno, ali isto tako opisuje se na viÅ¡e stranica bendovi i miÅ¡ljenja o njihovim albumima Å¡to mi se svidjelo. Svakom svoje. \n\n3.5-4 / 5\n\nimam joÅ¡ tri knjigice reviewat Å¡to sam proÄito na moru al neda mi se pisat sve sad malo po malo",
      "votes": {
        "upvoters": [
          "Mulder",
          "[deleted]",
          "amnael",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "238123": {
      "poster": "Mulder",
      "content": "**Austin Kleon - Steal Like an Artist: 10 Things Nobody Told You About Being Creative**\n\nNa trenutke previÅ¡e reddit za moj ukus, al u suÅ¡tini sasvim solidna self-help knjiga koja se bavi temama utjecaja umjetnosti, uspostavljanja vlastite rutine i generalno je dosta sladunjav guide za boljim umjetniÄkim izrazom nas samih. Ima i neke tumblresque slikice i ono, malo je povrÅ¡no sve skupa al fora nonetheless.\n\n3./5\n\n\n**Robert A. Heinlein - All You Zombies**\n\nAaaaa stari moj koja vrh kratka priÄa, u samo 19 stranica je stalo toliko paradoksa, obrata, mindfuckova, definitivno neÅ¡to Äa bi svakom odgovaralo. Heinlein je jebeni genijalac\n\n5/5\n\n**Ante Zlatko Stolica - Blizina svega**\n\nKolekcija uglavnom crtica, poneke pripovjetke i pjesme, sve skupa tematski povezano kroz nasumiÄne dogaÄ‘aje iz svakodnevnog Å¾ivota i uspomene na djetinjstvo. Jako mi paÅ¡e taj rafal kratkih misli i doskoÄica, kao da Äitam tviter feed u tiskanom obliku, a i autor ima ful luckast um pun dobrih Äudnih pitanja. Fora knjigica.\n\n4./5\n\n**Ben Sisario - The Pixies' Doolittle (33â…“ #31)**\n\n\nSolidno Å¡tivo o jednom od najluÄ‘ih indie pop rock albuma, knjiga jako kompaktno prolazi kroz Pixiese prije i pokle ove ploÄe, a opet uspije dovoljno vrimena posvetiti ploÄi samoj i pismama na njoj i snimanju i touranju itd itd. VeÄ‡inom je sugovornik Black, muÅ¡ki ostatak benda je prisutan u pokojem pasusu, a madam Deal nije tila priÄat za ovu knjigu. Å teta, jer Äujemo samo jednu stranu priÄe i to vague o sukobu koji je oznaÄio i raspad Pixiesa, a naravno da je uvijek zanimljivo Äut takve saucy traÄeve. No, nebitno, sve Äa je ovdje napisano je manje viÅ¡e okej (autor doduÅ¡e malo izgubi kompas tijekom song-by-song dijela knjige di previÅ¡e onanira u superlativima) i daje novo svijetlo na sve Äa ovaj album predstavlja i na sve Äa ga Äini.\n\n4./5",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "248514": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "nakon mog poduzeg hiatusa iz ove teme\n\n[Hrvoje Hitrec - Smogovci](https://www.goodreads.com/book/show/58174569-smogovci)\n\novdje se nema sta rec\n\n5 / 5\n\n[Hrvoje Hitrec - Smogovci i straÅ¡ni Bongo](https://www.goodreads.com/book/show/40198888-smogovci-i-stra-ni-bongo)\n\nsmrt starog Papirusa i smrt Cucka pogadaju jednako i u pisanom i u video obliku\n\n5 / 5\n\n[Hrvoje Hitrec - Zbogom, Smogovci](https://www.goodreads.com/book/show/15994760-zbogom-smogovci)\n\ntakoder pogada na par mjesta i bila bi dobar zavrsetak serijala\n\n5 / 5\n\n[Hrvoje Hitrec - Smogovci i biÄ‡e iz svemira](https://www.goodreads.com/book/show/35095705-smogovci-i-bi-e-iz-svemira)\n\novdje prelazimo u upitne djelove, tema rusenja naselka je ok, ali druga tema s Kronom je too much, medutim jasno je da ostavlja prostor za nastavak\n\n4 / 5\n\n[Hrvoje Hitrec  - Smogovci u ratu](https://www.goodreads.com/book/show/5259837-smogovci-u-ratu)\n\nwell, jasno je u kojem kontekstu vremena je nastao, ovo mi je ujedno i najlosiji od svih djelova serijala iako ima par memorable trenutaka\n> \\- Guzda, murti smo murali ostati u buksi - reÄe KumpiÄ‡.\n\n\\- Tu vuni bu bilo ruta.\n\n\\- Pa kaj onda? I rat je jedan veliki Ä‘ob, razmeÅ¡... Posel!\n\n3.5 / 5\n\nsve zajedno 4.5 / 5, osobno bih preferirala dio sadrzaja 4. knjige prebaceno prije 3. te eventualno dopunjene s necime\n\nno sta je tu je, mozda upravo dio cari serijala proizlazi iz toga da je pratila aktualne dogadaje, pa samim time i vremenom u kojem se nalazi je pratila propast drzave kao takve",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "MarokMarsci (Collapse Enjoyer)",
          "STAGGER_LEE",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA DÅ½IN)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "254368": {
      "poster": "Jale (Äakijale)",
      "content": "> @\"G-bear\"#p254234 Listu sam si spremio, pa je evo i ovdje za one koji zele znati vise:\n\n Ako nekog zanima, u nekoj obavijesti je BaÅ¾ant preporuÄio dvije knjige Nicholasa Carra, \"Plitko\" i \"Stakleni kavez\". \n\nProÄitao sam prvu, evo kratki osvrt. \n\n[Nicholas Carr - Plitko](https://www.goodreads.com/book/show/9778945-the-shallows?ac=1&from_search=true&qid=Kg5PxXEeZp&rank=1)\n\nDosta zanimljiva knjiga kojoj je u fokusu utjecaj koriÅ¡tenje interneta na ljudski mozak, ljudske navike i druÅ¡tvo opÄ‡enito. \n\nU knjizi se dodiruje raznih naÄina kako je tehnologija kroz povijest utjecala na Äovjeka, od crkvenih zvona koja su oznaÄavala kraj radnog dana, izuma sata, tiskarskog stroja, pisaÄ‡e maÅ¡ine i na kraju raÄunala i interneta. \n\nNa sve gore navedeno se gleda s jednog vrlo zanimljivog stajaliÅ¡ta, s kojeg, vjerujem, vecina ljudi nikad nije razmiÅ¡ljala o tim stvarima (barem ja nisam). Daje pregled i raznih istraÅ¾ivanja koje prouÄavaju ljudski mozak, te povezuje to s glavnom temom knjige. \n\nNapisana je u 2010., danas definitivno internet i viÅ¡e utjeÄe na nas nego tada, zanimljivo je bilo Äitati opaÅ¾anja veÄ‡ tada.\n\nAko vas zanima tema, definitivno preporuÄam. \n\nMoja je zamjerka jedino Å¡to pri kraju knjiga postane malo repetitivna. \n\n4.5/5",
      "votes": {
        "upvoters": [
          "G-bear",
          "bodilyfluids (Dragi prijatelj strojnog uÄenja)",
          "cloudies"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255028": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Ako ima ovdje ljudi koji su uÅ¾ivali u Dark Tower serijalu i ostali razoÄarani filmom kao i ostatak populacije, preporuÄam posluÅ¡ati epizodu podcasta [The Kingcast EP4](https://podcasts.google.com/feed/aHR0cHM6Ly9hdWRpb2Jvb20uY29tL2NoYW5uZWxzLzUwMjU0NjQucnNz/episode/dGFnOmF1ZGlvYm9vbS5jb20sMjAyMC0wNS0yNjovcG9zdHMvNzU5MTk0MA?sa=X&ved=0CAUQkfYCahcKEwiQmODIwaD0AhUAAAAAHQAAAAAQEw) s Glen Mazzara-om koji je radio na TV adaptaciji za Amazon. \n\nSerija je na Å¾alost ukinuta u korist Tolkien i Wheel of Time serijala, ali isplati se posluÅ¡ati kako objaÅ¡njava svoju viziju, planove i koncepte za nesuÄ‘eno remekdjelo. Ljubav s kojom objaÅ¡njava svaki detalj, easter egg-ovi koje je planirao Äuvati do Å¡este sezone, redoslijed kojim je namjeravao ispriÄati priÄu,... jednostavno Äovjek koji je kroz razvoj osnovnog koncepta za pilot epizodu postao veliki fan i tri godine svog Å¾ivota posvetio tome da razradi razvoj likova. Da je serija odobrena, mislim da bi imala sliÄan odziv kao i Breaking Bad, ako ne i jaÄi.\n\nIskreno vjerujem da je Äovjek uÅ¡ao u to s tako dobrim mindset-om da je imalo potencijala postati meÄ‘u najboljim book-to-screen adaptacijama, Äak bilje i od LotR-a, ako niÅ¡ta drugo, onda zbog jednog jebenog pravila\n>If it's canon in the books, it's going in the show unaltered.\n\n(kaÅ¾e canon in the books jer postoji nekolicina popratnih stripova)\n\nSvakako vrijedi posluÅ¡ati, a tko nije Äitao, svakako vrijedi proÄitati. Dajte si makar prvo poglavlje da vas primi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255694": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King, Peter Straub - The Talisman](https://www.goodreads.com/book/show/59219.The_Talisman)\n\nnah, jednostavno nije za mene, iako je vrlo lako citljiva i razumljiva, nisam odusevljena\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "260733": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[DuÅ¡an VesiÄ‡ - Magi - Kao da je bila nekad](https://www.goodreads.com/book/show/39404675-magi---kao-da-je-bila-nekad)\n\njebem ti, al je ovo bila dobro napisana biografija, nazalost tuzna\n\n5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "263807": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Richard Bachman (Stephen King) - Roadwork](https://www.goodreads.com/book/show/10577.Roadwork)\n\nrollercoaster zanimljivog i cudnog\n\n3.5 / 5",
      "votes": {
        "upvoters": [
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266529": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - The Dark Half](https://www.goodreads.com/book/show/11597.The_Dark_Half)\n\nah eh, nekako monotono i predvidljivo\n\n3.5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266628": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Aldous Huxley - Brave New World](https://www.goodreads.com/book/show/5129.Brave_New_World)\n\nnekako mi je zao da mi je trebalo toliko vremena da procitam ovo, no i dalje preferiram onu drugu knjigu s kojom se ova usporeduje\n\n4.5 / 5",
      "votes": {
        "upvoters": [
          "DariolaVremenskiPutnik",
          "Filemon",
          "General_Kenobi (Aborteur)",
          "Jale (Äakijale)",
          "ZvonkoSisoje"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266633": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@\"Jadzia Dax\"#p266628 Mi od Zamjatina ili 1984?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266640": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@\"prvi do boga\"#p266633 1984",
      "votes": {
        "upvoters": [
          "DariolaVremenskiPutnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266653": {
      "poster": "DariolaVremenskiPutnik",
      "content": "[Liu Cixin - The Three-Body Problem](https://www.goodreads.com/book/show/20518872-the-three-body-problem)\n\nNevjerojatno kvalitetna sci-fi trilogija. Nisam joÅ¡ puno Äitao sci-fi pa ne mogu previÅ¡e usporeÄ‘ivati, ali u ovdje je primjerice jako velik naglasak na science dio, gdje autor gotovo svaku futuristiÄku tehnologiju bazira na aktualnim teorijama u fizici (ili su barem bile aktualne u vrijeme pisanja, 2006-2010). Likovi i worldbuilding su odliÄno izvedeni, dok autor pojaÅ¡nja okolinu likova uopÄ‡e nisam preispitivao ima li to smisla, a i priÄa je stvarno zanimljiva. Svaka knjiga ima nekog svog glavnog lika, ali je to sve usko povezano. Ne bih htio niÅ¡ta detaljnije o knjigama, ali se stvarno isplati pruÅ¾iti im priliku, pogotovo ako volite sci-fi.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Jale (Äakijale)",
          "johndoe12 (enaiks)",
          "laranotreallycroft"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266715": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Marquis de Sade - Justine, or The Misfortunes of Virtue](https://www.goodreads.com/book/show/796267.Justine_or_The_Misfortunes_of_Virtue)\n\njedan reread nakon 8 godina, zadrzavam svoju originalnu ocjenu\n\n5 / 5",
      "votes": {
        "upvoters": [
          "Mulder"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266717": {
      "poster": "login",
      "content": "@\"Jadzia Dax\"#p266715 ozbiljno pitanje, kako uspjevas tolko puno knjiga progutat u tako kratko vrijeme? haha",
      "votes": {
        "upvoters": [
          "bodilyfluids (Dragi prijatelj strojnog uÄenja)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266721": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@\"login\"#p266717 godisnji ðŸ˜ dorucak, citanje, star trek, citanje, rucak, star trek, citanje, star trek ...\n\na rjesim po 100tinjak stranica u jednoj rundi",
      "votes": {
        "upvoters": [
          "ink",
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "266737": {
      "poster": "Kuhar",
      "content": "@\"Jadzia Dax\"#p266721 \n\njel citas prave knjige ili tipa preko kindla?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "ink"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "266738": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@\"Kuhar\"#p266737 samo fizikalija",
      "votes": {
        "upvoters": [
          "Kuhar",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "267150": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Mario Puzo - The Dark Arena](https://www.goodreads.com/book/show/22027.The_Dark_Arena)\n\nne znam, nekako me previse podsjeca na Zbogom, oruzje od Hemingwaya, i tesko mi se uzivit u te knjige koje lelemudare oko rata i ljubavi\n\n3 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "267271": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Mario Puzo - The Fortunate Pilgrim](https://www.goodreads.com/book/show/22037.The_Fortunate_Pilgrim)\n\nliteraturno vidljiv napredak, ali radnja mi i dalje nije bas nesto narocito napeta\n\n3.5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "267412": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Mario Puzo - Omerta](https://www.goodreads.com/book/show/22028.Omerta)\n\ne ovo je vec bolje, da je cijela knjiga zanimljiva kao zadnjih 70tak stranica bilo bi super\n\nkum je mozda nesto bolji, ali definitivno je bolja od sicilijanca i posljednjeg dona\n\n4 / 5",
      "votes": {
        "upvoters": [
          "maria"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282047": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Needful Things](https://www.goodreads.com/book/show/107291.Needful_Things)\n\nnekako sam bila zabrinuta da stvari u postkokainskoj fazi nece bas biti toliko dobre, no bila sam u krivu\n\niako cini mi se da postoji potencijal da bude bolje, pred kraj mi nije bilo bas nes\n\n4 / 5",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "283689": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Sarah Pearse - The Sanatorium](https://www.goodreads.com/book/show/56935099-the-sanatorium)\n\nwoah, citljivo, zanimljivo, napeto, jedina zamjerka koju imam je da mjestimice ima malo previse poglavlja gdje su se komotno mogla spojit, pa malo prekine flow\n\n4.5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287421": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Gerald's Game](https://www.goodreads.com/book/show/32692.Gerald_s_Game)\n\nat this point, naviknuta sam na lose krajeve, ali holy shit ako ovo nije moglo imati 30 stranica manje i ostaviti bolji dojam\n\n3.5 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "291379": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Stephen King - Dolores Claiborne](https://www.goodreads.com/book/show/7278752-dolores-claiborne)\n\nwell just average\n\n3 / 5",
      "votes": {
        "upvoters": [
          "Pengwing",
          "gladiator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "291711": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "[Marijana DragiÄeviÄ‡ - Å palir za raj](https://www.goodreads.com/book/show/58093799-palir-za-raj)\n\nugodno stivo za kisne proljetne dane ili ljetno przenje na plazi, nemam nekih zamjerki, ali budimo realni, nije masterpiece\n\n4 / 5",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}