{
  "title": "[URS] 1. laboratorijska vježba - 2019/2020",
  "creator": "keykey",
  "slug": "urs-1-laboratorijska-vjezba-20192020",
  "tags": [
    "FER",
    "Ugradbeni računalni sustavi",
    "Laboratorijske vježbe"
  ],
  "posts": {
    "4043": {
      "poster": "keykey",
      "content": "Jel itko zna objasniti kako popuniti tablicu istinitosti u 2. zadatku za 1. labos?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4104": {
      "poster": "Jakic007",
      "content": "Ili ja nisam dobro razumio zadatak, ili nedostaje redova u tablici.\n\nMoje razumijevanje je da prvo prokrijem normalno kruženje po gornjem dijelu kad je SMJER=0.\n\nI onda mi to uključujući početno stanje iz 0000=>1000 oduzima 5 redova i onda idem kombinirati svako stanje od tih 5 redova ako se upali u bilo kojem trenutku SMJER=1 i to mi uzima 4 reda jer sam eto odlučio da SMJER ne može biti upaljen prilikom inicijalnog paljenja. Ako može, onda je to još jedan slučaj i to uzima 5 redova sve skupa.\n\nZnači sada smo zauzeli 9 ili 10 redova i nismo još pokrili cijelo kruženje u suprotnom smjeru nego samo promjene smjerova.\n\nNe znam je li itko skužio što sam htio reći ali i ja sam zbunjen.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "4464": {
      "poster": "mabraham",
      "content": "Pozdrav,\n\nnisam bio u mogućnosti u cijelosti pratiti pripremno predavanje za prvu laboratorijsku vježbu, jer sam imao još jedno pripremno predavanja za labose iz drugog predmeta. :(\n\nAko sam dobro shvatio treba riješiti Zadatak 1 i Zadatak 2 sa kraja ove skripte?\n\nhttps://www.fer.unizg.hr/_download/repository/Skripta_za_laboratorj_URS_prvi_ciklus.pdf\n\nMože li mi netko objasniti da li se rješava individualni zadatak i ako da, koji je zadatak i što točno znače brojevi na slici koju šaljem :)![](assets/2020-03-29/00006.png)\n\nHvala.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}