{
  "title": "Poslovni planovi, ideje, vlastiti projekti...",
  "creator": "tata (NISAM ASISTENT)",
  "slug": "poslovni-planovi-ideje-vlastiti-projekti",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "7063": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "Ovo neka bude tema o vlastitim projektima, idejama i stvarima čime se bavite (ili biste se htjeli baviti), a vezane su za poslovni svijet. \n\nEvo o čemu sam ja razmišljam od jučer (a sigurno je i netko drugi prije o tome razmišljao), pa me zanima što mislite. Ukratko, web aplikacija koja bi spajala OPGovce i ljude koji bi kupovali od OPGovca. \n\nPretpostavke pod kojima bi ovo imalo smisla, nakon što ovaj kaos prođe: \n1. ljudi će se više baviti poljoprivredom (možda manje važno)\n2.  postojeći OPG-ovi će se više fokusirati na web prodaju (trenutno su to razne fb grupe, usmenom preporukom, lokalne tržnice...)\n\nNisam uopće puno razmišljao niti istraživao o ovome (možda već tako nešto i postoji) pa me zanima, ovako na apstraktnoj razini, što mislite o ovome?",
      "votes": {
        "upvoters": [
          "BigBoi",
          "M-16",
          "Svarog (Veles)",
          "[deleted]",
          "boki8 (kerovac)",
          "mAcaLukas (mAca Lukas)",
          "steve (Mr_mr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7071": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Trenutno razvijam ideju programskog jezika expresivne, ljudske sintakse s konceptima vlasništva i nečeg novog što se zove supermodul.\n\nSupermodul je moja kontra prenatrpanošću jezika, ali i nešto što bi trebalo omogućavati manje interpretere: ideja je da umjesto da se značajke jezika razvijaju u samom jeziku, da je jezgra jezika otprilike istih mogućnosti kao C a onda se na to, slično kao i kod importanja modula, može pridružiti supermodul koji bi obuhvaćao cijele paradigme (npr. OOP supermodul, funkcionalni supermodul itd.), gdje interpreter uključuje dio funkcionalnosti tog supermodula (tj. lexer, parser, semantički analizator, generator međukoda i sami interpreter).\n\nTrenutno imam 2 problema\n\n- ne znam kako standardizirati i normirati izradu supermodula\n- ne znam kako optimalno pridruživati supermodule cijelom sustavu bez da ih rekompajliram za svaku novu kombinaciju\n\nIdeja supermodula je da omogući da normalni paketi budu mali, dok bi npr. frameworkovi postali supermoduli. Tako bi npr. Tensorflow bio supermodul koji bi omogućavao googleu da ga napiše koliko god optimalno želi. Vjerujem da bi ovo omogućilo jeziku da se iskoristi za apsolutno sve zamislivo, bez da postane prenapučen kao što su to postali npr. C++ i C#, a i da jezični puristi mogu odlučivati koje paradigme žele koristiti.\n\nSve u svemu radio bih to u Rustu da ga napokon izvježbam i zato što je prirodno prikladan za koncept vlasništva.",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "Jakic007",
          "McKovalski",
          "Piki",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "mAcaLukas (mAca Lukas)",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Jimothy",
          "Upforpslone",
          "feel_d_boot (iNut)"
        ],
        "tuga": []
      }
    },
    "7074": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@tata#7063 Definitivna preporuka tebi, a i ostalim kolegama upisati Poduzetništvo i izvoz u visokim tehnologijama. Predavanja Vedrana Bilasa će vam neke stvari zbilja staviti u perspektivu. Svi bi neki big bizmis, ez money, al nitko se ne pita koje su negativne strane njihove ideje.\n\nOno što bi ti Bilas najverojatnije rekao jest da tvoja ideja već postoji i zove se Facebook grupa. Svaki OPG sad ima svoju stranicu, član je grupe u svojoj županiji i možda čak ima neki wordpress dignut. \n\nNa to mu ti kažeš, kako nije isto, tvoje je više fokusirano pa ti on kaže da manje feature-a ne znači više fokusirano. I Facebook ima marketplace. Za njega farmer ne mora instaliravat novu aplikaciju, pravit novi račun, tražit ljude. Sve je tu. FB dobrim djelom ispunjava rupu koju pokušavaš popunit, ima userbase od minimalno 800 mil ljudi, lokalno vjerojatno bar milijun, ima puno više para, marketing, robusnu mrežu servera, podršku za sve od laptopa i mobitela do frižidera i zvučnika.\n\nNe pokušavam te posrat, ideja je zanimljiva, ali ti želim ukazat na to (što bi ti i on vjerojatno rekao) da moraš nečim privuć i zadržat korisnika sa već postojeće platforme koja njemu ispunjava sve potrebe.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Feelcool",
          "Filemon",
          "Jakic007",
          "Lyras",
          "M-16",
          "McKovalski",
          "Murin",
          "PeroPerica",
          "RS7",
          "Red_Baron",
          "Svarog (Veles)",
          "ViBorg",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "allophone",
          "feel_d_boot (iNut)",
          "ivicato",
          "krle",
          "member",
          "mesojed (sofronijevicevPrst)",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7311": {
      "poster": "lup",
      "content": "@tata#7063 https://online.trznice-zg.hr/ vec postoji",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "mAcaLukas (mAca Lukas)",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7329": {
      "poster": "Worly",
      "content": "@tata#7063 Evo nedavno je jedan takav startup točno to napravio \n\nhttps://www.facebook.com/go2farm\n\nhttps://play.google.com/store/apps/details?id=com.geniusconsulting.go2farm&hl=en",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Svarog (Veles)",
          "ViBorg",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7343": {
      "poster": "ViBorg",
      "content": "@mAcaLukas#7074 Istina, ali nema nekih funkcionalnosti poput reviewa (bilo prodavača, bilo kupaca koji možda trolaju) poput npr. ebaya. Ako napravi aplikaciju koja se integrira sa facebookom, onda je već riješio userbase. Ono što bi više moglo zeznuti tu ideju je to što nije prvi. Već je izašlo par aplikacija, a timeing je dosta važan (npr.  Android i iPhone vs Windows Phone).",
      "votes": {
        "upvoters": [
          "M-16"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7345": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@ViBorg#7343 Facebook Market [ima funkcionalnost recenzija](https://www.facebook.com/help/203159646798570)",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Svarog (Veles)",
          "ViBorg",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7350": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@ViBorg#7343 Kao što @micho  kaže, recenzije postoje za Market i za Pages. Userbase ne dobiješ integracijom s Facebook-om, userbase dobiješ kad Facebook korisnik krene tvoju aplikaciju koristit umjesto Facebooka. \"Već je izišlo par aplikacija\" znači da je konkurencija još jača. Uglavnom, nedovoljno razrađen plan iako ideja nije bila loša.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7529": {
      "poster": "ViBorg",
      "content": "@micho#7345 I stand corrected. Ne koristim baš aplikacije koliko facebook preko PC-a pa nisam znao za to. Vidio sam da se ljudi organiziraju u grupe  na Facebooku (a i na to smo se @mAcaLukas i ja referirali), a tamo recenzije nisu nativne. Koliko vidim, u marketplaceu uopće ne postoje (takve) namirnice.\n\n@mAcaLukas#7350 Bitno je da ljudi počnu koristiti tvoju aplikaciju, nije nužno da napuste drugu, a to će učiniti ako im ponudiš nešto što im olakšava ili omogućuje naprednije korištenje.\n\n\"Već je izašlo par aplikacija\" sam koristio kao argument da je to zapravo važniji razlog zašto bi trebalo odustati, zato sam i naveo slučaj Windows Phonea koji je baš zbog kašnjenja propao.",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7606": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@ViBorg#7529 Ako ćeš prihvatit moju generalizaciju, ja bih rekao da su vlasnici OPG-ova najćešće fameri/stočari/seljaci i da nisu baš early adopteri tehnologije. Ako farmer ima FB koji njemu funkcionira jer mu se ljudi javljaju preko Page-a ili ima razmjenu dogovorenu u grupi za svoju općinu, on nema potrebu da skida tu aplikaciju. On nema potrebu da traži tu aplikaciju i najagresivniji marketing ga vjerojatno neće natjerat da je uopće razmotri. Eventualno ako mu kolega u birtiji pokaže da ju on koristi i da pun kurac više zarađuje preko nje jer idu naruđbe il nešto slično, al s obzirom da su takva druženja trenutno ograničena, a nakon krize neće biti potrebe za aplikacijom, ne vidim način.",
      "votes": {
        "upvoters": [
          "ViBorg",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7618": {
      "poster": "M-16",
      "content": "@tata#7063 Mislim da ideja ima smisla. Ne vidim razloga zašto proizvođači ne bi koristili i ovako nešto pored facebooka, instagrama, itd. Naravno, ovo će imati smisla samo ako će zaista pomoći, s jedne strane prozivođačima da povećaju svoju prodaju i profit, a s druge strane kupcima da dođu do kvalitetnih domaćih proizvoda. Ideja da je sve na jednom mjestu kao neka online tržnica mi je super. Najteži dio će biti na samom početku privući ljude da koriste aplikaciju, i proizvođače i kupce. Smatram da bi prvo trebao pokrenuti neku lokalnu priču, koja ako se pokaže dobrom, bi se onda lakše širila i reklamirala. \n\nbtw. erogag je baš nedavno pokrenuo hercegovačku web platformu za male proizviđače, s tim da je platforma, barem zasad, besplatna i s tim da oni imaju preko facea i preko instagrama stvarno velik reach pa im se neće biti problem izreklamirati. https://www.mamipara.com/",
      "votes": {
        "upvoters": [
          "Cubi",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7678": {
      "poster": "tito",
      "content": "@tata Razmišljao sam o istoj ideji. Sada kada razmislim mislim da je ljudima najveći problem naći pouzdane opg-ove i to što moraju kontaktirat više opg-ova za različite stvari (npr. jednog za jabuke, drugog za jaja, trećeg za salamu itd.). Možda bi trebali naći pouzdane opg-ove koji nam mogu pružiti dovoljnu količinu proizvoda i napraviti dobar distribucijski kanal tako da ljudi mogu naručiti preko jedne osobe sve potrebne namirnice. Trebaju nam web aplikacija ili neka facebook stranica, ljudi s autima ili kombijima (sada puno uber-ovca ne vozi), skladištari i raznosaći koji če to nositi (ni oni trenutno ne rade). To je to što sam za sada razmislio, a možda nam trebaju i neka skladišta u koja ćemo privremeno spremat te proizvode.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7709": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "Što se tiče tajminga ulaska u tržište, ne znam koliko je to presudno, Microsoft je prvi imao neke touch tablete ili što već pa je došao Apple,  Yahoo je također imao web tražilicu pa je došao Google. Naravno tu se dolazi do glavnog problema, a to je da treba imati proizvod koji je nekoliko puta bolji od postojećeg rješenja. \n\n@tito Da vidiš, o tome nisam razmišljao, ljudima bi bilo naporno  za svaku pojedinu namirnicu zvati različite OPGove (a upravo tako funkcionira gore linkana https://online.trznice-zg.hr/ ), pa čekaj dostavu za svakoga, pa plati svakome posebno...) Možda da korisnik može odabrati da želi salatu od Marka, jaja od Marice, krumpir od Ivana, sve se stvari pošalju u jedan centar iz kojeg se onda to dostavlja korisniku, samo ne znam je li se može to  sve uskladiti i je li uopće ekonomično (postoji ta jedna dostava viška...)\n\nNe znam u kojem će se smjeru go2farm razvijati, trenutno imaju kontakte za OPGove za čiji si proizvod zainteresiran i onda se može napraviti narudžba kroz njihovu aplikaciju za taj proizvod.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7717": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Kad ste već krenuli u tom pravcu i razmišljanju onda bi vam najoptimalnije bilo imati next-day delivery i to lokalizirani. Npr. imaš 2 dostavljača s Caddy-ima u Novskoj i okolici i 50 prijavljenih opg-ova. Do 17h se može poslat narudžba za sutra koja može sadržavat ponešto iz svakog OPG-a. Poslje toga se sve to kompajlira u popis OPG-ova koje treba obići i koliko na njima čega treba pokupiti. Kad se sve skupi, podjeli se u distribucijskom \"centru\" na škarnicle/kutije s napisanim adresama. Upucaš sve narudžbe da ti maps izračuna rutu i sutradan redom dostavljač vozi. Čini mi se efikasnije od Pauza.hr modela naruči -> dostavljač ode tamo skupit -> dostavljač ide tebi dostavit\n\nEDIT: eventualno da se radi naručivanje do npr podne i dostavlja od 14h pa bi bilo isti dan i svježije",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "tata (NISAM ASISTENT)",
          "tito"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7727": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Kako stvari stoje, da to s OPG-ovima prođe vjerojatno bi se trebali nekako infiltrirati u nekakvo glavno tijelo. To bi onda bili pretpostavljam sindikati. Ako uspijete prodati priču sindikatima, koji bi aplikaciju mogli koristiti za koordinaciju, i kad bi ta aplikacija nudila sve - dakle prezentaciju, prodaju, kupnju i distribuciju, onda bi to imalo šanse.\n\nMeđutim, za to bi trebalo izraditi sustav nalik na Amazon. Treba se sjetiti da je Amazon koliko god jednostavno izgleda čudo moderne. I sad je samo pitanje koliko bi još ljudi trebalo biti na projektu da to bude čudo moderne. Osobno sam mišljenja da Hrvatska nema dovoljno dobru infrastrukturu da takva platforma bude relevantna - dostavne službe su nam kurac, internetske službe su nam kurac, ljudi su nam kurac... Ima previše problema koje Amazon, recimo, nije imao, a opet pokušava se riješiti već riješeni problem, tako da je dobitak izrazito neizrazit xD\n\nNo, vratimo se na stvar. Treba provesti studiju izvedivosti. Bez studije izvedivosti se ne ide ni u kakav projekt. Tek ako se studijom izvedivosti utvrdi da uz postojeće stanje u RH se tako nešto isplati raditi bi trebalo početi pričati što i kako.",
      "votes": {
        "upvoters": [
          "M-16",
          "Svarog (Veles)",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "tata (NISAM ASISTENT)",
          "tito"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "7751": {
      "poster": "tito",
      "content": "Ali zato Amazon nema sustav rođe kao u rvackoj",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "NekocBraca",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "allophone",
          "ivicato",
          "krle",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "tata (NISAM ASISTENT)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "11038": {
      "poster": "InCogNiTo124",
      "content": "Well jedan humble brag o mojim projektima na koje sam jako ponosan:\n\n1. [Chaos Plotter](https://github.com/InCogNiTo124/ChaosPlotter)\n\n   ![](assets/2020-04-18/00005.png)\n\nJos i na starom forumu sam pisao kako sam se zainteresirao za teoriju kaosa i da sam procitao jedno 5-6 knjiga na tu temu. U ovom projektu radi se o vizualizaciji teorije kaosa, odnosno tocnije iteriranih mapa i bifurkacijskih dijagrama. O svim ovim fensi rijecima pise puno na internetma, ja cu samo tldrat, uzme se predefinirana funkcija (npr f(P) = R*P*(1-P)) i uzme se proizvoljan broj iz <0, 1> i provuce se odabrani broj kroz funkciju, onda se isto ponovi s rezultatom, i tako puno puta. Zvuci glupo, al ispada da variranjem koeficijenta R mozemo dobiti **potpuno divlje ponasanje** ili pak skroz pitomo. Gornji graf pokazuje vrijednosti koje dobijemo za svaku iteraciju, a donji graf pokazuje, reklobise, \"long term behaviour\" odnosno u koje vrijednosti to iteriranje konvergira, ako konvergira.\n\nPisano je u pythonu, za gui koristim Qt, racunanje numpy, a za plotanje matplotlib. veci je PITA bio postavit to troje da suraduje nego actual implementacija ovog sto sam htio, no nedavno sam saznao za novi lib koji to sve ima skupa pa cu mozda prepisat to sve\n\nNa projekt sam najvise ponosan cisto zbog toga sto je valjda prvi projekt kojeg sam zamislio i proveo do kraja, odnosno on sad ima sve ono sto je imao kad sam ga zamislio. Poslije su mi jos sinule neke druge ideje pa mozda dodam, nakon sto se prestanem faking igrat sa sliderima, so mersmerising\n\n2. [recursive-sgd](https://github.com/InCogNiTo124/recursive-sgd)\n\n   Na ovaj projekt sam najvise ponosan jer je \"najpametniji\" projekt kojeg sam napravio. Cak sam uspio slozit i pip paket pa je svima dostupan preko `pip install recursive-sgd`. Ugl. svi koji se bave dubokim modelima znaju da se isti treniraju backpropagation algoritmom, koji je samo fensi oblik [dinamickog programiranja](https://colah.github.io/posts/2015-08-Backprop/). Obicno se prvo provede forward pass, izracun lossa, pa back pass, i onda se to loopa dok se ne ispuni kriterij zaustavljanja.\n\n   Meni je palo na pamet da se isto moze izvesti rekurzijom. Recimo da zelimo trenirati n-ti sloj. Ajmo prvo trenirati (n+1)-vi sloj i nek nam funkcija vrati gradijent. S tom informacijom mozemo natrenirati n-ti sloj i vratit gradijent prethodnom sloju. Nista tesko. I sto je najbolje, ispada da radi :D doduse cim sam ga dobio da malo radi odma mi je pao interes lol, postigo sam najbitnije, sad mi je samo ostalo malo popravit CLI alat i dodat jos par fičrsa.",
      "votes": {
        "upvoters": [
          "Amon",
          "BaboTrojka",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Jakic007",
          "Piki",
          "Quentin",
          "Red_Baron",
          "Svarog (Veles)",
          "Vishnjevac",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "indythedog",
          "johndoe12 (enaiks)",
          "laranotreallycroft",
          "mAcaLukas (mAca Lukas)",
          "member",
          "pitroid",
          "tata (NISAM ASISTENT)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "35437": {
      "poster": "crocorax",
      "content": "Ako radite na nekakvim projektima i želite ih pokazati drugima, slobodno objavite ovdje.",
      "votes": {
        "upvoters": [
          "HeHe (Direktor života)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "35438": {
      "poster": "[deleted]",
      "content": "![](assets/2020-06-04/00054.png)\n\ndajte neke ideje za kaj napravit s ovim",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "35439": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@Itachi#35438 botun koji automatski zatvara sve kriticne tabove kad udje mater u sobu",
      "votes": {
        "upvoters": [
          "Feelcool",
          "Filemon",
          "InCogNiTo124",
          "M-16",
          "Mioch",
          "NekocBraca",
          "RS7",
          "Red_Baron",
          "Svarog (Veles)",
          "Uchenikowitz (Učečuču)",
          "Vasili (Fasili)",
          "Wayk",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "bb8 (zaza)",
          "crocorax",
          "indythedog",
          "pitroid",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "BigZ1",
          "Bobinator",
          "Dekan",
          "Filemon",
          "HeHe (Direktor života)",
          "InCogNiTo124",
          "M-16",
          "Mioch",
          "NekocBraca",
          "Red_Baron",
          "Svarog (Veles)",
          "Uchenikowitz (Učečuču)",
          "__builtin_popcount (std::popcount)",
          "bb8 (zaza)",
          "crocorax",
          "indythedog",
          "ivicato",
          "jarza",
          "member",
          "sane_insane",
          "tekamolo",
          "turunturu (Cement)",
          "vykar (mango)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "35442": {
      "poster": "crocorax",
      "content": "@Itachi#35438 napravi si ovo https://www.youtube.com/watch?v=kjEAZbh1pcI",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "HeHe (Direktor života)",
          "M-16",
          "Ollie",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "35445": {
      "poster": "[deleted]",
      "content": "@crocorax#35442 bed je kaj gumb ostane stisnut sve dok ga ne zarotiras natrag da se otpusti i vrati u nepritisnuto stanje\n\nmislio sam ga rastavit i modificirat da se sam vraca al onda riskiram da ga potrgam(",
      "votes": {
        "upvoters": [
          "crocorax"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "35447": {
      "poster": "HeHe (Direktor života)",
      "content": "Imam mnogo planova i projekta u glavi neki su već u izvedbi, ali zbog biznismenske strane ne mogu s vama dijeliti detalje",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Filemon",
          "member",
          "vykar (mango)"
        ],
        "wtf": [
          "netflix (seximan)"
        ],
        "tuga": [
          "crocorax"
        ]
      }
    },
    "35480": {
      "poster": "InCogNiTo124",
      "content": "@Itachi#35438 https://github.com/caseykneale/VIMKiller/blob/master/README.md",
      "votes": {
        "upvoters": [
          "Wayk",
          "[deleted]",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Ducius",
          "Filemon",
          "Wayk",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "35481": {
      "poster": "[deleted]",
      "content": "@InCogNiTo124#35480 hahahahahahahahh",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "35483": {
      "poster": "InCogNiTo124",
      "content": "Bajdvej vec postoji topik\n\nhttps://forum.studosi.net/d/229-poslovni-planovi-ideje-vlastiti-projekti/16",
      "votes": {
        "upvoters": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "48647": {
      "poster": "Boobo-oobo",
      "content": "Na F2 je bil takav thread, pa nek bude i tu. Postajte svoje DIY kreacije, rukotvorine i sl.\n\nTam negde sredinom 3.mj. su ocito ljudi iz dosade cistili stanove, svaki tjedan je bilo dobrog loota za pokupit. Nasel sam televizor, DVBT prijamnike, stolne lampe i sl. Sve je radilo i bilo funkcionalno. Jedan dan sam nasel tablet. U super stanju vizualno al nije reagiral uopce. Uzel sam ga i skuzil da je USB konektor potrgan. Prvo sam za provjeru zalemil direkt zice na maticnu da vidim dal radi uopce. I radil je :D. Al posto je prestari tablet i najnovija verzija Androida koja ide na njega je 4.4.2. nema bas neke velike koristi od njega. Jedino korisno kaj mi je palo na pamet je da napravim digitalni okvir za slike. Izvadil sam bateriju iz njega i zalemil direkt zice punjaca di je bila baterija. Puno je laksi tablet i nemam straha da se nekaj dogodi bateriji. Bratic mi je napravil drveni okvir koji zam zaljepil na tablet da vise izgleda ko okvir za fotke. I nasel sam zgodnu aplikaciju, fotoo, koji sljaka na 4.4.2 androidu i super za digitalni photo okvir. Par fotki u nastavku.\n\n[url=https://flic.kr/p/2jhHGZR][img]https://live.staticflickr.com/65535/50072315811_f01e8a83b0_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2jhHGZR]P_20200703_164422.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2iJX3Py][img]https://live.staticflickr.com/65535/49712791078_5fba060600_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2iJX3Py]P_20200322_181456.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j5Ht9P][img]https://live.staticflickr.com/65535/49936471283_42ee525db8_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5Ht9P]P_20200525_112851.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2jfPp1w][img]https://live.staticflickr.com/65535/50050792978_426034ae00_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2jfPp1w]P_20200624_150431.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2jhHGZF][img]https://live.staticflickr.com/65535/50072315801_ce7584a17b_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2jhHGZF]P_20200703_164440.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2jhEPKn][img]https://live.staticflickr.com/65535/50071753183_34cf78424a_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2jhEPKn]P_20200703_164512.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2jhJYQH][img]https://live.staticflickr.com/65535/50072564217_a3fcf6f030_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2jhJYQH]P_20200703_165428.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr",
      "votes": {
        "upvoters": [
          "1vq",
          "Bobinator",
          "Bog (Charlie Brown)",
          "Dome",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jimothy",
          "M-16",
          "Mariox",
          "MarokMarsci (Collapse Enjoyer)",
          "RS7",
          "Red_Baron",
          "Svarog (Veles)",
          "WickyWinslow",
          "[deleted]",
          "amnael",
          "aperture",
          "herc",
          "indythedog",
          "ivicato",
          "joc",
          "maPre",
          "mijauexe",
          "netflix (seximan)",
          "rhythm_controll",
          "tata (NISAM ASISTENT)",
          "tekamolo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "48673": {
      "poster": "Bobinator",
      "content": "evo i dvije moje\n\novo sam radio jos za zavrsni rad u srednjoj, a kako osim arduina nisam znao programirat, napravio sam tako da u exelu nacrtas sliku koju zelis, i onda pomocu makronaredbi(vj je lakse bilo naucit isprogramirat neki takav programcic nego ovo, al dobro) se dobije kod koji se samo zalijepi u arduino i prebaci na hologram. dost kul je za vidjet uzivo, a pogotovo u mraku\n\nkasnije sam zabrio malo i htio napravit puno manje i jednstavnije, pa se bacit u biznis tipa makerbuino, al odustao\n\n![](assets/2020-07-03/00059.jpeg)\n\ndrugo je bio visak vremena i romantik u meni lol \n\nspalio prste ko mala picka, al cura je bila sretna jer je bila zajebancija da nema srce, pa je ovo bilo realisticno, a opet \"romanticno\"\n\n![](assets/2020-07-03/00060.jpeg)",
      "votes": {
        "upvoters": [
          "1vq",
          "AntonioB25 (Pleteni miš)",
          "Bog (Charlie Brown)",
          "Boobo-oobo",
          "Dome",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Kushim",
          "Mioch",
          "Mrcina (Yoso)",
          "Murin",
          "NekocBraca",
          "RS7",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "amnael",
          "aperture",
          "indythedog",
          "ivicato",
          "joc",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "mijauexe",
          "netflix (seximan)",
          "pitroid",
          "sane_insane",
          "spejs",
          "tekamolo",
          "tito"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "58848": {
      "poster": "Boobo-oobo",
      "content": "Evo jedan Fiat Doblo projekt, al moze posluziti za svaki auto.\n\n[B]Izrada zavjesica/zastita protiv sunca sa stakla[/B].\n\nPotrebni materijal:\n\n[URL=\"https://www.bauhaus.hr/okrugla-cijev-od-aluminija-6-x-1-x-2000-mm-eloksirana.html\"][U]Okrugla cijev od aluminija 6 x 1 x 2000 mm, eloksirana[/U][/URL] (doblo ima 6 prozora, 2m je taman za najveci prozor bilo) - 6x 14.90kn / kom\n\n[URL=\"https://www.svijetmetraze.hr/artikel/mreza-teza-2250-02-crna\"][U]Mreža teža, 2250-02, crna[/U][/URL] (ja sam narucil 5m materijala, puno previse i ostalo je jos al nije preskupo) - 5x 4.5EUR / m\n\nTeta koja zna sivati :D\n\nAluminijsku sipku sam spigal po konturi svakog prozora i spojil krajeve tak da sam umetnul M4 navojnu sipku i onda stisnul cijev da zagrabi navoje.\n\n[url=https://flic.kr/p/2j2VVtk][img]https://live.staticflickr.com/65535/49904951677_ee10dc0081_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j2VVtk]P_20200516_101832.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j2RJwe][img]https://live.staticflickr.com/65535/49904134393_20eda471cf_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j2RJwe]P_20200516_120609.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j2RJhw][img]https://live.staticflickr.com/65535/49904133598_9cc94a5787_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j2RJhw]P_20200516_101750.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j5XJh5][img]https://live.staticflickr.com/65535/49939253732_ed42b810e6_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5XJh5]P_20200526_124937.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j5XJnL][img]https://live.staticflickr.com/65535/49939254062_bce0e7396d_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5XJnL]P_20200526_134150.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n\nSipka se relativno lagano rukom savija i ne \"urusava\" se tak lagano, svaki kut sam uspel bez vecih problema spigati.\n\nNajveci problem su bili prozori kliznih vrata. Ne otvaraju se nego idu samo \"na kip\" malo i zbog nosaca prozora ima prevelike kuteve za savijanje ak bi samo pratil liniju prozora. Tak da sam za klizna vrata skinul stakla i spigal sipku prema konturi samog otvora na vratima i izbjegel piganja preko nosaca prozora.\n\n[url=https://flic.kr/p/2j5TykL][img]https://live.staticflickr.com/65535/49938439858_69ace60225_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5TykL]P_20200526_155430.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j5Wcxk][img]https://live.staticflickr.com/65535/49938955221_c3340a9943_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5Wcxk]P_20200526_160628.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j5XJSP][img]https://live.staticflickr.com/65535/49939255747_e57d977339_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5XJSP]P_20200526_160633.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j5XJVe][img]https://live.staticflickr.com/65535/49939255887_482b921200_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j5XJVe]P_20200526_165725.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n\nNakon savijanja sam dal sve teti da mi sasije materijal preko tih cijevi. Evo rezultata prije/poslije : \n\n[url=https://flic.kr/p/2j8D6cf][img]https://live.staticflickr.com/65535/49969566456_3b43a4fa4c_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j8D6cf]P_20200604_091412.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j8AtNF][img]https://live.staticflickr.com/65535/49969057183_3dc185ae74_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j8AtNF]P_20200604_102034.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n\n\n[url=https://flic.kr/p/2j8D6Dn][img]https://live.staticflickr.com/65535/49969567971_b03c48150d_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j8D6Dn]P_20200604_091432.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j8D7P8][img]https://live.staticflickr.com/65535/49969571901_c5d6084e85_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j8D7P8]P_20200604_102050.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n\n\nEfekt je zatamnjenih stakla, teze se vidi sto je unutra, vidljivost prema van je smanjena naravno al je OK za sve prometne situacije.\n\nZasto ne foliju? Cijena je jedna stavka, ovo me ispalo sve skupa 300kn, kvalitetnu foliju za Doblo sam dobil ponudu 1600kn. Ovo mogu i skinuti po potrebi i staviti ak treba. Najvise je bil challenge da vidim dal mogu napraviti tak nekaj. Meni ispalo super, ono kaj sam i htel. Da radim opet trazil bi jedinu tanju sipku/cijev, lakse se bi savijalo i nebi rubovi ispali \"debeli\" i dalo se bi uze sašiti.\n\nPogled iznutra:\n\n[url=https://flic.kr/p/2j8Apyt][img]https://live.staticflickr.com/65535/49969042903_1d82ed5480_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j8Apyt]P_20200604_091146.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr\n\n[url=https://flic.kr/p/2j8Etii][img]https://live.staticflickr.com/65535/49969835927_694f9d2b75_b.jpg[/img][/url]\n\n[url=https://flic.kr/p/2j8Etii]P_20200604_102115.jpg[/url] by [url=https://www.flickr.com/photos/96355686@N05/]Marko Hreščan[/url], on Flickr",
      "votes": {
        "upvoters": [
          "Danac",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "M-16",
          "Mioch",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58850": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Boobo-oobo#58848 kolko ti je trebalo vremenski za ovo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58852": {
      "poster": "Boobo-oobo",
      "content": "@micho#58850 \n\nJako malo. Kad imas materijal 15-20min piganja po prozoru, ovisno kak je problem kontura. Sivanje sam prepustil teti na par dana i montaza je trajala 30sec.",
      "votes": {
        "upvoters": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58892": {
      "poster": "koode7",
      "content": "Ako bi se netko htio team-upat razvijati nesto na zimu, hit me up na pm",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "InCogNiTo124"
        ],
        "tuga": []
      }
    },
    "58994": {
      "poster": "Bobinator",
      "content": "@koode7#58892 na sto tocno ciljas?",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59605": {
      "poster": "Mariox",
      "content": "Do sada su ljudi za fighting igrice koristili ili fightstickove ili ds4 padove. No sada postoji i populacija koja je naucila igrati na tipkovnici i ja sam dio te populacije. Nas je problem sto je na turnirima standard koristiti PS4, na koji se ne moze spojiti tipkovnica (barem ne tako da se moze igrati). Rijesenje? Hitbox. Jos uvijek je tesko dostupan po povoljnim cijenama u Europi pa sam napravio svoj. \n\n![](assets/2020-08-12/00004.jpeg)\n\nOsim toga sto sad mogu igrati i na ps4 i na PC-u, hitbox je jako udoban za koristiti, moze se po njemu zestoko igrati po nekoliko sati u komadu bez da me ruke bole. Isto tako, sanwa arkadne tipke su superiornije od cherry mx red mehanickih switch-eva. Nakon sto sam se prebacio, odmah sam bio bolji ne samo u fighting igrama nego i u drugim igrama npr. OSU! mania i touhou.",
      "votes": {
        "upvoters": [
          "Amon",
          "Boobo-oobo",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jaki",
          "NekocBraca",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "idontwannabemyself",
          "mAcaLukas (mAca Lukas)",
          "tamnodrvo96"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78107": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "tinder za učenje lol\n\nOdabereš predmet i za što se želiš pripremiti (za MI, ZI, labos...) i prikaže ti ljude koji su odabrali isto to pa se dalje u chatu dogovrite kako dalje. \n\nHtio sam proučiti izradu mobilnih aplikacija pa je ovo produkt toga.\n\nRadio sam to s Flutterom, trenutno je to još jako daleko od gotove aplikacije, osim što fali chat, čini mi se da nije baš to najbolje optimizirano što se tiče write-ova i read-ova na Firestoru, uglavnom hrpa posla još.\n\nOvo je UI koji je u Photoshopu napravljen:\n\n\n\n![](assets/2020-10-06/00014.jpeg) ![](assets/2020-10-06/00015.jpeg) ![](assets/2020-10-06/00016.jpeg) ![](assets/2020-10-06/00017.jpeg) ![](assets/2020-10-06/00018.jpeg) ![](assets/2020-10-06/00019.jpeg) ![](assets/2020-10-06/00020.jpeg) ![](assets/2020-10-06/00021.jpeg)",
      "votes": {
        "upvoters": [
          "1vq",
          "Amon",
          "AntonioB25 (Pleteni miš)",
          "BigBoi",
          "Bisenberg (DonaldPump)",
          "Bobinator",
          "Dell",
          "Emma63194",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jaki",
          "Jakic007",
          "Mariox",
          "Mikki",
          "Mioch",
          "NekocBraca",
          "PrisonMike (Števo)",
          "Red_Baron",
          "Svarog (Veles)",
          "Theanko (Mirko Žmirko)",
          "Widlar",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "a_ko_si_ti",
          "amnael",
          "boki8 (kerovac)",
          "boss15",
          "feel_d_boot (iNut)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "in1",
          "ivicato",
          "johndoe12 (enaiks)",
          "lul",
          "macaklin",
          "member",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "netflix (seximan)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Dell",
          "HeHe (Direktor života)",
          "Hrvoje (Hrvoje45)",
          "NekocBraca",
          "Red_Baron",
          "Stark",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "in1",
          "jadzia-dax (Jadzia Dax)",
          "member"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "78109": {
      "poster": "InCogNiTo124",
      "content": "@tata#78107 e kakvo ti je iskustvo s flutterom? Cuo sam da je produkt dosta kancerogen (i osjetio na svojoj kozi sa hz aplikacijom) ali google cini se ulaze puno u to jer im je to osnova za novi os pa kao, jel barem ugodan za kodiranje?",
      "votes": {
        "upvoters": [
          "Jaki",
          "tata (NISAM ASISTENT)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78112": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@InCogNiTo124#78109 meni je  problem dokumentacija, nije baš detaljna, ali za nekog tko zna flutter/dart vjerujem da je dobra. A i ne znam usporediti s kotlinom/swiftom jer nisam radio s njima. \n\nNedavno su i Google Pay u Flutteru napisali pa kao, valjda ima budućnost, ali opet,  Google nema problema s odbacivanjem tehnologija, pa ono, tko zna...",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78114": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@tata#78107 Čini mi se super ideja, ne baš za trenutno vrijeme, ali prilično kul za ljude koji traže manje od instrukcija, a više od \"Pitanja i odgovori\" teme. Čuo sam da imaju nešto slično u Austriji, ali na kraju je bila lidl verzija studoša upakirana u mobilnu aplikaciju.\n\nI'd probably use it lol",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "InCogNiTo124",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "member",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "89991": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Moji su odselili, odnijeli sa sobom shitty ikea stol za komp koji je stajao pored peći (i dijelom se topio) pa mi je ostao prazan prostor za popuniti. Ovaj projekt je ekvivalent satarašu kojeg složite od svega što je ostalo u frižideru. 3 letve 40x50mm od 4 metra, neke stranice i podnice sanduka šta sam našao na tavanu, neke daske šta sam našao na tavanu, 4.5x45mm torx vijci za drvo šta sam našo u podrumu, olovka, kutnik i Lidl 4 u 1 aku alat. Voila\n\n![](assets/2020-11-08/00030.jpeg)\n\n![](assets/2020-11-08/00031.jpeg)\n\n![](assets/2020-11-08/00032.jpeg)\n\n![](assets/2020-11-08/00033.jpeg)\n\nGore će dodatno još ići spužva od madraca što sam mislio bacit i tapeciranje od neam pojma čega",
      "votes": {
        "upvoters": [
          "BigZ1",
          "Bobinator",
          "Bog (Charlie Brown)",
          "Boobo-oobo",
          "Emma63194",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Mioch",
          "NekocBraca",
          "Svarog (Veles)",
          "Uchenikowitz (Učečuču)",
          "Vasili (Fasili)",
          "ZvonkoSisoje",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "maPre",
          "member",
          "pitroid",
          "tamnodrvo96",
          "tekamolo",
          "turunturu (Cement)",
          "vidraKida (Ζ ε ύ ς)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "90442": {
      "poster": "Vonj",
      "content": "Cca prije dva mjeseca je sve krenilo od ideje kako bi natkrili terasu. Originalna je ideja bila nesta bas bas jeftino DIY, al onda kad smo se uhvatili isli smo napraviti kako spada. Na kraju smo to sve predimenzionirali, jer stup koji smo planirali u sredinu staviti, nije bilo potrebe za njime. Uzeli smo 9 greda i 5 štafli i krenilo je smirglanje i bojanje. \n\n![](assets/2020-11-09/00035.jpeg)\n\nPlan je bio 3 stupa, dvije poprecne odnosno(vijenac) i 4 roga, a na keaju smo taj jedan planirani stup stavili kao dodatni rog. Plan je bio drugi vijenac zabiti za plocu od kata kuce, al problem je sto je ploca zapravo iznutra suplja(monta) i imala je 5 cm betona na pocetku sto nije dovoljno. Onda nam je tetak predlozio da odstemamo dio zida kod vrata i dio stupa sto drzi balkon i tako gurnemo gredu. Tako smo i napravili(iako je to poremetilo da je sve fino proporcionalno napravljeno) i jos s balkona smo probusili rupe za beskonacne vijke tako da smo jos dodatno osigurali(prakticki moze visiti samo na vijcima).\n\n![](assets/2020-11-09/00036.jpeg)\n\nTo je tako stojalo jedno duze vrijeme jer sam bio u zg, a onda smo u jednom danu napravili cijelu konstrukciju.\n\n![](assets/2020-11-09/00037.jpeg)\n\n![](assets/2020-11-09/00038.jpeg)\n\nVikend iza smo na to stavili OSB ploce za izolaciju i na njih parapropusnu i stafle, a od ostatka greda smo kosnike napravili(iako nije bilo potrebe za njima).![](assets/2020-11-09/00039.jpeg)\n \n![](assets/2020-11-09/00040.jpeg)\n\nNa kraju je gore jos stavljen lim(to smo linijom manjeg otpora da ne izmisljamo toplu vodu kako bi pokrili). Sve sto se moglo sam sam odradio, ostalo sam s ocem radiom. Ujak nam je pomogao kad smo rogove postavljali zbog ocrtvanja sablona. Cijela investicija je ispala cca 5 k kuna(s limom i postavljanjem lima).",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Fica (Prof)",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Kushim",
          "M-16",
          "ZvonkoSisoje",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "amnael",
          "leff",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "member",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "netflix (seximan)",
          "pitroid",
          "sane_insane",
          "tamnodrvo96",
          "tito"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "92285": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@mAcaLukas#89991 da pokažem finalni proizvod. Morao sam nešto radit kako nebi radio diplomski\n\n![](assets/2020-11-13/00048.jpeg)\n\nBlažena bila baba jer je dala tkaninu za tapecirat",
      "votes": {
        "upvoters": [
          "BaboTrojka",
          "BigZ1",
          "Bog (Charlie Brown)",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jakic007",
          "Mioch",
          "NekocBraca",
          "QuintusTullius (DundoMaroje)",
          "Svarog (Veles)",
          "Vonj",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "amnael",
          "bb8 (zaza)",
          "pipi (cicipjorica)",
          "pitroid",
          "tekamolo",
          "tito"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "109797": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Nastavak antologije \"roditelji su se odselili i odnijeli sa sobom pola namještaja\"\n\nIzmeđu špareta i frižidera je bila škrinja koja se često koristila kao radna ploha, a sada je prazan prostor. Cijenjeni gospodin @STAGGER_LEE se rješavao starog hrastovog kreveta, a meni je žao da propadne dobro tvrdo drvo. Ima moje duboke zahvale.\n\nJoš fali finalna obrada za koju je danas kasno i netko da mi pomogne prenijeti iz podruma u kuhinju.\n\n![](assets/2020-12-13/00017.jpeg)\n\n![](assets/2020-12-13/00018.jpeg)\n\n![](assets/2020-12-13/00019.jpeg)",
      "votes": {
        "upvoters": [
          "AntonioB25 (Pleteni miš)",
          "Bog (Charlie Brown)",
          "Boobo-oobo",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Mioch",
          "QuintusTullius (DundoMaroje)",
          "STAGGER_LEE",
          "Svarog (Veles)",
          "Vasili (Fasili)",
          "Vishnjevac",
          "Vonj",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "amnael",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself",
          "jelica (ajmemeni)",
          "maPre",
          "pipi (cicipjorica)",
          "spampers (majmunska boginja)",
          "spejs",
          "tekamolo",
          "tito"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "111072": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@mAcaLukas#109797 final update\n\n![](assets/2020-12-16/00016.jpeg)",
      "votes": {
        "upvoters": [
          "Bog (Charlie Brown)",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "M-16",
          "Mioch",
          "Svarog (Veles)",
          "Vasili (Fasili)",
          "ZvonkoSisoje",
          "amnael",
          "feel_d_boot (iNut)",
          "iNavy (mornar Ica)",
          "snowman",
          "spejs",
          "tamnodrvo96",
          "tekamolo",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123830": {
      "poster": "Bobinator",
      "content": "Dosta dugo nam je podrum, koji je zapravo kotlovnica sluzio za ostavljanje nepotrebnih stvari, pa kasnije kao neka radiona koja je uvijek bila zatrpana i puna svega i svacega, sa losim osvjetljenjem. Pod praznicima sam napokon odlucio napravit fino mjesto za odrezat koji prst, spalit ga lemilicom ili oslijepit se varenjem. \n\nSlika prije-ne osudujte, tu je dosta godina zanemarivanja prostorije u koju se islo samo lozit\n\n![](assets/2021-01-18/00023.jpeg)\n\nJos jedan problem je bila vlaga na zidu(vidljivo na slici gore u kutu\n\n). Povrsina pola kuce je podrum, a taman ta polovica koja nije podrum i samo je iznad zemlje je mjesto gdje se slijeva voda i nakuplja, te dolazi do zida(zamislite kao stepenice), tako da je to jedini zid do kojeg se ne moze doci sa vanjske strane, pa je jedina mogucnost bila sredit sa unutarnje. U prostoriji pokraj smo to rijesili vodonepropusnim ljepilom za plocice i ukrasnim stiroporom, pa sam se i tu odlucio za to rjesenje, ali sa obicnim jer nema potrebe ukrasni\n\n![](assets/2021-01-18/00024.jpeg)\n\nNetko je na forumu nedavno pitao za pegboard, pa mi je dao ideju da bi mogao slozit jer mi je ovako alat bio pribijen direkt u zid sa cavlima(znam, lol, radio sam to sa 12 godina). Najjednostavnije rjesenje mi je ispala obicna OSB ploca, msm da 250x70 ili tako nesto i najobicnije kuke sa navojem. Ukupna investicija 80ak kuna, a dosta cvrsto i svida mi se malo drveta u postoriji. \n\n![](assets/2021-01-18/00025.jpeg)\n\nImao sam jedan radni stol, ali taj je bas za tuc i lupat po njemu, a i previsok za stolac, pa smo od neke stare iverice caca i ja odrezali komad i navarili noge za mali stolic. Odma sam odlucio na taj radni stol navarit neko postolje za brusilicu i cirkular koji je u visini stola tako da i neke vece komade mogu sam rezat. Prije toga je bila jedna obicna zarulja na sred sobe, pa sam ubacio jednu led lampu od 120cm, to je odma preporuka, platio sam komad 20kn, narucio na FBu sa one neke sumnjive stranice koja prodaje sve i svasta, tocnije link sa fba vodi na [ovo](https://shopboxhr.com/). Odma sam uzeo 4 komada za pola kuce. Skroz su lagane i na prvu izgledaju kao smece, ali super korisne, javim ako se koja zapali. \n\nEvo krajnji rezultat:\n\n![](assets/2021-01-18/00026.jpeg)\n\nNazalost, pod nisam ni stigao ni mogao jer se svaki dan skoro lozilo, ali to cu na proljece ili ljeto. Pegboard mi je ustedio sve ove police lijevo, jos sam nabacio obicne one nosace za policu i stavio na njih letve koje sam imao inace uspravno, svaki nosac je 35kg tako da nece otpast. Ali ugl, jedino mi je bio cilj malo to pocistit i naoravit si neki radni stolic jer sam do sad sve lemio na stolu u svojoj sobi pa je bilo problema kad sam morao ucit ili radit na njemu, vjecno ciscenje i kreativni nered, pa je ovaj dio najbitniji\n\n![](assets/2021-01-18/00027.jpeg)\n\nedit: tek sad kuzim kako su brutalne ove panorame lol \n\ni da, jos i struju planiram provest na sva potrebna mjesta",
      "votes": {
        "upvoters": [
          "Apex",
          "BigZ1",
          "Emma63194",
          "Fica (Prof)",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jakic007",
          "Jezza (Clarkson)",
          "Mulder",
          "NekocBraca",
          "PrisonMike (Števo)",
          "Svarog (Veles)",
          "Vonj",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "idontwannabemyself",
          "jadzia-dax (Jadzia Dax)",
          "mAcaLukas (mAca Lukas)",
          "markoo321 (Grinch)",
          "member",
          "netflix (seximan)",
          "pitroid",
          "tata (NISAM ASISTENT)",
          "tito",
          "turunturu (Cement)",
          "whatTheHel"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "128742": {
      "poster": "Bucc (Olive Oil)",
      "content": "Pita me prekjučer frend s tvz-a jel bi mu mogao nekakvi soundtrack napravit za projekt (neka arcade igra) jer ne zna glazbenu teoriju, a ostalo nije htio radit (nije ni ovo, gej).\n\nMislim si, ajd dobro, valjda sam sposoban.\n\n3-4 sata kasnije smislim nešto, jednostavno, zvuči donekle ne dosadno. Pošaljem i kaže mi da dodam umph jer je igra poput space invadersa. Dodam trokutastu distorziju, pošaljem i kaže \"ma to buraz\". \n\nKako već posponam snimanje svojeg albuma iskoristit ću ovaj soundtrack kao start, da sam sebi dokažem da mogu nešto snimit. Snimanje me najviše strah. Stisnem record i cijeli skill padne za 90%. Tu bi pro tip valjda bio da snimam cijelo vrijeme, bravo ja, nisam tak bedast.\n\nEto htio sam podijelit nešto što smatram uspjehom. Raskrinkat ću tko sam, al meh. @Grumio nadam se da nema još takvih poput Vas ovdje.\n\nhttps://soundcloud.com/ivan-bukovac-183843206/sets/rimski-nispei\n\nEdit: ne znam zašto samo jednu prikaže, tri su, klikom na moje ime -> |My| |S|pace D|ex|ter |in| D |Minor| i tamo je sve",
      "votes": {
        "upvoters": [
          "Amon",
          "Bog (Charlie Brown)",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Mioch",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "mAcaLukas (mAca Lukas)",
          "member",
          "menace_master",
          "netflix (seximan)",
          "pitroid",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Grumio",
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "128774": {
      "poster": "Grumio",
      "content": "@Bucc#128742 Sad kad si vec taggao dobit ces malo i kritike. U zadnjoj polovici kada si vec krenuo sa nekim visokim tonovima, onda ga iskoristi neku razradu baseline-a nesto tipa ovog:\n\nhttps://youtu.be/uyJbBLfFb9w?list=OLAK5uy_mDbnoKKQgXwUPOOdpQjw9UB55RW_aNmN0&t=115\n\nA sad iskreno nez, jel me taggas zbog mog posta o doxxanju i stalkanju ili nekog drugog razloga, tbh malo sam pofuren. \n\nA za snmanje ces morat prihvatit cinjenicu da ces se za jedan dobar take morat snimat barem 15-ak puta, ovisno koliko je duga snimka, editanje ti je prijatelj.",
      "votes": {
        "upvoters": [
          "Bucc (Olive Oil)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "128781": {
      "poster": "InCogNiTo124",
      "content": "> @Grumio#128774 A sad iskreno nez, jel me taggas zbog mog posta o doxxanju i stalkanju ili nekog drugog razloga, tbh malo sam **pofuren**.\n\nJel to kao ljut ili povrijeden? Dotepenci ne znaju bas purgerizme",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Grumio"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "128785": {
      "poster": "Grumio",
      "content": "@InCogNiTo124#128781 Probaj vise sa spaljen",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "128787": {
      "poster": "Bucc (Olive Oil)",
      "content": "@Grumio#128774 ma ovo ide u loop tak da je tvoja kritika loša. Ovo za snimanje je noted, ali pošto sam na kraju odlučio crtat MIDI i tu si onda u krivu. Ovo gdje se note šamaraju i diraju to je planirano, uz čisti sine wave zvuči kak se spada, ali ova distorzija koju nisam planirao to sve pošeremeti. \n\nPro tip ako ne možete svirat, crtajte MIDI.\n\nU igrici sumnjam da je želja onome koji smišlja soundtrackove da žele da ode u razradu onda bi to bio kao kraj",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "128791": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "Prvo pofuri covjeka tagiranjem, onda ga unisti cinjenicama - @Bucc's on the fire",
      "votes": {
        "upvoters": [
          "Bucc (Olive Oil)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobinator",
          "Bucc (Olive Oil)",
          "Grumio",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Mioch",
          "NekocBraca",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "pitroid",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "128792": {
      "poster": "InCogNiTo124",
      "content": "@iLabaviUmeDaZabavi#128791 nemoj ga gasit vodom ni u ludilu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Bobinator",
          "Bucc (Olive Oil)",
          "Emma63194",
          "Grumio",
          "Mioch",
          "NekocBraca",
          "Svarog (Veles)",
          "ZvonkoSisoje",
          "feel_d_boot (iNut)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "129407": {
      "poster": "Vamonos (Idemo)",
      "content": "Kupujem jedrilicu, montiram solarne panele, elektricni motor i desalinator pa pravac za Karibe. Hranim se ribom lovljenom podvodnom puskom. Tnx bye",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "Jezza (Clarkson)",
          "Mioch",
          "NekocBraca",
          "RS7",
          "Red_Baron",
          "Svarog (Veles)",
          "[deleted]",
          "gladiator",
          "kix7 (Fish99)",
          "mAcaLukas (mAca Lukas)",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "179474": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Hopefully soon, samo da se vrijeme popravi\n\n![](assets/2021-04-27/00010.jpeg)",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "Vishnjevac",
          "[deleted]",
          "amnael",
          "iNavy (mornar Ica)",
          "tekamolo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "211308": {
      "poster": "InCogNiTo124",
      "content": "Napravio sam reinforcement learning agenta koji igra belu!\n\nza to, trebo sam napraviti odmah i cijeli game engine za belu!\n\nali to nije sve, slozio sam arhitekturu softvera tako da mogu povezat vise razlicitih igrača na jedan \"mozak\" koji time onda uči puno brže.\n\nnazalost jos nisam stigo implementirat ljudske igrače pa mi nemrete agenta isprobat ručno. just trust me lol\n\nali kod je ovdje https://github.com/InCogNiTo124/BelaBot\n\nkrenuo je ko super lijepo tipizirani python al onda je preraslo u boze pomozi xD\n\njednog dana(tm) napravit cu malo refactoringa i pocistit kaj imam i mozda slozit neki readme s rezultatima idk",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Hrvoje (Hrvoje45)",
          "Mikki",
          "Mrcina (Yoso)",
          "NekocBraca",
          "Red_Baron",
          "Stimmar",
          "Svarog (Veles)",
          "Vishnjevac",
          "[deleted]",
          "amnael",
          "aperture",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "kix7 (Fish99)",
          "mAcaLukas (mAca Lukas)",
          "orange",
          "pipi (cicipjorica)",
          "spampers (majmunska boginja)",
          "tata (NISAM ASISTENT)",
          "tito",
          "turunturu (Cement)",
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "211324": {
      "poster": "Svarog (Veles)",
      "content": "@InCogNiTo124#211308 \n\n![](assets/2021-06-22/00028.png)",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Emma63194",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "NekocBraca",
          "Vishnjevac",
          "__builtin_popcount (std::popcount)",
          "amnael",
          "mAcaLukas (mAca Lukas)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "211326": {
      "poster": "Gussy (huba buba)",
      "content": "@InCogNiTo124#211308 objektno u pitonu btj",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "211327": {
      "poster": "InCogNiTo124",
      "content": "@Gussy#211326 sori nisam naso nacin da u funkcionalnoj paradigmi simuliram belot game engine",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "211328": {
      "poster": "[deleted]",
      "content": "@InCogNiTo124#211308 \n\nKoliko ti je trebalo sveukupno vremena?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "211330": {
      "poster": "Gussy (huba buba)",
      "content": "@InCogNiTo124#211327 ne znam sto to znaci, znam samo da su mi klase u pitonu ružne",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "211331": {
      "poster": "tata (NISAM ASISTENT)",
      "content": "@InCogNiTo124#211308 sta znaci lijepo tipizirani python?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "kriino1"
        ],
        "tuga": []
      }
    },
    "211336": {
      "poster": "InCogNiTo124",
      "content": "@abcdefgh#211328 evo sad gledam, prije gotovo skoro godinu dana mi je bio prvi commit xD\n\nAl na tom sam radio sporadicno really, jedino eto zadnjih 2-3 mjeseca koliko sam mogo\n\n@Gussy#211330 seim tbh\n\n@tata#211331 a sa type hintovima, inace ih izbjegavam koristit al sad je bilo kao ajde budem bit ce mi lakse\n\nNije bilo bas toliko, vise sam problema imo sa deklariranjem dobrih tipova da me mypy ne jebe nego sto mi je pomoglo",
      "votes": {
        "upvoters": [
          "[deleted]",
          "tata (NISAM ASISTENT)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}