{
  "title": "[ALASUS] 2. laboratorijska vježba - 2019/2020",
  "creator": "Black_Mamba",
  "slug": "alasus-2-laboratorijska-vjezba-20192020",
  "tags": [
    "FER",
    "Alarmni sustavi",
    "Laboratorijske vježbe"
  ],
  "posts": {
    "7308": {
      "poster": "Black_Mamba",
      "content": "Kako ćete vi pisat izvještaj za ovaj 2. labos? U onom PDF dokumentu s weba nema nigdje mjesta predviđenog za pisanje. Da to sami u wordu napišemo ili?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8643": {
      "poster": "nikola",
      "content": "Valjda u wordu, s obzirom da nema bas dokument za izvjestaj ko za prvu LV",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8645": {
      "poster": "Black_Mamba",
      "content": "Poslao sam ja mail asistentici i rekla je u bilo kojem uređivaču teksta, bitno joj je samo da odgovorimo na sva pitanja.",
      "votes": {
        "upvoters": [
          "nikola"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8662": {
      "poster": "nikola",
      "content": "Btw jel Pi ispadne na kraju 0.5582 za ovaj 1.a) unos? I ak mos rec kak ti je ispadalo ostalo, da mogu usporedit kad zavrsim hahah",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8696": {
      "poster": "Black_Mamba",
      "content": "@nikola#8662 Da, u 1.a ispadne 0.5582. Ostali su meni ispali ovako:\n\n1.c 0.7427 i 0.5685\n\n1.d 0.6164 i 0.7327\n\n1.e 0.9313 i 0.3656\n\n1.f 0.9674\n\n1.g 0.5062 i 0.4183\n\n1.h 0.4399 i 0.5489\n\n2.b 0.798",
      "votes": {
        "upvoters": [
          "nikola"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8745": {
      "poster": "nikola",
      "content": "@Black_Mamba#8696 Sad zasad kolko vidim i kolko sam uspio provjerit svoje, dobio sam drugacije u f) i h) podzadatku, u f) se mijenja Pd za provjeru isprava s 0.4 na 0.9, srednja vrijednost prvih i drugih unutarnjih na 90s, njihove devijacije na 27s, i isto tako vrijeme za sabotazu na 240s i njezina devijacija na 72s, i s tim brojevima dobijem 0.9384, a u h) za promjenu L na drugim ulaznim vratima u 0 dobijem isti Pi ko da se nije nista diralo, a mislim da je razlog tome sto je vjerojatnost detekcije na tim vratima ionako 0, pa nema veze gdje se nalazi \"senzor\", aka nema ga, a kad se promijeni na prvim unutarnjim vratima dobijem 0.4399, a onda tek na drugim unutarnjim vratima je 0.5489, uglavnom valjda nam je isti h) samo si zaboravio napisat za L=0 na drugim ulaznim, ali ne znam zasto nam je pod f) drugacije",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8878": {
      "poster": "nikola",
      "content": "Jos nesto samo, jel znas mozda kako se dobije KTD? Znam da je uvjet Tr-Tg>0, ali sta gledam od ovih vremena koja su mi zadana? I ak si mozda rijesio na moodleu kviz ako mozes rec sta je bilo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8886": {
      "poster": "Black_Mamba",
      "content": "@nikola#8878 Ja sam to išao na način da gledam svaki Tr i uspoređujem s Tg i tamo gdje je Tr=Tg je kritična točka. Dakle nalazi se zapravo na prvoj prepreci koja Tr-Tg ima manji od nule. Jer na ni jednoj prepreci nije baš nula. Tako sam ja to skužio.",
      "votes": {
        "upvoters": [
          "nikola"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8887": {
      "poster": "Black_Mamba",
      "content": "@nikola#8878 A blic je bio dosta lagan, dva pitanja gdje moraš napisat odgovor i četiri na odabir. Evo ovako su išla:\n1. Opišite kako ste odredili kritičnu točku detekcije u prvom zadatku\n2. Gdje je bila kritična točka detekcije u drugom zadatku?\n3. Kako na PI utječe povećanje Pc --> povećava se PI\n4. Kako na PI utječe smanjenje vremena reakcije zaštitara --> povećava PI\n5. Kako na vjerojatnost prekida akcije napadača utječe povećanje vremena zadržavanja na preprekama prije kritične točke detekcije u odnosu na povećanje vremena zadržavanja na preprekama poslije kritične točke detekcije? --> povećava i prije KTD i poslije KTD, ali prije KTD manje nego poslije KTD\n6. Kako na vjerojatnost prekida akcije napadača (PI) utječe povećanje vjerojatnosti detekcije na preprekama prije kritične točke detekcije (KTD) u odnosu na povećanje vjerojatnosti detekcije na preprekama poslije kritične točke detekcije? --> povećava i prije KTD i poslije KTD, ali prije KTD više nego poslije KTD",
      "votes": {
        "upvoters": [
          "nikola"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}