{
  "title": "Razmatranja o svrsi foruma - vol. 1",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "razmatranja-o-svrsi-foruma-vol-1",
  "tags": [
    "Službeno"
  ],
  "posts": {
    "12923": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Itachi#12918 Ako želite privatnost od profesora, imate privatne poruke ili u većoj mjeri druge servise koji ju mogu i garantirati. Ovo je forum, dakle ekvivalent glavnog trga na kojem se javno raspravljalo - ako svoja nedjela želite sakriti od javnosti onda za to nemojte koristiti javni trg.\n\nBilo kako bilo, i vaša nedjela mogu biti korisna akademskoj zajednici koja će doći nakon vas, a onda je samo pitanja hoće li ih ona iskoristiti za samounaprjeđenje, ili opet nedjela - ali tu slobodu izbora ovaj forum ne regulira.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "Svarog (Veles)",
          "Sveti_Ilija (Sveti Ilija)",
          "[deleted]",
          "feel_d_boot (iNut)",
          "iva7740 (Mica Trofrtaljka)",
          "mAcaLukas (mAca Lukas)",
          "mentally_disturbed_llama",
          "noobcamper"
        ],
        "downvoters": [
          "in1"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12924": {
      "poster": "Fortius",
      "content": "@micho#12923 iskreno, ako ti počneš dijelit ljudima naše identite, a nadam se da nećeš jer si tak rekao u pravilima, to nebi bilo uredu. Također barem daj priliku da ovdje editamo postove ne da sad izbrišem nešto nego da editam a ne pišem opet novu poruku.",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Amali (Amajli)",
          "Bobinator",
          "Filemon",
          "Kushim",
          "Lyras",
          "Mioch",
          "[deleted]",
          "[deleted]",
          "feel_d_boot (iNut)",
          "in1"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12926": {
      "poster": "[deleted]",
      "content": "@micho#12923 \n\nti se poprilicno zauzimas za arhiviranje svega na materijalima za sljedece generacije, sto je naravno vrlo plemenito, ali jesi li se zapitao da mozda nitko vise nece objavljivati ovakve odgovore na bliceve, zadace i slicno buduci da su kao sto tvrdis, objavljena na javnom trgu? \n\nljudi bi voljeli pomoci kolegama ali ako za to moraju riskirati sebe onda ta volja naglo pada",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Amali (Amajli)",
          "Bobinator",
          "DazedAndConfused",
          "EstebanVihaio",
          "Jale (čakijale)",
          "Kushim",
          "feel_d_boot (iNut)",
          "in1",
          "zplusplus (gasaf)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12927": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Fortius#12924 Naravno da neću dijeliti vaše identitete, na kraju krajeva i ja poštujem zakon. To vam je na nivou da u vlastitim krugovima ne govorim tko je tko na forumu iako svi jako dobro poznaju tu osobu. Zamislite onda kako je to za ljude koje nitko ni ne poznaje, plus još prijezir da me netko s faksa pita ili zaprijeti da doxxam nekog - poslao bih ga u kurac a zajednicu bih svakako obavijestio o tom pokušaju.\n\nZnam da je trenutno edit kakav je, ali bolje je odgovoriti na poruku koja je usrana i popraviti je - na kraju krajeva taj odgovor se i vidi ispod objave. Inače možete i meni poslati poruku da nešto popravim ako se ne sjetite u tih 10 minuta. Nemojte misliti da me smetate itd., ja sam tu da služim vama i nemate se što brinuti jel mi previše posla - generalno nije.\n\n@Itachi#12926 Pa zašto bi riskirali? Najnormalnije objavite materijale nakon što je rok za predaju gotov. Ako jedinu vrijednost u dijeljenju materijala vidite u tome da prevarite sustav, žao mi je što vam to moram reći, ali niste prikladni za život, kamoli akademsku zajednicu.",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "Fortius",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "Svarog (Veles)",
          "Sveti_Ilija (Sveti Ilija)",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "futa125",
          "iva7740 (Mica Trofrtaljka)",
          "mAcaLukas (mAca Lukas)",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "jadzia-dax (Jadzia Dax)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "12929": {
      "poster": "Fortius",
      "content": "> @micho#12927 Naravno da neću dijeliti vaše identitete, na kraju krajeva i ja poštujem zakon. To vam je na nivou da u vlastitim krugovima ne govorim tko je tko na forumu iako svi jako dobro poznaju tu osobu. Zamislite onda kako je to za ljude koje nitko ni ne poznaje, plus još prijezir da me netko s faksa pita ili zapriketi da doxxam nekog - poslao bih ga u kurac a zajednicu bih svakako obavijestio o tom pokušaju.\n\nHvala zbog toga, ipak i ja želim imati dio svoje anonimnosti.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12930": {
      "poster": "[deleted]",
      "content": "> @micho#12927 Najnormalnike objavite materijale nakon što je rok za predaju gotov\n\nto ti nitko nece radit. ne znam jel se ti pravis ili stvarno ne shvacas da vecina ljudi koristi forum za prevarit sustav kako bi ti rekao a ne kako bi arhivirali nesto za sljedece generacije. tako je bilo i na starom forumu i tako ljudi nastoje opet radit ovdje, ali naravno da ih koci cinjenica sto je sve javno, nikome ipak nije svejedno.",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Amali (Amajli)",
          "DazedAndConfused",
          "McKovalski",
          "in1",
          "lup"
        ],
        "downvoters": [
          "feel_d_boot (iNut)",
          "iva7740 (Mica Trofrtaljka)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12931": {
      "poster": "lup",
      "content": "@micho#12927 ti kao da ne kuzis zbog cega 90% ljudi koristi forum",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Amali (Amajli)",
          "DazedAndConfused",
          "Lyras",
          "McKovalski",
          "Mioch",
          "[deleted]",
          "in1"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Kamen",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ]
      }
    },
    "12932": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Itachi#12930 Okej, i to činite na svoju odgovornost. Ova platforma svakako ne stoji da bi se prevarilo sustav, nego da bi jedni drugima pomogli u studiranju na prikladne načine.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "McKovalski",
          "Svarog (Veles)",
          "Sveti_Ilija (Sveti Ilija)",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "iva7740 (Mica Trofrtaljka)",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12933": {
      "poster": "lup",
      "content": "@micho#12932 ako ne zelis da ljudi varaju na studiju, onda brisi postove gdje si pomazemo varati, jer inace samo dovodis vecinu foruma koji ne znaju za neprivatnost u laznu ideju da se ovdje varanje i prepisivanje tolerira",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12935": {
      "poster": "[deleted]",
      "content": "@lup#12933 slazem se. ako \"platforma svakako ne stoji da bi se prevarilo sustav\" zasto se na platformi dopusta varanje sustava?",
      "votes": {
        "upvoters": [
          "lup"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12936": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@lup#12933 Ali te vaše zablude proizlaze iz vaših pretpostavki koje su stvarno neutemeljene, ne iz toga što sam ja rekao ili iz toga za što forum stoji.\n\nJa kao treća strana stvarno nemam obavezu regulirati varate li vi ili ne. Pravila su da se držite zakona. Kodeks fakulteta ste valjda pročitali. Ja nemam nikakvu dobit iz toga varao netko ili ne, i ne sudjelujem u tome direktno isto kao što npr. WhatsApp ne sudjeluje u tome kad to radite preko njega.\n\nMislim, morate biti razumni, analogija ovoga bi bila kao da pokradete dućan, a kad vas uhvate se pravdate \"što onda postoji dućan u kojem mogu samo uzeti stvari ako ih ne smijem uzeti\". I nemojte govoriti za cijelu studentsku zajednicu, molim vas.",
      "votes": {
        "upvoters": [
          "AntonioB25 (Pleteni miš)",
          "Filemon",
          "Njet",
          "Svarog (Veles)",
          "Sveti_Ilija (Sveti Ilija)",
          "iva7740 (Mica Trofrtaljka)",
          "mentally_disturbed_llama",
          "sintetika (vandaLara)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12939": {
      "poster": "lup",
      "content": "@micho#12936 ti si stvorio forum koji je namjenjen za ljude koji su koristili fer3net, na tebi je njih obavijestiti ako ocekujes da se stvari vrse na drugaciji nacin nego sto su se vrsile na fer3netu. koristeci tvoju analogiju, to je kao da netko napravi drugu verziju trgovine gdje su ljudi smjeli krasti, i ne kaze im da sad vise ne smiju krasti u njoj",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Bobinator"
        ],
        "downvoters": [
          "sintetika (vandaLara)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12942": {
      "poster": "SonGoku (~~~~~~~~)",
      "content": "Krao sam, kradem i krast cu",
      "votes": {
        "upvoters": [
          "Bobinator",
          "BreadCat",
          "BrkMateaBeusana (Umarell)",
          "DazedAndConfused",
          "Dome",
          "Filemon",
          "Gussy (huba buba)",
          "Lyras",
          "MarokMarsci (Collapse Enjoyer)",
          "McKovalski",
          "Mioch",
          "Suki7",
          "Svarog (Veles)",
          "Sveti_Ilija (Sveti Ilija)",
          "Valentino",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "adrian7000",
          "feel_d_boot (iNut)",
          "hrljavi_caval (rljaviČaval)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "sintetika (vandaLara)",
          "steker",
          "steve (Mr_mr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "1vq",
          "Amariska",
          "Amon",
          "Bobicki",
          "BreadCat",
          "DazedAndConfused",
          "Dome",
          "EstebanVihaio",
          "Filemon",
          "Gussy (huba buba)",
          "Kamen",
          "Lyras",
          "M-16",
          "McKovalski",
          "Mioch",
          "Sans",
          "Semofcanec",
          "SinanSuckich (Yelena)",
          "SpekuraDebela (Šćap)",
          "Suki7",
          "SuperSjajan3",
          "Svarog (Veles)",
          "Vasili (Fasili)",
          "__builtin_popcount (std::popcount)",
          "bb8 (zaza)",
          "feel_d_boot (iNut)",
          "hrljavi_caval (rljaviČaval)",
          "iNavy (mornar Ica)",
          "lup",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "12953": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @lup#12939 ti si stvorio forum koji je namjenjen za ljude koji su koristili fer3net,\n\nKrivo, od fer3 se ograđujem jer je bilo toliko stvari krivo i kriminalno da se ne želim dovoditi u asocijaciju s njima. Forum je zatvoren jer je nekom od vas smetalo što ne igra po pravilima. Na kraju je skoro ispalo da sam ja kriv za to. Nebitno, sve u svemu ovaj forum nije napravljen da bi zamijenio fer3, ili pružao utočište kao FER3. Ja priznajem da je ideja bila dobra i da je tu bilo dobre volje, ali na kraju ste i sami vidjeli kako je to završilo. Mora da su glavešine prepisivale na kolegiju \"Kako voditi forum\". Ne kažem da sam ja išta pametniji, samo da se prošli forum ne bi trebao gledati kao neupitan standard izvrsnosti.\n\n> @lup#12939 na tebi je njih obavijestiti ako ocekujes da se stvari vrse na drugaciji nacin nego sto su se vrsile na fer3netu.\n\nPa i jesam. Rasprava se doslovno zove Smjer i korištenje foruma, a postoji i rasprava s pravilima. Mjere se određuju tako da se napiše ono što se ne smije, dok se ostale stvari gledaju kao dopuštene. U pogledu toga, vama je dopušteno na forumu raditi stvari koje su zabranjene kodeksom fakulteta, ali to je na vašu odgovornost. Ne shvaćam što više želiš od mene.\n\n> @lup#12939 koristeci tvoju analogiju, to je kao da netko napravi drugu verziju trgovine gdje su ljudi smjeli krasti, i ne kaze im da sad vise ne smiju krasti u njoj\n\nTvoja najveća zabluda je što smatraš da je ovo FER4. Ovaj forum nastao bi bez obzira na to postoji li FER3, jer je cilj bilo stvaranje platforme koja ima istu ideju kao FER3, ali puno bolju egzekuciju i najvažnije, nije ekskluzivan za FER. Govoriš kao da je FER3 bila zlatna krava, ali u isto vrijeme ne shvaćaš koliko je iskorištavao studente i prije svega osoblje, a gledaš na ekskluzivnost koju je pružao kao nekakvu zaštitu, a ne mjeru kojom se osiguravalo da moraš plaćati članarinu.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Njet",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "iva7740 (Mica Trofrtaljka)",
          "mAcaLukas (mAca Lukas)",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12957": {
      "poster": "lup",
      "content": "@micho#12953 ![](assets/2020-04-22/00036.png)\n\n![](assets/2020-04-22/00037.png)\n\nevo, procitao sve, nigdje ne pise da cijelom forumu moze pristupiti neprijavljena osoba. napisi to, i bit cu sretan. boli me kurac za fer3, smeta mi to sto tvoj polufunkcionalni forum ima vise od 10 korisnika upravo zato sto ljudi zele fer4, a nemas im jajca rec da to ovo nije i da sve sto ti zelis je provoditi svoju verziju fer3 voditeljstva, bez da fino pise u uputama sto ljudi mogu ocekivati. umesto toga trabuljas o tome kako \"planiras ovo prosiriti na sve fakultete drzave\"",
      "votes": {
        "upvoters": [
          "DazedAndConfused",
          "in1"
        ],
        "downvoters": [
          "angello2"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12961": {
      "poster": "Hrvoje (Hrvoje45)",
      "content": "> @lup#12957 polufunkcionalni forum\n\nako te bilo što smeta na forumu slobodno ga napusti, ali ga nemoj bezrazložno napadati i projicirati svoje probleme i nesigurnosti na forum i vodstvo, forum nije napravljen za tebe ili za ovih \"90%\"",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "Extended_mix",
          "Filemon",
          "NekocBraca",
          "Njet",
          "angello2",
          "feel_d_boot (iNut)",
          "in1",
          "iva7740 (Mica Trofrtaljka)",
          "jadzia-dax (Jadzia Dax)",
          "jobi (azex)",
          "mAcaLukas (mAca Lukas)",
          "mentally_disturbed_llama",
          "wutangfan (HugoStiglitz)"
        ],
        "downvoters": [
          "DazedAndConfused"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12987": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @lup#12957 evo, procitao sve, nigdje ne pise da cijelom forumu moze pristupiti neprijavljena osoba.\n\nOprosti, ali molio bih te da obratiš pozornost na to da pravilima pristup bez registracije nije zabranjen, stoga se podrazumijeva da svi imaju to pravo.\n\nTakođer, u članku 4. izjavio sam, citiram:\n\n> Svaki član akademske zajednice ima puno pravo sudjelovati u njoj.\n\novo puno pravo odnosi se na pravo glasa. Normalno da članovi \"bez prava\", dakle oni koji nemaju aktivan račun na stranici još uvijek imaju pravo na informaciju u pogledu objava i materijala, jer ja nisam u poziciji da im to onemogućim. Čak i da teoretski zabranim registracije, još je uvijek moguće slikati nešto na forumu i to dati nekom drugom, tipa profesoru SiS-a. Samo nastojanje da se nešto sakrije vodi do nevjerojatno kompliciranih i konvuliranih pravila. Nama to ne treba.\n\n> @lup#12957 smeta mi to sto tvoj polufunkcionalni forum ima vise od 10 korisnika upravo zato sto ljudi zele fer4, a nemas im jajca rec da to ovo nije i da sve sto ti zelis je provoditi svoju verziju fer3 voditeljstva, bez da fino pise u uputama sto ljudi mogu ocekivati. umesto toga trabuljas o tome kako “planiras ovo prosiriti na sve fakultete drzave”\n\nU redu, valjana primjena, i to je sada u pravilima. Na temu polufunkcionalnosti, trenutno sam ja jedina osoba koja se tehnički brine u forumu. Kolega @moose mi pomaže koliko može u moderiranju, to treba spomenuti, ali on nema ni dužnost ni obavezu brinuti o tehničkom aspektu.\n\nForum je open source, i visoko ekstenzibilan. Svakome tko se ponudio pomoći sam se odazvao i koliko sam kratko mogao objasnio oko čega mi treba pomoć. Ako netko želi popraviti ovu funkcionalnost, sa zadovoljstvom ću ih uputiti što bi bilo zgodno napraviti. Ja jednostavno balansiram između posla na kojeg u zadnje vrijeme rijetko idem jer sam zatrpan labosima, faksa kojeg ne želim pasti, rada za mentora i moderacije/programiranja za forum. Nisam svemoguć i trebat će mi vremena da napišem neka rješenja koja bi dovela forum do vrha.\n\nNe želim sad reći \"dobivaš ovo besplatno, šuti i ne seri\", ali ipak uzmi u obzir da možda tražiš previše od ljudske osobe. Ako nekome smeta nešto na forumu, pozivam ga da razvije svoje rješenje, i ako to stvarno popravi stanje i nema nekih sigurnosnih propusta, dodat ću ih na forum. Bez toga se sve svodi na to koliko ja imam osobnog vremena sam napisati te stvari, a vjeruj mi kad ti kažem da nisam pogledao film ili zaigrao igricu u posljednja 2 mjeseca i da konstantno nešto radim.",
      "votes": {
        "upvoters": [
          "Njet",
          "Sans",
          "Svarog (Veles)",
          "aperture",
          "lup",
          "mentally_disturbed_llama",
          "sintetika (vandaLara)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12999": {
      "poster": "lup",
      "content": "@micho#12987 vidi, kuzim da imas puno posla i ocito mi je dovoljno dobar taj polufunkcionalan forum da ga koristim, ali moras biti svjestan da ga ljudi ne bi koristili da ne postoji rupa koju je ostavilo zatvaranje fer3, stoga ne mozes bas trabuljat kolko si sam svoj majstor kao da nisi svjestan da bez rupe od fer3 ne bi postojao niti ovaj forum. ono, nisi zlatna koka, niti bog i batina, pa se malo spusti sa svog konjića i napisi kaj ocekujes od ljudi u pravilima a da ne moramo mi pogadati",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Amali (Amajli)",
          "Bobinator",
          "DazedAndConfused",
          "Mulder",
          "[deleted]",
          "in1"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13004": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @lup#12999 napisi kaj ocekujes od ljudi u pravilima a da ne moramo mi pogadati\n\nFora je što ja ništa od vas očekujem osim onog opisanog u pravilima. Nigdje u pravilima nisam rekao da sam ja vaš zaštitnik ili što već.\n\nA i ne morate pogađati, tema s pravilima nije zaključana i svako može postaviti pitanje. Na kraju krajeva ovu cijelu raspravu ću premjestiti u novu raspravu da ne smeti ovdje.",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13069": {
      "poster": "BrkMateaBeusana (Umarell)",
      "content": "@micho Pa može li se kako zaključati, barem FER dio za one neregistrirane? Iskreno, ne razumijem se ni u forume, a pogotovo u ovaj Flarum, ali znam da većina foruma ima tu opciju da se barem dio zaključa neregistriranim?",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "DazedAndConfused",
          "Gulbash",
          "Jale (čakijale)",
          "Mioch",
          "hrljavi_caval (rljaviČaval)",
          "in1",
          "zplusplus (gasaf)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13073": {
      "poster": "Amali (Amajli)",
      "content": "@BrkMateaBeusana#13069 moze se zakljucati, kao sto se dio Opusteno zakljucan, ali je rekao da ne zeli to raditi iirc",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)",
          "in1"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13086": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@BrkMateaBeusana#13069 Može ali to nije poanta\n\nKao što je Amali rekla, ja sam to racionalizirao činjenicom da ovo nije underground forum, ne skrivamo se od nikoga niti radimo nekakav elitizam, a Opušteno sam sakrio radio privatnih podataka i sigurnosti.\n\nInače bih jako rado da mogu i Opušteno ostaviti vidljivim, ali Opušteno je opušteno, mozak na pašu, a u takvom slučaju se onda i ja valjda moram opustiti, neću moći stalno skenirati da pazim na sigurnost.",
      "votes": {
        "upvoters": [
          "aperture",
          "iva7740 (Mica Trofrtaljka)"
        ],
        "downvoters": [
          "Bobinator",
          "Lyras",
          "in1"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13110": {
      "poster": "[deleted]",
      "content": "Hmmm ne kužim poantu rasprave pa i na prošlom forumu je bilo hrpetina ljudi sa faksa",
      "votes": {
        "upvoters": [
          "NekocBraca",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13113": {
      "poster": "Gussy (huba buba)",
      "content": "@micho#13086 problem koji vidim u tome nije da se nemamo od koga skrivati, nego što netko može doći i čitati stvari koje se objavljuju, koje nisu niti prepisivanje, nego makar kritika prema nekom profesoru koju on može uzeti za zlo i naštetiti studentima. Mislim ovo je neki random primjer, ali stvar je u tome što je jedina stvar koja štiti našu anonimnost tvoja riječ da se nikad neće dijeliti naše informacije, u što uopće ne vjerujem da bi ikad napravio.  Međutim, bar ja bih volio da ima još jedna zaštita naše anonimnosti a to bi do jedne mjere bilo zaključavanje foruma, što se može protumačiti kao nekakav elitizam, ali ljudi koji jesu na forumu znaju zašto je zaključan na prvom mjestu.\n\nrealno, teme na predmetnom dijelu nisu samo teme iskljucivo o gradivu. ako nešto treba biti javno dostupno, onda jedino što vidim kao takvo su materijali.",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "Ak08 (obama)",
          "Amali (Amajli)",
          "Bobinator",
          "Dome",
          "EstebanVihaio",
          "Jale (čakijale)",
          "JoKing",
          "Lyras",
          "M-16",
          "Mioch",
          "Mulder",
          "SinanSuckich (Yelena)",
          "SuperSjajan3",
          "Svarog (Veles)",
          "batman",
          "in1",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "steve (Mr_mr)",
          "zplusplus (gasaf)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13118": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Gussy#13113 Sve to stoji, samo nije kao da se to ne može na drugi način dogoditi. A i uostalom to su problemi koje treba riješiti izvan foruma.\n\nShvaćam ja zašto ljudi žele zaključavanje, al to je jako izvan vizije ovog svega. Jer ako garancija anonimnosti s moje strane nije dovoljna, onda bilo tko infiltriran u sustav može načiniti istu štetu. A i druga stvar, radi plana integracije više foruma kao jedan, tj. slobodne tranzicije studenata npr. FERa na forume npr. FESBa, takvo što nije realno. Cijeli taj sustav je jedan veliki projekt koji ima toliko pravila samo da koliko-koliko zadovolji jedan zahtjev, a opet ima iste probleme.\n\nNaravno ja sam otvoren za dijalog oko toga i općenito za poboljšavanje sigurnosti i anonimnosti, ali zahtjeve da se poveća anonimnost kako bi se pružila zaštita onima koji krše neka pravila ne mogu shvatiti ozbiljno. Nije to do toga da ja želim da netko najebe, već ja primarno kao student FERa ne mogu pružiti platformu čija je svrha zaobići konsekvence za kršenje statuta.\n\nOvo s profesorima je stvarno valjana primjedba, ali podsjećam, na starom forumu je postojalo jedino pravilo da kritike trebaju biti konstruktivne. Ja sam samo izbacio element \"trebaju\" jer ni ja ni bilo tko drugi ne može prosuđivati o tome je li kritika konstruktivna - ona to jest ili nije, a to je vidljivo ako pomoću nje može nastati bolja situacija. Ako usprkos tome netko napiše nešto što nije praktički napad na osobu, a profesor mu se osveti, ili kolektivno studentima, nema garancije da to ne bi mogao učiniti na privatnom forumu bez istih konsekvenci. To se treba riješiti s tim profesorom privatno ili upoznati fakultet s tim. Uostalom, bilo je takvih kritika i nisam upoznat sa slučajem da je netko radi toga nagrabusio.\n\nJa ne pokušavam riješiti te eksterne probleme, niti mislim da bih trebao. Nisam policija.",
      "votes": {
        "upvoters": [
          "Gussy (huba buba)",
          "aperture",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13137": {
      "poster": "pitroid",
      "content": "Kao prvo, pohvala da uopće imamo novi forum, iako vjerojatno nikada neće zaživjeti u punoj mjeri kao fer2. Danas pored YT, fejsa, WAppa i sličnih platformi forumi uvelike gube svrhu za većinu ljudi.\n\nFer2 je nastao u nekim drugim vremenima, kad si online mogao pisati što god ti je palo na pamet, kad je forum bio jedina društvena mreža, kad je zakon gotovo nikako kontrolirao online područje, a čak i da je došlo do nekih online sranja, teško se moglo dokazivati to na sudu itd. Danas su te stvari puno sređenije i online vrijede isti zakoni kao offline. Osobno sam žalostan da je Internet doživio toliku transformaciju i postupno se uništila anonimnost i sloboda govora, ali kako svaka budala danas koristi Internet, očito tako i mora biti. \n\nFer2 je oduvijek bio javna tajna FER-a, a i profesori su nerijetko govorili \"taj udžbenik ćete teško nabaviti, ali skinite s onog vašeg fer2, nisam vam ja to rekao\".\n\nŠto se tiće javnosti sadržaja, osobno bi mi bilo draže da je i predmetni dio zatvoren i ugodnije bi bilo nešto napisati tamo, ne znam koliko bi ljudi van našeg faksa (a uvijek ima raznih zlonamjernika) trebali vidjeti kakve mi zadatke dobivamo, tko je što u kojem kontekstu kritizirao i sl. Ipak smo mi jedan community i nije sve za javnost. Ja sam preko pola faksa riješio i mogao bih reći nije moja briga, ali sjećam se koliko je na prvoj godini pomoglo sve što smo imali sakupljeno. Na kraju, inženjerstvo je timski posao.\n\nRješenja iz nečega me osobno uvijek bilo strah objavljivati prije nego dođe rok za predaju, jer su se redovno našli oni koji bi doslovno prepisali bez da išta promijene ili shvate i često je bilo problema s disciplinskom oko toga, ali uvijek sam pomagao oko konkretnih pitanja o nekom zadatku. Najlakše je registrirati se na forum, nikad ništa objaviti i samo kopirati cijela rješenja jednom kad dođu i žaliti se na forum, a puno korisnika je bilo upravo takvih, registriranih isključivo u svojstvu \"leechera\".\n\nNa kraju, sve strane u ovoj raspravi su u pravu iz svoje perspektive, a admin svemu pristupa s dozom opreza.",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "Amali (Amajli)",
          "Bobinator",
          "Dome",
          "EstebanVihaio",
          "Filemon",
          "Gulbash",
          "Gussy (huba buba)",
          "InCogNiTo124",
          "Jale (čakijale)",
          "LookAtThatBooty (Đurđeva bizarna avantura)",
          "M-16",
          "Mioch",
          "Sans",
          "SinanSuckich (Yelena)",
          "[deleted]",
          "adrian7000",
          "futa125",
          "hrljavi_caval (rljaviČaval)",
          "in1",
          "lup",
          "maPre",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "moose (sugar BoOo!!)",
          "rija"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13171": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "E da, da se ne čini kao da su stvari nepromjenjive:\n\nJednog dana, kad se sredi sustav materijala kako sam pričao na prošlom forumu - dakle git(hub) koji je preko foruma moguće uređivati, struktura cjevovoda u 3 faze za materijale, i kad se korisnike bude moglo integrirati u to umjesto da se znanje prosipa po raspravama, onda možemo pričati o \"privatizaciji\".\n\nProblem je što je puno postupaka u raspravama i onda se dogodi sranje s fer3: nestane forum, nestane veliki dio znanja. Kad bi materijali bili sređeni i kad bi se mogli tako uređivati, elegantnije, onda ne bi uopće trebali nuditi neke naše ferovske razgovore apsolutnim strancima. Isto tako, sama objava materijala bi bila privatnija, znači ne mora se netko tko je totalno fer objavio nešto bojati da će nastradati jer je netko zlorabio njegov labos, zadaću.\n\nFilozofija oko takvog sustava je: ako su ljudi tu samo radi znanja, imaju materijale, ako su tu radi tračeva i razgovora nek se uključe u zajednicu.\n\nTako da nije sigurno da će stvari ovako ostati, pogotovo ako kao zajednica sredimo te neke naše mušice. Sređeniji sustav garantira i više slobode i više sigurnosti bez kompromisa ijednog od njih. Ne kažem da je ovo lagano, upravo naprotiv, mislim da je brutalno teško, ali u ovo doba, za razliku od prije 15 godina kad je FER3 nastajao, manjak ljudske volje i sposobnosti možemo kompenzirati umjetnom inteligencijom koja nam može pomoći uređivati zajednicu.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "futa125",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13180": {
      "poster": "LookAtThatBooty (Đurđeva bizarna avantura)",
      "content": "@micho#12936 Nije li da kodeks fakulteta nalaže da se za tzv. 'prepisivanje' kažnjavaju obje stranke tj. prepisivač i oni koji su 'omogučili' da se od njih prepisuje?\n\nPrije ove karantene bi taj slučaj bio jednostavan jer se obično radi samo o dvijema osobama u istoj prostoriji.\n\nDa je u pitanju neka javna platforma poput FB-a, WhatsAppa itd. jednostavno je zaključiti da te platforme ne bi bile odgovorne za to.\n\nAli, koliko ja mislim i ispravi me ako nije točno, ovaj forum nije baš javan (zahtjeva @fer.hr mail) i direktno je povezan za fakultetskom opremom ili je na neki drugi način ovisan o opremi/prostoru/dopuštenju fakulteta.\n\nMisliš li da se izlažeš riziku od fakultetskog vijeća kao de facto poslužitelj tih malicioznih komunikacija?\n\nEDIT: ovo pitam primarno jer će se međuispiti nekih predmeta odvijati online, a potpuno osiguravanje od prepisivanja još nije osmišljeno.\n\nEDIT2: Puno sam promašio, informacije nisu točne, fake news.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13183": {
      "poster": "Gussy (huba buba)",
      "content": "@micho#13171 Možda da postoji kao neki tag na objave tipa \"Materijal za učenje\" ili nešto slično, koji možeš dodati na post o bilo kojem predmetu.\n\nNpr.\n\nKako napraviti Laplaceovu transformaciju \n\ntagovi: Matematika 3(ili što je već sad po Fer3 programu), Materijal za učenje\n\nTi postovi koji imaju tag Materijal za učenje mogu biti dostupni bez prijave na samu stranicu, tako bi se odijelili sami materijali od ovih diskusija o samom predmetu, i naravno, sam github repo materijala treba biti javno dostupan.\n\nTe objave može napraviti bilo tko, npr. vidiš da je netko nešto jako dobro objasnio, možeš kopirati to i objaviti post sa tagom Materijal za učenje itd. itd.\n\nNaravno ne znam koliko je teško napraviti nešto ovakvo i bi li trebalo biti konačno rješenje, ali mislim da je bar privremeno ovo dobro ako je uopće moguće bez neke prevelike zajebancije za tebe.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "in1"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13184": {
      "poster": "InCogNiTo124",
      "content": "@micho#13171 mozda sam glup i ne znam trazit, ali postoji li negdje nekakav roadmap oko ovog foruma? ne nuzno sad \"do kraja petog imat cemo funkcionalni edit\", i ne bas sad neki trello workspace sa taskovima, al kao popis na cemu se radi i kaj ide iduce i kam to sve vodi i kj se jos treba napravit? iz cijele rasprave sam skuzio da se ljudi zale na trenutno stanje koje ce se mozda promjeniti, a to isti ljudi ne znaju",
      "votes": {
        "upvoters": [
          "Gussy (huba buba)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13186": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@LookAtThatBooty#13180 What?\n\nForum je hostan na Hetzneru, financiram ga isključivo iz vlastitog džepa i nemam nikakve veze s faksom. Za mene su profesori profesori, za njih sam ja student.\n\nForum generalno zahtijeva akademski mail. Trenutno to znači da se može pridružiti bilo koji pripadnik akademske zajednice, ali nisam siguran koliko će to potrajati jer mislim da, iz tehničke perspektive najprije, nije realno pružati uslugu za potencijalno 100k ljudi na jednoj mašini.\n\nMožda se ja izlažem tom riziku, ne znam, no o tom po tom. Generalno ne mislim da ima temelja da budem sankcioniran zbog prirode posla kojeg obavljam, ali eto, ako bi netko volio vidjeti jel moguće nek pokuša, napravit ćemo dramu :)",
      "votes": {
        "upvoters": [
          "Gussy (huba buba)",
          "Johnny_Bravo (a beautiful and unique snowflake)",
          "LookAtThatBooty (Đurđeva bizarna avantura)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13194": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@InCogNiTo124#13184 Samo u Smjer i korištenje foruma\n\nnisam htio raditi nekakav roadmap kad nisam u stanju garantirati deadlinee. Bio sam rekao da će prije 2 tjedna još biti napravljeno praćenje foruma i filtriranje po 2+ tagova, ali eto ne stignem.\n\nMislim trenutno je to u fokusu, dakle\n\n- proširenje za praćenje predmeta (više od samih obavijesti)\n- proširenje za filtriranje po 2+ oznake\n\nNakon toga, bacamo se na materijale, dakle freeze developmenta i izrada specifikacije i preformatiranje materijala. Ovo procjenjujem da bi potrajalo do jeseni, sigurno ne bi bilo gotovo do kraja semestra.\n\nU međuvremenu bi se sređivao izgled foruma, počevši s čitljivijim fontovima, konvergencijom prema puno logičnijem interfaceu. Ovaj interface je okej, ali ima dosta mana. Treba uskladiti boje, veličine, pozicije stvari i dodati mogućnost podešavanja (npr. teme). Mislim da na mobitelu čak i izgleda prilično dobro, ali dekstop verzija bi se mogla itekako poboljšati.\n\nNakon toga je jedan veliki projekt stvaranja sustava za materijale. Ovo bi bilo toliko veliko da bi se to proširenje vjerojatno licenciralo, pa bi se od toga mogao i financirati forum. U svakom slučaju, to je već predaleko da dajem predodžbe kad i kako. Moj osjećaj je da bi moglo biti do kraja godine, ali da se ne računa na to.",
      "votes": {
        "upvoters": [
          "Gulbash",
          "Gussy (huba buba)",
          "InCogNiTo124",
          "indythedog",
          "mAcaLukas (mAca Lukas)",
          "mentally_disturbed_llama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "13198": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Gussy#13183 Da al onda bi skoro sve tak trebalo biti označeno. Razmišljao sam o tome, fakat jesam. Ono što mislim raditi je da ću na kraju semestra napraviti masivni dump tema u CSV, pa ću na osnovu goreglasova sortirati po važnosti i te stvari stavljati u WIP folder na materijalima, dakle nešto što se treba obraditi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25460": {
      "poster": "noobcamper",
      "content": "Može li netko, malo prije nego što objave na službenim stranicama fer-a, objaviti kada će biti koji ispit kao što su nekad prije neki dobri ljudi objavili fer3netu?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25462": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@noobcamper#25460 To je radio wolfman i on je bio na kampusu (alpha testu ovog), ali sad ne znam je li tu više",
      "votes": {
        "upvoters": [
          "Filemon",
          "__builtin_popcount (std::popcount)",
          "noobcamper"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}