{
  "title": "D&D",
  "creator": "BedaTheNic",
  "slug": "dd",
  "tags": [
    "Opu코teno"
  ],
  "posts": {
    "22345": {
      "poster": "BedaTheNic",
      "content": "Igra캜i i DMs. Sherajte svoja iskustva, ideje i sli캜no tako da ih mogu besramno ukrast za svoju skupinu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "22347": {
      "poster": "lup",
      "content": "vec 5 puta u zadnjih boga mi 7 godina mi razni frendovi dolazili \"haha mogli bi igrat dnd, to je tako dobro i zabavno\" ja napravio lika svaki put, do dana danasnjeg nijedan session igre nisam odigro",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Amali (Amajli)",
          "Amon",
          "Anonimity (BoJack)",
          "Ducky",
          "Filemon",
          "Johnny_Bravo (a beautiful and unique snowflake)",
          "Mioch",
          "NekocBraca",
          "Svarog (Veles)",
          "laranotreallycroft",
          "tintintintin"
        ]
      }
    },
    "22348": {
      "poster": "BedaTheNic",
      "content": "@lup#22347 \n\nPocni ti DMat. Krenete igrat i sve ove likove koje si napravio konacno mozes igrat",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "22349": {
      "poster": "lup",
      "content": "@BedaTheNic#22348 e tolko mi se bas ne igra",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "BedaTheNic",
          "Ducky"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "22353": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "igrao sa par grupa, sve frendovi i homebrew. najveci problem je dogovaranje sessiona, cim jedan ne moze ostatak grupe isto odjednom \"ne moze\" i onda predje sa 2 puta tjedno na 2 puta mjesecno na 2 puta godisnje i ode sve k vragu.\n\ntrebao sam sad krenut sa jednom hc grupom irl u zg, al prvi session nam je trebao bit taman kad je korona udarila tako da better luck next time\n\nosobno mi je dnd uvijek bio autistic nerd shit s kojim se nisam htio povezivati, al' sam uvijek htio probat. na kraju mi se svidio puno vise nego sto zelim priznat i osobno mislim da je puno bolji od bilo kakvih RPG igara na kompjuteru\n\npar tipova za pocetnike:\n\n-dnd nije predmet na faksu, ne moras znat sve napamet, pravila su i onako okvirna i sve je na dmu\n\n-ako zelis roleplayat, do it, ako ti je neugodno, nemoj. nismo svi mercer i ekipa da nam je posao da budemo voiceactori\n\n-ako ti je prvi put i/ili nisi jos siguran kako sta, pitaj dm-a, on ti je najbolji prijatelj (pogotovo ako ti stvarno JE najbolji prijatelj haha)\n\n-znam da zelis napravit edgy rougea sa mrtvim roditeljima i sexual abuse proslosti, al' nemoj, to svi rade i nije kul\n\n-ako ti se ne da igrat, kul, ne moras, nemoj zrtvovat svoje vrijeme igrajuci nesto sto ne zelis samo da udovoljis drugima\n\npar tipova za dmove pocetnike\n\n-bolje je imati party od 3 lika s kojim ces moc izgurat pricu do kraja, nekgo clusterfuck sa 8 igraca koje nikad vise neces moc skupit zajedno\n\n-znam da si gledao critical role i zelis imat sick propove za battle mapu, ali za pocetak ti je dosta par komada a4 papira i kovanice kao tokeni\n\n-ne mora ti prvi session ikad bit homebrew, odigraj neku prebuilt pricu, pohvataj neke stvari prvo\n\n-ako ti je kampanja homebrew, nemoj zaboravit, pricu pricaju tvoji igraci, a ne ti, ti postavljas svijet oko njih, a oni ga pretvaraju u pricu. ako zelis pricat epske price onda kreni pisat knjigu\n\ni dva zlatna pravila:\n\n-nemoj prepricavat svoje DnD dogodovstine random ljudima, pa cak i ako kazu da ih dnd zanima, nikog nije briga\n\n-U콯IVO JE [imath] \\infty \\times[/imath]  BOLJE OD BILO KAKVOG ONLINE SERVISA\n-",
      "votes": {
        "upvoters": [
          "Amon",
          "BedaTheNic",
          "BreadCat",
          "Filemon",
          "G-bear",
          "Grumio",
          "KitKat (H(x))",
          "feel_d_boot (iNut)",
          "lup",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "Filemon",
          "NekocBraca"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "22358": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "O캛RT Teams D&D kampanja when?\n\nMiljacko ne smije bit DM jer ovdje ima dovoljan power trip",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Ducky",
          "Filemon",
          "KitKat (H(x))",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "potemkin (meriMerino)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "Dome",
          "Filemon",
          "G-bear",
          "M-16",
          "Mioch",
          "NekocBraca",
          "RS7",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "iNavy (mornar Ica)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "22454": {
      "poster": "G-bear",
      "content": "@MarokMarsci#22353 \n\n> @MarokMarsci#22353 -nemoj prepricavat svoje DnD dogodovstine random ljudima, pa cak i ako kazu da ih dnd zanima, nikog nije briga\n\nZovem bullshit na ovo. Sve zanima D&D i htjeli bi igrati, ali se srame jer su normieji i boje se sta ce selo rec.\n\nI roleplayjanje je 100 puta zabavnije od powerplayjanja. Mozes kao neki 10-godisnjak citati online tutorijale da bi napravio najbolji build, ili mozes napraviti lika kojeg zelis neovisno koliko ga sjebes ali je unikatan, zanimljiv i vrlo zabavan za igru. Kao DM sam uvijek nagradjivao kreativnost i pomogao takvom zanimljivom liku nego nekom powerplayjeru. \n\nRecimo, sorceres koji muca. Kad god casta caroliju mora baciti \"mucanje check\" da vidimo da li je uspjesno uspio izreci caroliju. Ili rogue koji ima jednu nogu kracu, pa mu njegov dexterity ne pomaze previse. Ili barbariana koji ima 65 godina pa mu strength nije vise nesto, a i ni citat ne moze. Ili crnca pa ga nitko ne voli. Ili rogue koji se boji visina... Skuzili ste poantu.\n\nTakodjer sam nagradjivao kreativan i zanimljiv background. Tipa, warrior koji apsolutno mrzi orke i sa zarkom zeljom ih zeli sve pobiti, samo da bi slucajno saznao da je half-ork jednom kad je slucajno skinuo kacigu pored jezera i vidio svoj odraz. \n\nIli barbariana kojem je obitelj stradala dok je otisao u sumu po drva i jedini trag koji ima su otisci kopita po njegovom vrtu, pa ode u rage (barbarian skill) svaki put kad vidi kopita i ne moze se obuzdat jer PTSP. Taj barbarian je roleplayjan kao warrior sve dok ne vidi kopito nakon kojeg aktivira rage i obicno bih mu dao da rage traje do kraja bitke a ne samo par turnova kao po pravilima. I svako malo bih ubacio nekakvo kopito u igru, cist da ga trigeriram. Jadni kentauri, ni ne znaju zasto ih ovaj ludjak proganja kad god ih vidi.\n\nNecromancer koji zeli svu moc svijeta je dosadan. Lik koji studira za necromancera jer zeli oziviti ljubav svog zivota je vec bolji, ali i dalje meh. Lik koji studira za necromancera jer zeli ozivjeti brata i pitati ga koja je sifra za njegov laptop ili svog oca jer se ne slaze s oprostajnim pismom i zeli da ga ovaj promijeni je fora.\n\nPosto ti svi likovi imaju nekakve drawbackove, nagradjivao sam ih u drugim aspektima igre, nesto sto bi u Fallout igrama bio luck. Pa bi nekad imali posebne encountere gdje bi dosli do nekog itema koji im pase. Ili bi ih prvi critical udarac promasio, itd. \n\nTl;dr: D&D je zabavniji s kreativnom ekipom koja se ne shvaca preozbiljno. Cilj je zabaviti se, ne biti najbolji.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Amon",
          "Anonimity (BoJack)",
          "BedaTheNic",
          "Dome",
          "Ducky",
          "Filemon",
          "KitKat (H(x))",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "hrljavi_caval (rljavi캛aval)",
          "mAcaLukas (mAca Lukas)",
          "tintintintin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "22508": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "> @G-bear#22454 Tl;dr: D&D je zabavniji s kreativnom ekipom koja se ne shvaca preozbiljno. Cilj je zabaviti se, ne biti najbolji.\n\ntocno to, minmaxeri idu svima na kurac, ako zelis racunat do savrsenstva idi dizajniraj pojacalo il nes",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "G-bear"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "22532": {
      "poster": "G-bear",
      "content": "@MarokMarsci#22508 Postoje gomile buildova koji su prezabavne. Ranger koji se boji ptica, sourceres cije pleme je specijalizirano u water bending koji se boji riba, rogue koji se boji mraka, druid koji je alergican na pelud, rogue kojeg pece savjest kad god nesto ukrade. Samo neki koji su mi sad pali na pamet. Buildati lika bez osobnosti koji one hit killa sve sa svojim macem je predosadno i gubljenje vremena kad postoji toliko kombinacija gdje ti je samo masta granica.",
      "votes": {
        "upvoters": [
          "Anonimity (BoJack)",
          "KitKat (H(x))",
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "22535": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "Dungeons & Dragans - kampanja gdje Srbi zauzmu Zagreb i idu istra쬴vati tamnice ispod Medvedgrada. Nema HP-a, ali mora코 konstantno piti rakiju i ako ti BAC padne na 0 otrijezni코 se i prijavi코 samog sebe na ha코ki tribunal",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "otacon (senpai)",
          "potemkin (meriMerino)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Amon",
          "Anonimity (BoJack)",
          "Dome",
          "Ducky",
          "Filemon",
          "G-bear",
          "KitKat (H(x))",
          "Mioch",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "laranotreallycroft",
          "otacon (senpai)",
          "tintintintin"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "22582": {
      "poster": "G-bear",
      "content": "@mAcaLukas#22535 Homebrew pravila opcionalna. Rakija nije.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "BedaTheNic",
          "Ducky",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "NekocBraca",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "24493": {
      "poster": "Grumio",
      "content": "Iskreno te코ko je uklopit D&D i faks. Ja sam nadobudno i코ao okupit ekipu random ljudi i uspio se dogovorit oko sessiona. Session je dobro prosao barem kolko se meni 캜ini, ali na pripremi za taj session i na sami session sam potrosio cijeli vikend. 캛ak sam i koristio gotov modul (ja sam ina캜e dosta te코ki preper 코to se ti캜e DM-anja, a preferiram homebrew). Sku쬴o sam da zato 코to sam relativno lo코 student nemogu jo코 i DM-at. Bilo mi je te코ko javit toj ekipi da mi je vremenski problem jer jos uvijek imam osje캖aj da sam podbacio. Nadam se da 캖e stiska govana popustit barem malo na diplomskom.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Ducky",
          "Nabas",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Amali (Amajli)",
          "Anonimity (BoJack)"
        ]
      }
    },
    "24980": {
      "poster": "Amali (Amajli)",
      "content": "@Grumio#24493\n\nVelki F\n\nMi igramo PF1, gotove module, sad smo na jednoj gotovoj kampanji, al malo nas je korona zaustavila a couple sessions in.\n\nTbh vise ne znam kako moja DMica stoji s kolicinom predmeta jer ima neke druge upise, mozda trece?, ali uspijevala je pripremati sessione (msm nismo bogznasto preredovno igrali jer nas je bilo malo tesko okupit sve pa je tu i tamo netko falio, a ponekad i vise ljudi, i ovisno o tjednu semestra smo imali cesce ili manje cesto, u prosjeku svaki tjedan osim za ispite i blagdane cu sad puknut), a uspijevala je i druga DMica (koja je par puta bila da prva DMica isto igra) koja ima cijelu godinu upisanu redovno. Obje su na pdp rn, first time DMs ko kak smo mi svi ostali first time players (jos ovaj semestar smo izmijenili dva clana za dva svjeze first time playera), krenuli smo svi osim DMica igrat prvi put prosli semestar. :shrug:\n\nKoliko cesto ste vi mislili igrati? Msm mi smo svi dosta chill oko toga i sam gledamo kad tko moze (DM si uracunava u dane kad moze da do tad moze i spremit session I guess), ak se ne moze taj tjedan jebiga gledamo dalje. Mozda tu igra ulogu cinjenica da smo se skoro svi visemanje nekako poznavali od pocetka, nitko nije bio nepoznat citavoj grupi (ne znam jel ti to znaci random?).\n\nOsim ak ti je bas previse vremena otislo na to sve u komadu, nisam sigurna koji je proces pripreme mojoj DM, al malo pomalo kad se stigne kroz tjedan/tjedne prije sessiona mozda? Tak mi se cinilo da kad stigne crta mape i valjda usput cita kaj se desava. Ti se onda vise pripremas od nje? Nama je svakako ona jako super iako znam da ima nekih DMova koji se fakat puno pripremaju haha no to su iskusniji ljudi svi skupa.",
      "votes": {
        "upvoters": [
          "Amon",
          "Anonimity (BoJack)",
          "G-bear",
          "Grumio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25062": {
      "poster": "Grumio",
      "content": "@Amali#24980 \n\nOriginalno mi smo htjeli igrat vikendima kada bi bilo zati코je sa labosima i vikendima u tjednima pred praznike. Na쬬lost ja za ovaj semestar imam dva ponovna upisa, tako da sam malo obeshrabren 코to se ti캜e posvetiti malo vi코e vremena ne캜emu 코to nije faks. Neki iz moje grupe su ljudi koje sam znao, ali za neke sam se iznenadio da igraju D&D. Dok za one \"random\" bilo ih je dvoje koji su mi se javili preko f2n-a. 캛uo sam od jo코 par frendova i frendica da ima dosta ljudi zainteresirano za D&D, pa sam 캜ak razmi코ljao i napraviti jedan veliki discord gdje se svi mogu dogovarat ko kad mo쬰. Ja isto kao prepanje crtam karte, ja mo쬯a idem korak dalje sa glazbom, ali sumnjam da radim ne코to pretjerano vi코e (mo쬯a sam samo ja spor 游). Nikad nisam igrao PF, jedino 코to sam vodio je D&D i igrao sam CoC. Ja sam sa svojima prvo htio pro캖i kroz jedan gotovi one-shot da vidim kak ljudi di코u pa onda probat radit nekakvu kampanju (Mislim da bi koristio one module za kampanje). Kakav ti PF naspram D&D? Jel ima bolje slo쬰n combat i RP?",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Anonimity (BoJack)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25066": {
      "poster": "BedaTheNic",
      "content": "@Grumio#24493 \n\nOsobno se prepam 2-3 sata dan prije sessiona i tjt. Makar dosta puno brainstormam dok sam u busu ili na predavanjima pa kad mi nes fora padne na pamet samo zapisem. Sto vise vremena provedem pripremajuci session to  vise igraci odu u skroz drugom smjeru nego sta sam ocekivao. Najveci mi je problem skupit ljude, ali to nije nista novo",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "Ducky",
          "Gulbash"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25157": {
      "poster": "Amali (Amajli)",
      "content": "> @Grumio#25062 Kakav ti PF naspram D&D? Jel ima bolje slo쬰n combat i RP?\n\nNe mogu ovo nazalost odgovoriti jer nisam igrala DnD, krenuli smo s PF i nisam sigurna ni da su DMice igrale DnD jer igraju u PFS, al PF je napravljen na bazi DnD3.5 kao neki extended edition. Imam osjecaj da sam citala da je PF po pitanju combata uzasno kompleksan, a mozda i generalno? Imamo jako puno pravila, no nonstop guglamo kad zapnemo il smo poceli neke ceste stvari skupljati i printati da imamo za brzu referencu, tesko je sve to popamtiti jer ima previse toga, al smo pohvatali osnovne stvari koje se nonstop koriste iako jos uvijek npr. ode vrijeme dok poizracunamo tocan rezultat nekog rolla ako slucajno ima vise od basic modifiera koji je uvijek prisutan (doduse sad smo opet krenuli s novim likovima za 1-20 kampanju pa dok se naviknemo...). PF je jednostavno loaded opcijama di god pogledas, a [ovi](https://lifehacker.com/tabletop-rpg-showdown-dungeons-dragons-5e-vs-pathfi-1785545326) kazu da je DnD jednostavniji po svacemu, pa i izradi lika.\n\nZa PF jos jedino znam da ponekad ima neki manjak balansa za nekoliko klasa (underperformaju il im je jako tesko), no ako uspijes doci do te informacije prije izrade lika mozes koristiti njihove unchained klase koje bi trebale bit ugodnije za combat. Mi nismo isli predaleko od core i base rasa i klasa pa ne znam kaj je sa hrpetinom drugih klasa koje jos nude kao mixeve il nadogradnje obicnijih klasa i slicno.",
      "votes": {
        "upvoters": [
          "Anonimity (BoJack)",
          "G-bear",
          "Grumio",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25209": {
      "poster": "Grumio",
      "content": "Tip: igra캜ima se svi캠a ako im da코 npr. kobolda kao \"beskorisnog ljubimca\", npr na캠u ga dok se skrivao od njih itd. Daje priliku dobrim igra캜ima da poka쬿 kakvi su njihovi likovi, a kasnije mo쬰 poslu쬴t kao zabavan, malo kaoti캜an element, pa 캜ak i kao ekstra plothook. \n\nIzvor: osobno iskustvo. Jedna grupa jo코 uvijek pri캜a o tom koboldu i kako je jadnika pauk pojeo.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "25239": {
      "poster": "Amali (Amajli)",
      "content": "@Grumio#25209 mi smo kratko imali goblina koji je vise bio zapravo zarobljenik naseg sorc gnomea, no pustili smo ga na kraju (u biti dok smo pobili sve gobline u njihovom fortu na kraju sessiona zaboravili smo da smo ga ostavili tamo) (sorc ga je teska srca pustio, ali druid i wizard su ga htjeli ubiti ionako) (ja nisam bila na sessionu prije kad su nasli tog goblina pa nez otkud im, but yeah, vukli smo ga okolo malo)",
      "votes": {
        "upvoters": [
          "Anonimity (BoJack)",
          "Grumio",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25259": {
      "poster": "G-bear",
      "content": "@Grumio#25209 Kad sam igrao barbariana, znao sam se posluziti dwarfom kojeg je igrao frend. Posluziti u smislu koristiti ga kao improvizirano oruzje ili ga bacati na neprijatelje.\n\nJednom dok sam DM-ao, dao sam paladinu hijenu koju je vodio na lancu kao psa, a koristio ju je i u borbama. Nakon toga su svi htjeli ljubimca, i pokusavali su na raznorazne nacine pripitomiti razne zivotinje, ali nije im uspjevalo. Jer ja nisam dao. :D",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "Ducky",
          "Grumio",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "25271": {
      "poster": "BedaTheNic",
      "content": "@Grumio#25209 \n\nekipa mi je naisla na mravinjak divovskih mrava i kad su locirali maticu pokusali su wizardovu sovu iskoristit ko homing missile tako da su ju natovarili otrovima i rekli joj da se zaleti matici u usta.... skoro im je uspjelo",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Amon",
          "G-bear",
          "Grumio",
          "Gulbash",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Ducky",
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": [
          "Amali (Amajli)",
          "Anonimity (BoJack)"
        ]
      }
    },
    "25278": {
      "poster": "Amali (Amajli)",
      "content": "> @G-bear#25259 Jer ja nisam dao. 游땎\n\n_heartless_",
      "votes": {
        "upvoters": [
          "Amon",
          "Anonimity (BoJack)",
          "BedaTheNic",
          "G-bear",
          "Grumio",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25308": {
      "poster": "Grumio",
      "content": "@G-bear#25259  Ja sam jednom dao da nakon 10-15 minuta truda da pripitomi medvjeda. Ovak ionak je bio ranger koji je taman bio lvl3 pa sam htio da na logican nacin nade ljubimca, a ne da samo odjednom stvori. Plus imao je osjecaj kao da je nesto postigo. Radilo se o mladuncadi medvjeda ciju su majku ubili jer nisu znali da majka stiti mladunce. I da volim te malo convoluted, moralno-sive i pomalo ironicne price.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Amon",
          "Anonimity (BoJack)",
          "G-bear",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "25320": {
      "poster": "G-bear",
      "content": "@Amali#25278 A gle, koja je fora ako svi imaju ljubimce s kojima se bore? Pa nije radnja smjestena u pokemon svijet. Ako su htjeli ljubimce, mogli su igrati rangera. Jedan wizard je otpocetka imao malog tvora kao ljubimca, ali ga nije mogao koristiti u borbi. Ovo sam nagradio paladina jer je super roleplayjao i odlucio je hijenu, koja je bila ljubimac bandita koji su napali grad, ne ubiti vec zastrasiti i potjerati van grada. Ali rollao je natural 20 pa sam odlucio da ju je toliko zastrasio da je samo legla na pod kao mali psic i uplaseno cekala svoju smrt. On joj je odlucio prici i podragati ju, te joj reci da ode u divljinu ali je ona odlucila ostati s njim. Da ju je ubio, kao sto bi se to ocekivalo u borbi, ne bi imao ljubimca. Da ju je samo potjerao, ne bi imao ljubimca. Ali kako je sve ispalo i kako je on odigrao, odlucio sam improvizirati i pridruziti mu je (iako je on nije ni htio niti je mislio da je to moguce). Nakon sto su ostali vidjeli, onda su i oni pokusavali na raznorazne nacine nabaviti takve ljubimce, ali da sam im to dopustio paladinov cin bi izgubio na vrijednosti.\n\nDoduse, par sessiona kasnije sam clerica nagradio amnezijom zbog njegovih postupaka, a znas sto je cleric koji se ne sjeca kojem bogu se moli i sto je posljedica njegove nemolitve. Postao je obican fighter bez fighter perkova sve dok se ne sjeti svoje povijesti i kome sluzi. :D",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Amon",
          "Ducky",
          "Grumio",
          "Gulbash",
          "Johnny_Bravo (a beautiful and unique snowflake)",
          "KitKat (H(x))",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "mAcaLukas (mAca Lukas)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "31087": {
      "poster": "KitKat (H(x))",
      "content": "> @mAcaLukas#22358 O캛RT Teams D&D kampanja when?\n\n> Miljacko ne smije bit DM jer ovdje ima dovoljan power trip\n\nAko 캖emo imati DnD o캜rt, mo쬯a i do캠em. Pogotovo ako ne캖u biti DM jer sam trenutno zapela kao The Eternal DM.\n\nI da, **u쬴vo je 300 puta bolje nego bilo kakav online.**\n\nJednom smo u partyju imali 7 int paladina, i tip koji ga je igrao je to super glumio, tele캖i pogled, flat voice, ne shva캖anje metafora, lawful good, ali je paladin preglup da mo쬰 shva캖ati pojam zakona pa se sve svodi na \"bi li moj bog to napravio\", dobar backstory koji je bio povezan s backstoryjem druida (paladin je prije bio 코umar, ali se sad smrtno boji 코ume jer je tamo \"vidio 캠avla\", 캠avao je zapravo na코a druidka sotonistica i narkomanka, koja istovremeno brije na sve one hipi stvari sa 코umom i 쬴votinjama i progoni drvosje캜e, lovce i 코umare. Uglavnom, dosta zabavno).",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Amon",
          "Ducky",
          "G-bear",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Anonimity (BoJack)",
          "G-bear",
          "mAcaLukas (mAca Lukas)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "31095": {
      "poster": "Amali (Amajli)",
      "content": "@KitKat#31087 ne zaboravi rukopis i zapisivanje",
      "votes": {
        "upvoters": [
          "KitKat (H(x))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Anonimity (BoJack)",
          "KitKat (H(x))",
          "mAcaLukas (mAca Lukas)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "31252": {
      "poster": "G-bear",
      "content": "@KitKat#31087 \n\n> @KitKat#31087 캠avao je zapravo na코a druidka sotonistica i narkomanka, koja istovremeno brije na sve one hipi stvari sa 코umom i 쬴votinjama i progoni drvosje캜e, lovce i 코umare\n\nTIL 캟avao je isao na filozofski. Objasnjava stosta, though.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "KitKat (H(x))",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Anonimity (BoJack)",
          "Ducky",
          "KitKat (H(x))",
          "NekocBraca",
          "__builtin_popcount (std::popcount)",
          "mAcaLukas (mAca Lukas)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "34198": {
      "poster": "Anonimity (BoJack)",
      "content": "@KitKat#31087 jos i libertarijanski gnome koji zeli postati diktator 游땍",
      "votes": {
        "upvoters": [
          "KitKat (H(x))",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)"
        ],
        "wtf": [],
        "tuga": []
      }
    }
  }
}