{
  "title": "Zadnja igra koju sam igrao/la",
  "creator": "MarokMarsci (Collapse Enjoyer)",
  "slug": "zadnja-igra-koju-sam-igraola",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "34459": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "Reviveajmo i ovu temu:\n\n### 1.) [Civilization 5 Multiplayer](https://store.steampowered.com/app/8930/Sid_Meiers_Civilization_V/)\nTurn based strategy klasik sa frendovima je nesto najzabavnije. Pogotovo kad tvoji frendovi svi zajedno imaju deset puta manje sati od tebe u igri. Nazalost nasu zabavu je cesto prekidala neman zvana civ 5 netcode kojeg je vjerojatno pisao neki student preko kurca samo da dobije honorar u firaxisu. Jedan dan smo doslovno 6 sati pokusavali pokrenuti igru kako treba. Steta.\n\n#### Ocijena - 5/10 (9/10 kad radi)\n\n### 2.)  [Mordhau](https://store.steampowered.com/app/629760/MORDHAU/)\nKad smo odustali od Civa kupili smo svi Mordhau. Ova igra je vrlo zanimljiv entry u medieval combat simulatore. Iako se cini jednostavna na prvu, zahtjeva jako puno vremena da se propisno nauci. Sakirao sam dikcinu zesce dok nisam odlucio posvetiti bar 10 sati na duel serverima da se naucim osnove. Igranje sa frendovima dize enjoyment factor ove igre za bar 20 dB. Solo je malo frustrirajuca, pogotovo ako ispadnes iz stosa nakon par tjedana neigranja.\n\n#### Ocijena - 7/10 (8/10 sa frendovima)\n\n### 3.) [Terraria 1.4](https://store.steampowered.com/app/105600/Terraria/)\nGasi sve, doso novi Terraria update sa jos tezim master modom, pun kurac novih itema i jednako puno novih mehanika i stvari za otkrit. Ultimativni adventure sandbox dozivljaj. Jednostavno nema bolje igre u zanru, sramota je da kosta samo 10€.\n\n#### Ocijena - 10/10 kupi odmah, jebes faks\n\n### 4.) [Disco Elysium](https://store.steampowered.com/app/632470/Disco_Elysium/)\nDefinitivno najbolji RPG prosle godine. Nema combata, nema klasa, rasa, standardne_fantasy_price.exe. Igras kao detektiv kroner koji se napio toliko da je zaboravio sve i nalazi se u njemu potpuno nepoznatom svijetu i mora rijesit ubojstvo. Third person point-and-click avantura sa kolicinom teksta od otprilike 2 ruska klasika. Smijesna i tuzna, komplicirana i jednostavna, ova igra, kao i njena prica i likovi, nije ekstrem vec negdje izmedju. Toplo preporucam svima zeljnim actually dobre price i artstylea, pogotovo ljubiteljima RPGa.\n\n#### Ocijena - 10/10\n\n### 5.) [DARK SOULS III](https://store.steampowered.com/app/374320/DARK_SOULS_III/)\nYou Died. \n\nIgra koju bi svaka osoba trebala prec. Art savrsen, ugodjaj pogodjen, combat brutalan, ali savladljiv. Nemojte nasjedati na price soyboy novinara da je igra \"preteska\". Dark Souls je prave tezine da te natjera da krenes razmisljat o svojim potezima, udarcima, resursima, ali i da sjednes i naucis movesetove bossova, trash mobova etc. U tom pogledu je Dark Souls zapravo rythm igra. Ono sto igra uspjeva je stalno davati sve brze i ubitacnije neprijatelje tako da stalno moras savladavati nove prepreke, a dopamin hit koji dobijes od toga je ono sto te drzi u igri, makar do prije 2 sekunde bio na rubu zivaca. Kad sam prvi put igrao (prije 2 godine) trebalo mi je 20 sati da dodjem do Anor Londoa, sada mi je trebalo 6, a ovo mi je 2 run u zivotu. Nevjerojatno je koliko se poboljsas. Teze je savladat lore i pricu Dark Soulsa od same igre tako da u to se ne bi stel mesat.\n\n#### Ocijena - 9.5/10 (da nema pasa, Irithyll Dungeona i jailera bilo bi 10)\n\nPro tip: Pontiffa parryaj, a kroz glupave zone samo trci.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Bobicki",
          "Dodo1001",
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jakic007",
          "KitKat (H(x))",
          "Mioch",
          "Svarog (Veles)",
          "Tinx (pingvin)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "joc",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "34830": {
      "poster": "Jomi",
      "content": "### Rainworld\n\n>! https://i.pinimg.com/originals/3e/d6/35/3ed635a608bbbb379226a32bd426a987.gif\n\nAko se dobro sicam, igra je zapocela ka tech demo za zivotinjski ekosistem, pa je covik sta ga je radia odlucia usput napravit jebeno remek djelo. Kad cujes ikoga kako sere da igre ne mogu biti umjetnost, pokazi mu ovu igru. \n\nIgra je slicna metroidvania formatu, znaci imas masovnu mapu od medusobno spojenih regija, samo nemas neke glupe upgradeove koje moras skupljat da bi nastavia dalje nego ti je odma sve otvoreno ako znas kako do tamo doc. Ne samo da nema neki naporan progression system, nema inventorya, craftanja, exposition dumpova, dosadnih cutsceneova, i drugih niskotestosteronskih mehanika. Igras ko neka bijeli zivotinja (sluzbeno ime \"Slugcat\") i pokusavas pronac obitelj nakon sta vas je razdvojia pljusak. \n\nMozda je to malo zbunjujuce pa da objasnim: setting igre je u industrijskom podrucju davno izumrle civilizacije, i kad kisa pocme padat, pada u tolikoj kolicini da bilo koji stvor koji ne pronade dovoljno dobar zaklon ce umrijeti vrlo bolnom srmcu. Kad kisa ne pada, zivotinje izlaze iz hibernacije u potrazi za hranom, sto znaci da dok ti nastavljas istrazivati mapu, bilo koji stvor veci od tebe ce pokusat uronit zube u tvoje glatko bijelo dupe. \n>! ![](https://rainworld.gamepedia.com/media/rainworld.gamepedia.com/5/56/Porcupine_spider_%28short%29_2.gif?version=c1a47606c8aff7e53f31921e3190fd03)\n\nTo zna cinit igru dosta teskom, tkd nije igra za svakog malog pizdeka koji u svoje slobodno vrime igra majnkraft u creator modeu i svada se s drugima na forumima oko toga koji je linux distro najbolji. Igra je dosta zahtjevna sta se tice brzog rasmiljanja i platforming vjestina, i u nekim dijelovima zna cak biti malo preteska, sta bi reka da je glavna mana ove igre.\n\nNaravno, igra pokusava vjerno docarat zivot u zivotinjskom ekosistemu, tako da nebi bia red da ne umres u njoj barem nekih stotinjak puta.\n>! https://images.squarespace-cdn.com/content/v1/5559da45e4b0f0ee9b7c4910/1491918636305-ZUPN5RY2BM88OSUA5JIP/ke17ZwdGBToddI8pDm48kCNuFgHZpNbB9Od0nOc9CQ57gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z5QPOohDIaIeljMHgDF5CVlOqpeNLcJ80NK65_fV7S1Ufk7xsn95e0PmxrU573ZgCqNR1szC4S7L6sQEZZcqJ76h4wEndT9yoXeK5CPlsnUNQ/image-asset.jpeg\n>\nJedina druga mana je takoder i vrlina, igra ima masovnu mapu koju polako otkrivas, i nijedan dio ti nije zatvoren dok ne nades neki glupi quest item ili poslusas 5 minuti napornog dijaloga. Takva ogromna sloboda daje rizik da igrac slucajno izabere jako neefikasan put i izgubi masu svog vrimena backtrackajuci, ali jebiga to ti je zivot, uzeli ste neefikasan zivotni put kad ste upisali ovaj klaunski faks pa eto. Metroidvania nacin dizajniranja mape je vjerovatno najgora moguca kombinacija sa tom filozofijom, ali mislim da je worth it na kraju krajeva. Na srecu, postoji alternativa ako to ne zelite riskirat (iako onda necete dobit taj _ A U T H E N T I C _ E X P I R I E N C E _ ), samo prati ovu stvar\n>! ![](https://gamepedia.cursecdn.com/rainworld_gamepedia/9/9d/Overseer.gif?version=f46f2451f5b34197560093edaa7f0c27)\n\nVjerovatno ste dosad skuzili iz slika da igra ima jako jedinstvenu vizualnu estetiku, ali takoder ima apsolutno fenomenalan sound design, i jako je atmosfericna. Neke stvari koje sam vidia u ovoj igri cu pamtit do kraja zivota, ili dok mi Bill Gates ne sprzi mozak svojim 5G psihicko-vampirskim zrakama.\n\n>! ![](https://media3.giphy.com/media/xUPGcB2AKzBpVYfIe4/giphy.gif?cid=ecf05e4749c4b30338287378a615a3dffcecda0951ffff85&rid=giphy.gif) ![](https://media.giphy.com/media/xUPGcCZ9cfuBOUHSJq/giphy.gif) ![](https://i.imgur.com/71bFYB0.png) ![](https://i.imgur.com/XKm1BBC.png) ![](https://vignette.wikia.nocookie.net/rain-world-game/images/5/57/Rain_World_10_17_2018_8_43_17_PM.png/revision/latest?cb=20181022004840) ![](http://www.heterotopiaszine.com/wp-content/uploads/2017/04/rw14.gif)\n\nIspod svega toga je iznenadujuce dubok lore, koji vecina ljudi nece ni sinjat jer je uglavnom \"show don't tell\", sta je valjda neizbjezno kad su 99% NPCeva zivotinje od kojih ili ti bjezis, ili oni bjeze od tebe.  Za ono malo expository dijaloga treba potrosit dosta vrimena i truda, tkd ako ocete znat cjelokupan lore settinga, ja bi preporucia da kopate po wikipediji nakon sta predete igru.\n\n>! ![](https://preview.redd.it/532a40gn8r431.jpg?width=1200&format=pjpg&auto=webp&s=b60ccd92c094419d59e014f727364e64c9c0882f)\n\nMoga bi jos 5 stranica ispisat samo o ovoj igri ali realno, malo tko ce i ovo tu procitat. Igra dode 20 eura na steamu, a ima je na svakom pirate sajtu skinit ako ocete provat ju prvo. Ako imate bas tanke zivce ili ako ste u igrama inace smotani, slobodno odaberite onaj laksi difficulty kad tucete new game, da nema pickica onda hrabrost nebi bila vrlina.\n\n Jedan vazan protip: cuvajte bisere da ih date ovim likovima (mozete im dat i druge stvari, oni ce na pod bacit koplja i slicne korisne iteme). Nemojte ih naljutit, sjebat ce vas ko da su splitski kamatari, a dugujete im pare.\n\n>! ![](https://i.gifer.com/9PwY.gif)\n\nEto toliko od mene, mozda jos dobacim jos koje mandy reviewove jer mi se neda pisat ovako za svaku jebenu igru.\n\n|| ukradete li BSMine neurone zaklat cu vas ko svinje sta i jeste ||",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Bobicki",
          "Filemon",
          "GTX9800",
          "Galke",
          "InCogNiTo124",
          "M-16",
          "NailAndGear",
          "SuperSjajan3",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "indythedog",
          "laranotreallycroft",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "34836": {
      "poster": "Jomi",
      "content": "NA SOKOLE NA\n>! https://www.youtube.com/watch?v=5mQEhl6GXvM\n\n>https://www.youtube.com/watch?v=CSv43cB6aME\n\n>https://youtu.be/AScCVzENcjs\n\n>https://www.youtube.com/watch?v=jeh0KXqOQPU\n\nZOBAJ ZOBAJ ZOBAJ ZOBAJ",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Bobicki",
          "feel_d_boot (iNut)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42881": {
      "poster": "LocDog",
      "content": "The Last of Us 2.\n\nUpravo završio i mislim da je to jedna od onih igara koja se mora prespavati kako bi se stvorilo konačno mišljenje. \n\nTrenutnno sam jako conflicted.\n\nGameplay, likovi, priča su mi čista desetka, skroz shvaćam što su željeli napraviti s ovom igrom i uspjeli su i na tome im čestitam. Unatoc svemu tome, mislim da bi mi bilo draže da igra nikada nije izašla. \n\nDraze mi je bilo ono što sam ja zamislio u glavi nakon kraja jedinice nego ovo, ali moguće da je to jedna od poanti igre, svijet je zajeban i nemoguće je da će sve biti lijepo.",
      "votes": {
        "upvoters": [
          "Amon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "HARAmara (decko_sa_balkana)"
        ],
        "wtf": [],
        "tuga": [
          "Bobicki",
          "InCogNiTo124"
        ]
      }
    },
    "50763": {
      "poster": "laranotreallycroft",
      "content": "AI Dungeon\n\nhttps://play.aidungeon.io/\n\nText based adventure game koja pamti sto si prije odabrao/napisao i mijenja se u skladu s tim. \n\nZna imati manjih hiccupova, ali in general radi odlicno i stvarno se lako zanjeti i izgubiti vise vremena nego sto ocekujes.\n\nPrvih 10min ce vam mozda biti bezveze dok ne pohvatate kakav input se bolje procesira al nakon toga 10/10",
      "votes": {
        "upvoters": [
          "AntonioB25 (Pleteni miš)",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jakic007",
          "Mioch",
          "[deleted]",
          "[deleted]",
          "amnael",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "50781": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@laranotreallycroft#50763 iskreno, od tvog username-a sam očekivao neku drugu igricu\n\nOn toppic: s obzirom da sam se davno otarasio gaming računala i ne namjeravam više ikad bacat novce na takvu pizdariju, dugo vremena nisam ništa igrao. Prije par dana mi je došao Android TV box, bez problema pogoni GeforceNow i veza je igriva. Kad završe ispiti kupujem mjesec dana pretplate i prelazim Witcher trojku. See ya folks",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "InCogNiTo124",
          "Svarog (Veles)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Amon",
          "Filemon",
          "Svarog (Veles)",
          "laranotreallycroft"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "50789": {
      "poster": "benac (caneb)",
      "content": "@laranotreallycroft#50763 u prvih 10 minuta igre sam upoznao kralja Edgara, imao sex sa vlastitom kćerkom i odvezao se autom kući (u medieval settingu)",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Dome",
          "Jakic007",
          "MiqeloS",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Amon",
          "Bog (Charlie Brown)",
          "Filemon",
          "G-bear",
          "HeHe (Direktor života)",
          "Lyras",
          "Mioch",
          "NekocBraca",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "amnael",
          "laranotreallycroft",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "58284": {
      "poster": "idontwannabemyself",
      "content": "### [**Pikuniku**](https://www.youtube.com/watch?v=wjEC6_VEEs4)### \nJedna od najwholesome igrica koje sam odigrala. \n\nPiknula sam ju u Itch.io bundleu, iako ju već mjesecima gledam na Steamu i nikako da pokleknem - sada je došao taj dan i mogu reći da je i nadmašila moja očekivanja. Daleko je od *next-gen AAA* titleova niti to pokušava biti, a odigra se kroz jedno dulje poslijepodne ili lagodno dva dana. \n\nPuzzle platformer pun easter eggova i sidequestova (čije se posljedice mogu iskoristiti kroz daljnji playthrough), sitnih detalja koji su i više nego adorable. Iako je površno \"get the bad guy\" priča, protkana je loveable likovima i u pozadini se kriju neke poruke koje su itekako relevantne danas. Humor je isto jako wholesome (koliko puta mogu to reći) te me je u nekim trenucima fakat uhvatila smijući se od srca ili *aww*ajući - *ovo nije riječ ffs*. Dakle, writing je top notch. Gameplay, once again, nije ništa specijalan niti pretežak, ali ima nekih ful kratkih boss dijelova koji se prođu od druge, ako ne od prve.\n\nNije za svakoga, pogotovo ako ne padate na te cutsey/quirky stvari, ali je mene užasno razveselila dok sam ju igrala i osobno je **9.5/10**.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Bobicki",
          "Filemon",
          "Galke",
          "Hrvoje (Hrvoje45)",
          "Joskica",
          "Koalefant",
          "Sans",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "lup"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "65746": {
      "poster": "helot",
      "content": "[Barotrauma](https://store.steampowered.com/app/602960/Barotrauma/)\n\nAko ste ikad igrali Space Station 13 ili FTL onda je ova igra definitivno za vas. Devovi su isti kaj su napravili SCP Containment Breach, te aktivno rade na Barotraumi, Pustili su hrpu in-game mod alata i objašnjenja kako sve modificirati od podmornica do monstruma i stalno odgovaraju na pitanja, daju updateove što rade i što je sljedeće od bugfixova ili featurea.\n\nA sad o igri, na Jupiterovom mjesecu Europa, pod ledenim santama upravljate podmornicom, ima par uloga od mehaničara, električara, lječnika, kapetana, zaštitara/vojnika i na kraju klauna. Smisao je da uspijete doći od stanice do stanice, prenoseći opasan teret (parazitna jaja koja vas pretvore u zombija ili nitroglicerin), misije gdje morate ići ubiti živine koje žive pod velikim pritiskom gdje nema svijetla i nitko ne čuje kako vrištite, te podmornica vaših suboraca koji su prepuni prethodno spomenutih živina ili zombija. \n\nIznenađujuće je zabavno ako igrate s prijateljima, stvarno je potrebno surađivati i skužiti kako sve funkcionira da podmornica ne eksplodira u roku par minuta te je svaka uloga važna. \n\nAko ste solo, možda će vam iskustvo biti loše jer su serveri prepuni trollova, ima i ozbiljnijih servera ali morate ići na discord tražiti grupe ozbiljnih igrača.\n\nUkratko, igra je super ako vas je bar 4, nadograđujete svoju podmornicu i izvršavate opasne misije, vještine vaše klase vam rastu što više pilotirate podmornicu/popravljate stvari/pucate u monstrume, morate paziti da kada vam Mudraptori ulete u podmornicu uspijete na vrijeme obući morsko odijelo inače će vas pritisak ubiti u roku par sekundi. Nemojte zaboraviti u svom tom kaosu popravljati podmornicu i nedo bog da ste u blizini nuklearnog reaktora kada vrisne, da li će vas nedostatak kisika, radijacija ili vatra ubiti prvo je teško reći a onda kada spriječite da sve eksplodira, morate ići ubiti i neprijatelje na podmornici da možete nastaviti dalje.\n\nNeka putovanja među stanicama su max comfy, malo neprijatelja, samo se sprdate s prijateljima, a neka su toliko napeta, da se često puta događalo da samo jedan od vas preživi i mora dogurati podmornicu u polu radnom stanju do sljedeće stanice kako bi dobili sitniš da možemo nastaviti dalje.\n\nAko netko namjerava nabaviti PM-ajte me.\n\nhttps://youtu.be/5astpd0RRrY\n\nhttps://youtu.be/CndIm-Fro4I",
      "votes": {
        "upvoters": [
          "BigZ1",
          "Bobicki",
          "Filemon",
          "[deleted]",
          "feel_d_boot (iNut)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "66769": {
      "poster": "janeromero (Serial Number Q5U4EX7YY2E9N)",
      "content": "**Dead by Daylight**\n\nZnači prenapeta igrica, u početku mi je bilo dost strašno (za mene prva igra koja sadrži horror u popisu žanrova), ono LUDILO buraz.\n\nDBD je nesimetrični horror survival game, nesimetrični jer se igra 4v1, 4 survivora koji trebaju popravit 5 generatora i zatim otvoriti vrata za izlaz (i logično izaći), te 1 ubojica koji lovi i ubija survivore. Svaki survivor character u igri ima 3 specifična perka (skill) za sebe te hrpu zajedničkih. Ali pre fora je što možeš \"otključat\" taj perk za sve ostale survivore pa u biti možeš imat bilo koji build na bilo kojem liku. Kod killera se isto tako mogu isti perkovi svugdje otključati i koristiti, ali svaki killer ima drukčiji power i zato je sa svakim killerom gameplay drugačiji. Ono - Myers, Freddy Krueger, Leatherface, Pyramid head i još hrpa drugih, neki iz filmova, a neki ne.\n\nMeni je jako zabavno igrati survivora sa prijateljima, a kad nitko nije online, igram killera, iako se dosta duže čeka za match sa killerom nego playerom. Također, napokon mi random ljudi komentiraju Steam profil s uvredama :)\n\nhttps://www.youtube.com/watch?v=B0rAMbwDOIo",
      "votes": {
        "upvoters": [
          "BigZ1",
          "Bobicki",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67176": {
      "poster": "BedaTheNic",
      "content": "Aj da i ja nes napisem tu za par igri sta nisam vidio da su ljudi pisali\n\n## [Hollow Knight](https://www.hollowknight.com/)\nPrekrasni 2D action-adventure platformer u kojem istrazujes palo kraljevstvo Hallownest. Moram odma rec ova igra je savrsena, stvarno sam proveo dugo razmisljajuci imam li joj koju zamjerku za rec i fakat nemam. Igra se najvise bazira na istrazivanju i aktivnom combatu koji zna biti dosta zahtjevan ali zato super zabavan. Platformanja nema previse i nije toliko tesko no sto je mene najvise dojmilo je artwork likova, pozadina lokacija i opcenito worldbuildanje. Toliko puta sam se nasao samo istrazivajuci i pricajuci s NPC-jevima pokusavajuci saznat sto vise o lore-u kojeg FAKAT IMA. Glazba je takoder odlicna tak da ako vam je to bitno da znate i da to valja. Sve u svemu igrica je top i preporucam je svakome tko voli takav tip igrice.\n\nOcjena **10 / 10**\n\n## [Sekiro](https://www.sekirothegame.com/)\nJos jedna YOU DIED od from softvera ovoga puta sa puno manje rpg elemenata i jednom fora stvari, beskonacnom staminom. Igras ko samurai ninja batman i ak ti to nije dost da te navuce da probas ovu igricu onda valjda nije za tebe. Uglavnom ekipa koji ste navikli na kolutanje u dark soulsu ovdje mozete zaboravit. Ovo je zapravo ritmicka quick time event igrica u kojoj je 90% boss fightova nauci ritam kako boss udara i blokiraj udarce perfektno inace si najebo. Zna biti dosta teska dok se ne naviknes na ovaj sistem ali je fora zamisljeno i fakat imsa dojam da se macujes ko pravi samurai. Ima dost dobru pricu sto je isto plus i nije predugacka.\n\nOcjena **9 / 10**\n\n## [Ori: Will of the Wisps](https://www.orithegame.com/)\nDobar nastavak na prvu igricu ako vam se svidjela (Ori and the blind forrest, ko ne zna 10/10 preporucam) no odma se primjeti da su nesto promjenili. Ljudi koji su igrali hollow knight ce skuzit da su prekopirali skoro sve. Ne znam jesam li vidio ijednu mehaniku u ovoj igrici a da je originalna. Malo su promjenili dizajn ali je i dalje prekrasan. Osobno mi se vise svida prvi dio po apsolutno svemu jer je vise fokusiran na pricu i platformanje a ne na combat. Ovdje ovo malo combata sto ga ima nije zahtjevan, a dodali su ponu vise platformanja i vise upgrade-a od kojih si brzi u platformanju tak da je fora picit okolo po mapi ko munja. \n\nOcjena **7 / 10**\n\n## [Supraland](https://store.steampowered.com/app/813630/Supraland/)\nOdlican puzzle action sandbox. Prvenstveno puzzle game onda ostalo, igrica je dost chill, sandbox je jer se doslovno nalazis u pjescaniku koji je neki klinac s mastom napravio i zujis po njemu rjesavajuci zagonetke i boreci se protiv svaceg. Ne sjecam se bas da su stvari bile preteske, ali trebalo je ukljucit mozak i sjecam se da sam par puta zapeo. U igrici ima dosta memeova i takvih sranja tak da ako volite refrence humor bit ce vam igrica i smijesna. sad sam vidio da je izaso dlc kaj je dulji od originalne igrice pa kad ulovim vremena i to cu sigurno probat.\n\nOcjena  **8 / 10**",
      "votes": {
        "upvoters": [
          "Amon",
          "BigZ1",
          "Bobicki",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Jakic007",
          "Mariosss77 (Trevor)",
          "Sans",
          "Zogen",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "idontwannabemyself",
          "klukas"
        ],
        "downvoters": [
          "otacon (senpai)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67192": {
      "poster": "__builtin_popcount (std::popcount)",
      "content": "> @BedaTheNic#67176 Ljudi koji su igrali hollow knight ce skuzit da su prekopirali skoro sve.\n\n\n> @BedaTheNic#67176 Osobno mi se vise svida prvi dio po apsolutno svemu jer je vise fokusiran na pricu i platformanje a ne na combat.\n\nMožda je do toga što sam prvo igrao Hollow Knight, ali nije mi se baš svidio Ori and the Blind Forest. Platforming mi je nekako neprecizan, a combata ima previše da bi bio sveden na mashanje jednog gumba. U tih 50 minuta koliko sam igrao me se nije previše dojmio, ali mu planiram dati drugu šansu.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67480": {
      "poster": "Sans",
      "content": "### [Inmost](https://www.youtube.com/watch?v=oSX1StI7tBk)\nPredivna puzzle platformer igra s elementima combata. Igrate kao 3 charactera u istom svijetu i definitivno preporucam. Odlican soundtrack i prica.",
      "votes": {
        "upvoters": [
          "Bobicki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67683": {
      "poster": "cloudies",
      "content": "### [Risk of Rain 2](https://store.steampowered.com/app/632360/Risk_of_Rain_2/)\n\nThird person shooter roguelike igrica koja me prvo me prvo asocirala na Binding of Isaac u 3D-u kad sam ju vidjela. Cijela poanta igre je odabrat survivora (ima ih 10), skupljat što više itemova dok se boriš sa svime i svačime i prelaziti razine dok se ne dođe do kraja. Stvari postaju sve teže i teže što dulje igra traje tako da brzina isto tako igra ulogu. Svi itemovi, tj. upgradovi koji se dobivaju su odabrani slučajno, međutim sam rng ne utječe previše na igru jer se neželjene stvari mogu pretvoriti u smeće i onda zamijeniti za nešto bolje. Jedina loša stvar je da postoji ograničen broj stvari koje se može dobiti po razini, a dijele se međusobno sa ostalim igračima. Također postoje modifikatori koji se se mogu primjeniti na sljedeću rundu tako da igra nikada nije monotona. Sve u svemu, jako zabavna igrica, pogotovo ako se igra u timu sa frendovima. \n\n### [Divinity: Original Sin 2](https://store.steampowered.com/app/435150/Divinity_Original_Sin_2__Definitive_Edition/)\nPredivan rpg sa turn-based combatom, bogatom pričom, odličnim ambijentom, soundtrackom i likovima. Ova igra je, uz Witchera 3, moj osobni masterpiece. Trebalo mi je oko stotinjak sati da pređem cijelu igru sama jer jednostavno ima toliko toga za istražiti i proći. Možete igrati sa origin likovima koji svaki ima svoj poseban lore i uključuje hrpu novih dijaloga ili sa svojim custom likom. Također postoji mogućnost igranja solo ili sa frendovima. Solo je bolja opcija ako želite baš doživjeti priču i proći sve \"kako spada\" svojim tempom. Sve u svemu, 11/10.",
      "votes": {
        "upvoters": [
          "Amon",
          "BigZ1",
          "Bobicki",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "__builtin_popcount (std::popcount)",
          "branimir1999"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "70387": {
      "poster": "Filemon",
      "content": "### [Orwell: Keeping an Eye On You](https://store.steampowered.com/app/491950/Orwell_Keeping_an_Eye_On_You/)\n\nZa fanove distopijskih tema, priča o totalitarnim režimima, nadzoru građana, individualnosti, digitalnom otisku i granici između aktivizma i terorizma ispričana postovima i člancima na internetu, razgovorima i dokumentima. Kao komentar na vječnu debatu sloboda vs sigurnost, pogotovo u post-9/11 svijetu, likovi također predstavljaju različita stajališta o temi. Igra počinje in medias res eksplozijom bombe na glavnom gradskom trgu, pri čemu je identificiran sumnjivac.  \n\nGameplay je minimalističan, kao agent u sustavu Orwell drag 'n' droppate informacije o osobama od interesa čime se otključavaju nove informacije, otkrivaju motivi i pozadine likova te nastavlja radnja. Usporedio bih to s Papers, please, Beholderom ili Phoenix Wrightom čak. Budući da je igra epizodična, glavna radnja je linearna, međutim itekako se može utjecati na sudbine likova, a postoji i nekoliko različitih krajeva. S obzirom da sustav označava podatke koji se mogu pridružiti osobi ne raspoznajući humor, sarkazam ili relevantnost, to se ostvaruje odabirom toga što ćete i, puno bitnije, nećete uploadati na Orwell, a postoje i neke kontradiktorne informacije gdje birate između opcija.\n\nArt style je nice. Iako je ovo zapravo interactive visual novel, vrlo je immersive zbog načina na koji ostvaruje radnju, zanimljivih likova i dobrog dijaloga, a to je najbitnije kod igara koje žele biti vođene pričom. Budući da ga vjerojatno već imate iz nekog giveawaya, jedino što morate potrošiti je nekih 6 sati.\n\n**8/10**",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "[deleted]",
          "laranotreallycroft",
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "70393": {
      "poster": "Gussy (huba buba)",
      "content": "[Total War WARHAMMER II](https://store.steampowered.com/app/594570/Total_War_WARHAMMER_II/)\n\nPros:\n\nraznovrsniji nego ostali total warovi\n\nCons:\n\n3 milijarde dlceva\n\nPros:\n\nDlcevi su uglavnom samo racepackovi i ne utječu previše na gameplay\n\nCons:\n\nDa bi u potpunosti doživio igricu treba ti i prvi dio jer se obje spoje u jednu megakampanju\n\n**7.439686/10.1581758**",
      "votes": {
        "upvoters": [
          "Amon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "70508": {
      "poster": "Gussy (huba buba)",
      "content": "[Frostpunk](https://store.steampowered.com/app/323190/Frostpunk/)\n\nStrategy survival economy simulator manager game\n\nKao neki steampunk setting i u biti Zemlju pogodi neka kataklizma i neko ledeno doba i cilj je uspostaviti kao održivi grad. Ima relativno zanimljivu pricu i takoder ima drustveeni aspekt u smislu drustvenog uredenja te nove zajednice.\n\n8.5/10",
      "votes": {
        "upvoters": [
          "Amon",
          "Bobicki",
          "Filemon",
          "InCogNiTo124",
          "Jakic007",
          "[deleted]",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "77695": {
      "poster": "Mulder",
      "content": "**L.A. Noire**\n\nnajbolja igrica ikad dosl noir vibes detektivski posao najbolja stvar ikad ipak nisu svi panduri svinje šteta što nikad neće bit nastavka ili nečeg u sličnom điru\n\niman 195h ovoga na steamu a za jedan playthrough triba 15-20 uri, ovo dovoljno govori o mojoj opsesiji\n\n10/10",
      "votes": {
        "upvoters": [
          "Bobicki",
          "Filemon",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "77712": {
      "poster": "Gussy (huba buba)",
      "content": "@Mulder#77695 di si ti nasa toliko gameplaya ? Ili si 16 puta igra ispocetka",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "__builtin_popcount (std::popcount)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "77714": {
      "poster": "Mulder",
      "content": "@Gussy#77712 prešo sam igricu pun kurac puta, više niti ne brojim lmao",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "79419": {
      "poster": "KitKat (H(x))",
      "content": "### Crusader Kings III\n\nReko, ajde da probam i novu paradoxovu igru.\n\nOdlučim igrati s Hrvatskom. Ide mi dobro, imam para, imam teritorija, dinastijski eugenički projekt radi odlično...\n\nNapadne me Bizant. FuckMyLife.jpg.\n\nNaravno, izgubim. Napadnu me ponovno, i naravno, opet izgubim. Svedu me na ostatke ostataka nekoć slavnog hrvatskog kraljevstva, fakin pravoslavne grčke Osmanlije.\n\nI zato odlučim postati njihov vazal i sjebati ih iznutra.\n\nPar sto godina kasnije, imam cijeli stari teritorij + Bugarsku, nećaka sam dovela na Bizantski tron uz puno ubojstava i sad Bizantom vladaju Trpimirovići (Hrvatska od Kranjske do Damaska), a cijela Europa štuje moju \"herezu\" liberalnog Isusa koji ne kink shamea.\n\n10/10 bi igralo ponovno.",
      "votes": {
        "upvoters": [
          "Amon",
          "Bog (Charlie Brown)",
          "Emma63194",
          "Filemon",
          "G-bear",
          "Grdobina2000 (Grdobina)",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Lyras",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "PeroPerica",
          "Piki",
          "SuperSjajan3",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "amnael",
          "branimir1999",
          "joc",
          "mAcaLukas (mAca Lukas)",
          "maPre",
          "mijauexe",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "BrownPerson (Bambi)",
          "Emma63194",
          "G-bear",
          "Grdobina2000 (Grdobina)",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Jakic007",
          "Lyras",
          "M-16",
          "NekocBraca",
          "PeroPerica",
          "Svarog (Veles)",
          "amnael",
          "branimir1999",
          "mAcaLukas (mAca Lukas)",
          "netflix (seximan)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "79434": {
      "poster": "SuperSjajan3",
      "content": "@KitKat#79419 Koliko se tesko ufurat ako nisam nikad igro tu vrstu igre? Jedino imam malo iskustva iz Hearts of Irona, ali i to slabo.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "79462": {
      "poster": "Filemon",
      "content": "@SuperSjajan3#79434 HoI i ostale Paradoxove igre su vrlo slične, dobro će ti doć to iskustvo. Mislim da se relativno lako ufurat, razlog zašto je žanr privlačan i drugim osim ljudima s history bonerom i fanovima strategija je da si sam postaviš cilj, ne postoji \"pobjeda\".\n\nŽeliš pokorit cijeli svijet? Imat romansu s papom da ti financira ratove? Napravit genetski jackpot od dinastije, s genijalnim, jakim i atraktivnim ljudima? Spriječiti propast poganskih vjerovanja? Doslovno što god želiš.\n\nCK III je vjerojatno i najviše newb-friendly jer su pojednostavili i logičnije organizirali UI, dodali kvalitetne tooltipove za sve mehanike, statove i pojmove u igri. Jedino po čemu se CK drastično razlikuje od ostalih je što ne igraš državu, već dinastiju, tako da postoji RPG element, a to pogotovo vrijedi za novi, sa skill treeom, utjecajnijim traitovima i perkovima te stresom kojim te igra usmjerava da igraš s likom, ne protiv njega.",
      "votes": {
        "upvoters": [
          "Dome",
          "KitKat (H(x))",
          "SuperSjajan3",
          "Svarog (Veles)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "79475": {
      "poster": "Dome",
      "content": "@SuperSjajan3#79434 Uz ovo sto je kolega @Filemon rekao nadodao bih da je ck3 prakticki jedini game paradox-a uz manje vise hoi-4 kojemu pocetnici netrebaju gledat neki masni 10-50 video youtube tutorial kako savladat vecinu igre, pozitivna stvar ck serijala je da nije poanta toliko optimizirat gameplay jer je pun k  random eventa koji mogu sjebat sve zivo, nego jednostavno odradit zivot neke osobe s nekim daljnim ciljom i usput prezivjeti clusterfuck sranja koja se mogu pojaviti u prosjecnom zivotu (Nisam toliko igro ck3 da znam koliko je razraden clusterfuck, ali ck2 s svim dlc-ovima je imao toliko random sranja dase  prakticki trebalo igrati vise run-a od pocetka do kraja da ih vecinu pohvatas)",
      "votes": {
        "upvoters": [
          "Filemon",
          "KitKat (H(x))",
          "SuperSjajan3",
          "Svarog (Veles)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "79526": {
      "poster": "SuperSjajan3",
      "content": "@Filemon#79462 \n\n@Dome#79475 \n\nZahvaljujem, definitivno cu probat",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "KitKat (H(x))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82220": {
      "poster": "Ziher",
      "content": "Sto mislite o Cyberpunk 2077 hypeu? Jel ce se isplatit uzet?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82236": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@Ziher#82220 ako imas komp koji ga moze pokrenut, definitivno\n\nako nisi siguran, piratas, cdpr ne stavlja DRM na svoje titlove tako da ce ti i torenti biti dostupni day 1",
      "votes": {
        "upvoters": [
          "Bobicki",
          "Ziher",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82242": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@MarokMarsci#82236 ako nemas, GeForce Now radi sasvim razumno na 14Mbps ako ti je ok ping",
      "votes": {
        "upvoters": [
          "Bobicki",
          "InCogNiTo124",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82244": {
      "poster": "helot",
      "content": "@Ziher#82220 \n\nMislim da je postao dosta pozzed. \n\nImho day 1 pirate i onda ću vidjeti da li davati pare ili ne, ja bih se suzdržao od bilo kakve kupovine/predkupovine.\n\n![](assets/2020-10-20/00013.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82249": {
      "poster": "[deleted]",
      "content": "@mAcaLukas#82242 Kolika je cijena po satu toga?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82251": {
      "poster": "mAcaLukas (mAca Lukas)",
      "content": "@Delpins#82249 5€ mjesec zasad ili free intervali po sat",
      "votes": {
        "upvoters": [
          "Bobicki",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82256": {
      "poster": "[deleted]",
      "content": "@mAcaLukas#82251 tbh to mi se sada cini jako neodrzivo. Pretpostavljam da imaju neki ogranicen broj gpuova, i onda da je u određenim vremenima tesko dobiti pristup?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82305": {
      "poster": "Mike (Klaud Konzultanta)",
      "content": "@helot#82244 Taman i da ispadne kako je sročeno u tweetu, i dalje bi igrica bila avion. Fali GTA-like igrica jer su postale preskupe za razvijati i rijetki si to uopće mogu priuštiti, a nitko obaviti na produkcijskoj razini Rockstara.",
      "votes": {
        "upvoters": [
          "Bobicki"
        ],
        "downvoters": [
          "Hrvoje (Hrvoje45)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82326": {
      "poster": "helot",
      "content": "@Mike#82305 \n\nzato imaš GTA i modove, cyberpunk je nastao kao dnd u 80tim/90tim te su od početka shillali da ćemo imati rpg experience da bi tek kasnije postao adventure game tipa GTA. Mislim mene je rajcalo od početno obećanje pogotovo jer su dovukli kreatora cyberpunka da im pomaže, da bi na kraju imali ovo plus mumble rap, ofc da sam razočaran.\n\nČekamo da igra dođe da vidimo što je i što nije ali bojim se da je hype train bio prevelik te da će biti dosta razočaranih ljudi.\n\n![](assets/2020-10-20/00028.png)",
      "votes": {
        "upvoters": [
          "BedaTheNic",
          "InCogNiTo124",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "82531": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "ae dumeri sta ste se stisli, bit ce dobra igra",
      "votes": {
        "upvoters": [
          "Dell",
          "Filemon",
          "InCogNiTo124",
          "Ziher",
          "[deleted]",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "__builtin_popcount (std::popcount)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "83375": {
      "poster": "netflix (seximan)",
      "content": "The outer worlds - veri kul space kampanja s puno puno fallout mehanika",
      "votes": {
        "upvoters": [
          "Amon",
          "Ziher",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83379": {
      "poster": "Amon",
      "content": "@netflix#83375 yup, fallout in space bi bio worthy description",
      "votes": {
        "upvoters": [
          "netflix (seximan)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83491": {
      "poster": "InCogNiTo124",
      "content": "[Polytopia](https://store.steampowered.com/app/874390)\n\nIgram ju preko dve godine na mobitelu, najkjut take na civ kojeg sam vidio u zivotu, grafikica je super, zvukici su super, sve je super.\n\nOdaberes jedan od 15 tribesa i unistis ostale, nema puno mudrosti. Svaki tribe se razlikuje po pocetnim tehnologijama i vrsti terena. Valuta su zvjezdice koje mozete trositi na vojnike, nove tehnologije i unaprijedenje gradova sto vam donosi extrs zvjezdica. igra je jako dobro balansirana i omogucuje razne strategije ga svaki tribe i druge beskonacne kombinacije. Dost zarazno.\n\nMobile verzija je dosla prije 4 godine i besplatno je, samo je limited",
      "votes": {
        "upvoters": [
          "Amon",
          "Filemon",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83556": {
      "poster": "helot",
      "content": "Endless space 2 - uzeo na popustu za 21.03 eur što smatram da je čak ok cijena. Tko je igrao jedinicu će se donekle snaći u dvojci jer su dodali dosta elemenata koji kompliciraju igru, ali svejedno dosta zabavan 4x. Podsjeća jako na Stellaris makar su neke funkcionalnosti dosta drugačije, neki čak nazivaju ES2 boljim Stellarisom ali neću ulaziti u to jer smatram da su drugačiji tip igara.\n\nAko ste igrali CIV III,IV, V, Sins of solar empire ili galactic civilizations onda će vam i ovo možda dobro leći.\n\nPostoji samo par problema koje je potrebno spomenuti te su vidljivi i na steam reviews:\n- Darth Paul, ne nije zezancija ali određene verzije igre imaju problem s time, savjetujem da googlate u čem je točno problem ali je igra ne igriva s njim. Novi patchevi su fixali problem koji je prisutan na verzijama prije oldversion u beti na steamu 1.5.28 mislim da je\n- Infinite pending bug - ako igrati MP, možete naletjeti na taj bug da neće finishat turn. U svakoj ver. igre postoje razlozi za taj bug, zadnji patch je bio prije nekoliko dana, 19.10 i svejedno nekada to izleti. 1.5.28 je najstabilnija i svi ju preporučuiju igrat  \n- Awakening DLC, savjetujem da ga ne kupite jednostavno ili ako ste nekim slučajem kupili, disableate. Dodaje civilizaciju koja breaka game radi diplomacije i doslovce vas non stop napadaju i žicaju pare a kada se branite morate platiti reparacije i gubite relation s njima, da ne pričam da su malo OP. Ukratko, puno problema\n- Final patch - kao što sam prije rekao, zadnji patch je dosta toga breakao, najbolje je biti na oldver na steamu koja radi bez problema, testirano na 100+ turnova na SP i MP te svi objeručke preporučuju. Tim trenutno radi na novoj igri tako da je pitanje kada će biti novi update koji će to fixati jer manji tim radi na ES2, ali evo 19.10 je bio novi patch patcha koji je fixao neke stvari\n  \n\n  Evo i shill video za kraj\n  \n\n  https://youtu.be/VKEawmH-l9c",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "wutangfan (HugoStiglitz)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83822": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@Amon#83379 zasto vrijedas fallout? Iznenadio sam saznati da je nesto toliko lose moglo izaci iz obsidiana.",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Amon"
        ]
      }
    },
    "83823": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @helot#83556 Dodaje civilizaciju koja breaka game radi diplomacije i doslovce vas non stop napadaju i žicaju pare a kada se branite morate platiti reparacije i gubite relation s njima, da ne pričam da su malo OP. Ukratko, puno problema\n\nNot gonna lie, ovo pripada u politiku pod naslovom 13% DLC xD",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83827": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "The Outer Worlds  mi je osobno najveci letdown  od igre ikad. Meh gunplay, unmemorable likovi, kvazi cartoony grafika i jedna od najmanje engaging prica koje sam igrao.\n\nCijela igra mi ima feel kao da je na brzinu sklepana kako bi sifonirali Bethesdine fanove kad su ovi pocinili suicid sa Fallout 76icom.\n\nDa nije tolika susa RPGova Outer Worlds bi meni bio 3/10, ovako je neki slab 6/10. \n\nZa one koje traze dobre \"nove\" RPGove preporucam: Disco Elysium, Greedfall i Underrail",
      "votes": {
        "upvoters": [
          "Dome",
          "KitKat (H(x))",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83832": {
      "poster": "Amon",
      "content": "@Johnny_Bravo#83822 Nisam baš neki fan fallouta, zato. Ali ova igra se barem može završit dosta brzo pa nije tako strašno.\n\nPS slažem se sa kolegom @MarokMarsci i preporučam RPGove koje je on naveo, greedfall pogotovo",
      "votes": {
        "upvoters": [
          "netflix (seximan)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84041": {
      "poster": "Franjo_Ferdinand (Franjo Ferdinand)",
      "content": "@SuperSjajan3#79526 Ako te interesira više management države nego dinastije, preporučam Europa Universalis 4 (ili 5 ako ga izdaju u neko dogledno vrijeme i bude dobar, makar nema previše govora o tome). Neki će reći da je to samo map painter (što je meni osobno samo po sebi ionako zabavno), ali mislim da ima više gameplaya od HoI4 i UI je puno bolji od CK2 (CK3 nisam igrao no koliko vidim dogodila su se značajna poboljšanja). CK2 je besplatan, BTW.\n\nKod managementa države, ekonomije i diplomacije bih spomenuo i Victoria 2 no ne mogu reći osobna iskustva jer ju kao ni CK3 nikad nisam igrao. To je već dosta stara igra i čekam da napokon izađe Vic3.\n\nI za kraj, jedno upozorenje za Paradoxove igre - paziti na DLC. Svaka igra ima desetke DLC-a i nepažnjom se to vrlo lako može pretvoriti u stotine potrošenih eura.",
      "votes": {
        "upvoters": [
          "SuperSjajan3"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84043": {
      "poster": "InCogNiTo124",
      "content": "> @Franjo_Ferdinand#84041 management države\n\nTakoder, Democracy serijal",
      "votes": {
        "upvoters": [
          "Franjo_Ferdinand (Franjo Ferdinand)",
          "MarokMarsci (Collapse Enjoyer)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84054": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "# [Astroneer](https://store.steampowered.com/app/361420/ASTRONEER/)\n\nkul i chill indie igra koju sam kupio u early accessu prije 4 godine, sad sam je napokon odigrao\n\nbejsikli si astronaut u nepoznatom solarnom sistemu i prezivljavas i pokusavas pobjec \n\n9/10 - vrijedi uzeti za 15€ kad bude na snizenju \n\ne, da, ima i coop",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124",
          "Koalefant",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84055": {
      "poster": "helot",
      "content": "@Johnny_Bravo#83822 \n\nTo više nije isti obsidian, Outer Worlds su shillali kao novi Fallout New Vegas ali iskreno je prosječna igra, malo bolja nego Fallout 4 koji meni nakon FNV nikako nije sjeo.\n\nMislim igrao sam čim je izašlo preko xbox passa koji sam dobio s cpuom pa su možda nešto promijenili i dodali, ali općenito ni čak vanilla fnv nije bio tako bland imho, priča je average, weapona malo, opcija za questove isto malo, companion questovi su average do bezveze. Ljudi su bili mad jer su ubacili lezbijski companion quest, ali mene to nije smetalo koliko je cijeli taj quest line bio cringe do boli kao da je netko iz biowarea pisao radnju za to, užasno. Ljudi koji su igrali FNV sjetit će se Gannona ili Veronice i nek usporede to s ovim proLGBT cringe questom. \n\nNažalost Obsidian nije ono što je bio tijekom KOTOR2 i FNV dana ili dana starih rpgova i razočarali su stare fanove pogotovo jer su imali jedne od boljih igara napravljenih koji su meni među najdražim (Kotor2, FNV, Alpha Protocol).\n\nIspričavam se za dugi rant, samo onak moje mišljenje za Outer Worlds koje je kolega spomenuo gore\n\n@MarokMarsci#83827",
      "votes": {
        "upvoters": [
          "Amon",
          "Johnny_Bravo (a beautiful and unique snowflake)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84062": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@helot#84055 tbh nikad nisam shvatio toliki praise oko kotor-a. Koliko god pricali da imas izbora, ili si normalno ljudsko bice ili totalni psihopat bez iceg izmedu (i kreia je nezadovoljna sto god napravio). Isto mozes propustiti ogromne sekcije contenta s companionima ako nisi rekao tri puta pravu stvar na trim mjestima koja su jedina mjesta za influence za njih i cijeli epilog je ustvari nedovrsen. Zabavna je ali ni blizu dubini FNV/Tyranny/MoTB.\n\nouter worlds je toliko plitak i bezlican da se nema sto reci.",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84065": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "> @Johnny_Bravo#84062 kreia je nezadovoljna sto god napravio\n\njebo joj pas mater slijepu aaaaaaaaaaaa zasto si me podsjetio na nju\n\nosobno mi je kotor2 bio prerubovit, prvi kotor je 10/10 bioware rpg tho",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84066": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@MarokMarsci#84065 kreia je odlicna. Tvoje binarne interakcije sa svijetom su manje takve",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84067": {
      "poster": "Filemon",
      "content": "> @helot#84055 čak vanilla fnv nije bio tako bland\n\n> @helot#84055 Nažalost Obsidian nije ono što je bio tijekom KOTOR2 i FNV dana ili dana starih rpgova i razočarali su stare fanove pogotovo jer su imali jedne od boljih igara napravljenih koji su meni među najdražim (Kotor2, FNV, Alpha Protocol).\n\nlik je ti FNV dobar ili ne lol\n\nObsidian mi je i dalje jedan od rijetkih studija koji nešto može najavit, i to mi je dovoljno da znam da ću kad tad tu igru odigrat i u najgorem slučaju će biti ok.",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84068": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "Craktorio (factorio). Would (not) recommend. Posebno ne Eovcima s automatizacije.",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Ducky",
          "Filemon",
          "Lyras",
          "__builtin_popcount (std::popcount)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "84076": {
      "poster": "helot",
      "content": "@Filemon#84067 \n\nMožda sam se krivo izrazio, govorio sam o vanilla FNV bez DLC-eva i uspoređivao s OW u tom stanju.\n\nOW nije ni do koljena FNV-u nažalost, čak Alpha Protocol s osakaćenim gameplayem kakav je je superiorna igra radi storya i mogućnosti izbora radi koje sam replayao igru više od 3 puta. Kotor2 s Restoration modom je isto jednostavno fenomenalna igra.\n\n![](assets/2020-10-25/00001.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84247": {
      "poster": "glava222",
      "content": "@Franjo_Ferdinand#84041 \n\nEU igre su mi više za ljubitelje 4x strategija, a CK sam uvijek doživljavao ko nekakve ultra bolesni simse\n\nProbao sam jednom Victoriu sa frendom, i ko ljubitelji impenetrable igara za koje trebaju godine da se nauče, oboje smo samo to pogledali i peace outali, ain't nobody got time for that",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "84258": {
      "poster": "Dome",
      "content": "@glava222#84247 victoria je doslovno excel spreadshit i pokusavas ga dobit, iako bude jako zabavno kad pocne industrija boomat i revivas yugoslaviu kao hrvatska i pokoris turskikebab",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "KitKat (H(x))",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "85592": {
      "poster": "helot",
      "content": "Paradigm\n\nŠto reći, click and point avantura, puzzleovi su relativno lagani, ali artstyle, muzika i VA su odlični, šale su definitivno za ljude koji se osjećaju kao \"boomeri\" u duši, doslovce sam se smijao na svakoj interakciji s predmetima/ljudima unutar igre. \n\nStory je zanimljiv i ima određenih \"twistova\" i dodataka koji su pomalo neočekivani, makar se dosta toga da saznati iz trailera. Ono što je najviše zanimljivo je da je doslovce jedan lik iz Australije sve sam napravio (osim naravno drugih VA).\n\nSvakako preporučam, nije bogzna što predugačko (oko 5h da se prođe brzo), ali za 7 eur koliko je sada na Steamu je svakako odličnih par sati zabave da bi nakon toga išli instalirati Monkey Island ili Grim Fandango s obzirom da ova igra budi u meni tu nostalgiju.\n\nAko vas trailer i intro ne uvjere nakon mojih riječi, onda igra nije za vas :D\n\nhttps://youtu.be/lS46leUFXek\n\nhttps://youtu.be/3JG-6UsMuTo",
      "votes": {
        "upvoters": [
          "[deleted]",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "85610": {
      "poster": "Amon",
      "content": "[Chippy](https://store.steampowered.com/app/602700/Chippy/)\n\nIgra čije ime zvuči tako slatko i lijepo, ali iza njega se skrivaju sati i sati frustracije. Bullet-hell shooter gdje je cilj ubiti bosseve tako da chippate njihove dijelove (pixele). Igra je užasno addicting, ali što se više igra to level postaju teži (eksponencijalno), a frustracija se gomila (faktorjelno). \n\nWould recommend anyway, malo da se bruse refleksi",
      "votes": {
        "upvoters": [
          "mAcaLukas (mAca Lukas)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "92073": {
      "poster": "Mariox",
      "content": "@Amon#85610 probao sam to, ali su mi bolji obicni bullet hellovi od Cave i touhou. Mislim da target audience ove igre nije bila postojeca shmup populacija nego obicni gameri",
      "votes": {
        "upvoters": [
          "Amon",
          "Ducky"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117198": {
      "poster": "Mariox",
      "content": "[Bloons TD 6](https://store.steampowered.com/app/960090/Bloons_TD_6/)\n\nJako solidan tower defense, platio sam ga < 1€ na popustu.\n\nIgrica ima policije \"mobilne igrice\" ali samo donekle. Npr mozes pay to winat, ali nema premium currencia koji te jebe. Osjeti se da je port s mobilnog na desktop, ali imaju hotkeyovi za sve funkcije, vrlo dobro.\n\nOsim tog pay to wina, jako mi se svidja",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "199441": {
      "poster": "Bobicki",
      "content": "[BeamNG.drive](https://store.steampowered.com/app/284160/BeamNGdrive/)\n\n- skinem mod za neki bijesni Mercedes\n- pustim narodnjake\n- razvučem ga 260km/h po autoputu\n- sletim s ceste i prepolovim auto u sudaru\n\n10/10, savršena igra tijekom pisanja diplomskog",
      "votes": {
        "upvoters": [
          "Koalefant",
          "Lyras",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "spampers (majmunska boginja)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Kuhar",
          "Lyras",
          "Mioch",
          "Quarz",
          "Red_Baron",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "ink",
          "mAcaLukas (mAca Lukas)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "spampers (majmunska boginja)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "200738": {
      "poster": "BigZ1",
      "content": "Šah\n\nSolidna igra, moš igrat protiv kompjutera koji te riješi ko križaljku ili protiv igrača. Nažalost nema kampanje, imate samo tutoriale koji su dobri za igranje. Solidno igrat protiv igrača vašeg ranga. No igra je ukratko opisana u ovom videu. \n\nhttps://www.youtube.com/watch?v=D2RrRsBgbv0",
      "votes": {
        "upvoters": [
          "Bobicki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobicki",
          "Filemon",
          "NekocBraca",
          "__builtin_popcount (std::popcount)",
          "jadzia-dax (Jadzia Dax)",
          "swish41 (PlavušaSFilozofskog)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "200755": {
      "poster": "Koalefant",
      "content": "@BigZ1#200738 grafika je dost losa ngl",
      "votes": {
        "upvoters": [
          "BigZ1",
          "Bobicki",
          "Grumio",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "janeromero (Serial Number Q5U4EX7YY2E9N)",
          "spampers (majmunska boginja)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220598": {
      "poster": "KitKat (H(x))",
      "content": "### Hades\n\nInače ne igram puno igre ovakvog tipa, ali bilo mi je dosadno i imala za izrazitu potrebu za prokrastinacijom, pa rekoh, ajmo probat.\n\nBila je to dobra odluka.\n\nIgrate kao Hadov sin, koji u svom \"it's not a phase, dad\" buntu odluči da hoće pobjeći od kuće, samo što je kuća podzemni svijet pa eto, to malo komplicira život. Usput upoznaš svu rodbinu s Olimpa i otkriješ razne stvari koje grade realno minimalističku, ali dobro izvedenu priču.\n\nGameplay je dobar. Izaberi oružje, skupljaj randomised powerupe and git gud. Svaki put kad umreš, gubiš te powerupe (osim onih permanentnih na onom ogledalu) i ideš ispočetka. Kako napreduješ, tako otkrivaš male komadiće priče i stvari o raznim likovima koje upoznaš usput. \n\nZa roguelike igre, 10/10 izvedba, preporučam",
      "votes": {
        "upvoters": [
          "BedaTheNic",
          "Bobicki",
          "Filemon",
          "General_Kenobi (Aborteur)",
          "Hrvoje (Hrvoje45)",
          "Joji",
          "Koalefant",
          "Lyras",
          "Mariosss77 (Trevor)",
          "MarokMarsci (Collapse Enjoyer)",
          "mAcaLukas (mAca Lukas)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220600": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "## War Thunder\n\nbesplatni tenkići, avionići, brodići, helikopterići.\n\nCrna rupa vremena, razuma i zivaca, al opet dovoljno kezual da opalis jednu partiju unutar 10min da se malo odmoris od ucenja. Igram otkad je izasla iz bete, jos uvjek sam skrabina. Rusi su op, njemci su op, o amerima da ne pricam, britain namba wan, spitfire f mk ix moja ljubav, hisparkosi su mi zivot skratili za 10 godina.\n\nOcjena 7/10\n\nPreporuka: nemojte igrat osim ako nemate 1000h za grindanje ili 1000kn za preskocit grind",
      "votes": {
        "upvoters": [
          "Bobicki",
          "KitKat (H(x))",
          "Retard00",
          "ZvonkoSisoje",
          "[deleted]",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}