{
  "title": "IQ krugodrk",
  "creator": "[deleted]",
  "slug": "iq-krugodrk",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "40559": {
      "poster": "[deleted]",
      "content": "@Miki#40549 \n\nJa sam vise mislio da za te igrice recimo treba 50 posto iq i onoga sta dolazi iz toga, i 50 posto nekih fizickih karakteristika. Ovo lupam bez veze. A za sah je recimo 75 posto iq i 25 posto memorija. ili tako nesto. Mislim da je sah, mozda go, igra u kojoj  iq igra najvecu ulogu na kvalitetu igraca u odnosu koliko igra u drugim igrama. I zbog toga se elitu u sahu smatra genijalcima.  A ima i na netu IQ određenih igrača iz vrha saha pa si pogledaj, mislim da su brojke 170+  na SD 15 u vecini slucajeva.  Ako nisam falio brojku Giri je u jednom intervju reko da mu je 178. Mozda za LOL treba bit inteligentniji ali cisto sumnjam.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40623": {
      "poster": "Miki",
      "content": "@GAVRAN#40559 \n\nMožda jednostavno način razmišljanja koji stekneš igranjem šaha (percepcija polja i sve to) pozitivno korelira sa rješavanjem IQ testova (koji su po meni jako flawed način računanja inteligencije al to je već druga priča). Što želim reći je da se IQ igrača šaha možda značajno poveća u periodu tijekom kojeg uči igrat šah (to bi bio zanimljiv eksperiment).\n\nTakođer možemo ovome pristupiti i sa računarske prespektive, AlphaGo (računalo koje je dobilo onog prvaka u igri go) se smatra \"inteligentnijim\" od onog koje je pobjedilo u šahu.  Tu sad već ulazim u filozofiju umjetne inteligencije i kako definirati inteligenciju, ali možemo vidjeti da se tek počeo raditi napredak u rješavanju igara kao što su Starcraft i Dota2. Očito je računalnu teže rješiti te probleme jer je prostor pretraživanja puno veći nego kod igri kao šah i go, pa možemo reći da je potrebna \"veća inteligencija\" za potpuno ovladavanje tim igrama jer su same igre kompleksnije.\n\nUpravo je ta \"jednostavnost\" šaha razlog zašto su na vrhu samo \"najinteligentniji\" jer se svaka mala greška mora kažnjavat. Iako ljudi nisu još došli na razinu da mogu apsolutno savršeno odigrati partiju računalne igre (jer je puno teže, vjv. i nemoguće za ljude) već se mogu uvidjeti ti neki \"posebni\" igrači koji mogu kažnjavati i najmanju grešku neprijatelja i iskoristiti je u svoju prednost.",
      "votes": {
        "upvoters": [
          "Dome",
          "Marinjo",
          "NekocBraca"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40655": {
      "poster": "[deleted]",
      "content": "@Miki#40623 \n\nTestovi mense su sablonski, ali  testovi za mjerenje iq na visoj razini nisu bas tako debilne crtice i kvadratici kao sto ti mensa ponudi. Ima smisla ovo da sah poboljsava rjesavanje tih testova. Da se njihova inteligencija povecava e to ne znam. Svi ti sta su sad u vrhu saha su već kao klinci  pobjeđivali vrhunske igrače. Postali GM level maloljetni, ima slucajeva sa 13,14 godina. A to nije bas neka bezvezna titula.  Mozda im se i povecava, ali su se sigurno rodili s daleko visom od drugih. \n\nOvo za AlphaGo i AlphaZero, to je ista masina i vecina software je ista, samo joj je namjenu zamijenili. Ako sam ja dobro pohvatao. Da je Go inteligentniji od Zero nisam nigdje procitao, kako su to usporedili,jel to neka fora. Jedino sta sam cuo je da su joj dali vise vremena da nauci igrat go nego sah. Jer je i go i sah naucila igrajuci sama protiv sebe. A i događaj s AlphaGo je bio vise medijski popracen jer je to bio prvi put da je prvak u gou izgubio od racunala. A ovi iz deep minda su garantirali da će se to desiti. Ljudi gube u sahu od racunalo već 20 godina kad je Deep blue sredio kasparova. Svako bolje racunalo bi danas deklasiralo bilo kojeg sahista. Sto posto sa siguran da AlphaZero sluzbeno nije odigrala ni jednu partiju s bilo kojim sahistom, tako ne znam koju pratiju spominjes. Samo je kramnik bivsi prvak sudjelovao u pripremi i nadgledao mec zero vs stockfish. Stockfish je drugo superracunalo ne igrac ako si na to mislio.\n\nOva usporedba umjetne i ljudske inteligencije nema nikakvog smisla. Jer za neku gejmersku igricu umjetnoj  inteligenciji treba \"vise inteligencije\" nego bi joj trebalo za sah onda su igraci te gejmerske igrice inteligentniji od igraca saha. jel to zaključak? nije mi uopce jasno sto si htio poruciti tom izjavom. naravno da ce joj trebati vise kad u sahu ima 10 pravila s figurama i promociju u zadnjem redu, 64 polja i to je to. a tamo u tim igricama ima valjda i vise mapa, vise oruzja, vise likova, i na kraju joj izađe milijon pravila. za sah 20 linija a za dotu 20 tisuca linija koda. I sad jer treba vise linija koda igraci dote inteligentniji.  jel to trebao bit zakljucak. definirat ljudsku ili umjetnu inteligenciju? i ako se radi o umjetnoj kakve to ima veze sa inteligencijom igraca saha i jedne od tih igrica.",
      "votes": {
        "upvoters": [
          "Fica (Prof)",
          "Miki"
        ],
        "downvoters": [
          "tamnodrvo96"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "HotPotato"
        ],
        "tuga": []
      }
    },
    "40656": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@GAVRAN#40655 Jako puno pričaš o inteligenciji za čovjeka koji ne shvaća da pojam inteligencije nije uopće čvrsto definiran pa tako tvoj mini-rant, koji je inače pun odvratnog laicizma bez naznake neke volje za učenjem, čak i da je činjenično točan s tehničke strane, nema apsolutno nikakvog značaja.\n\nOno što je činjenica je da forma inteligencije ima iznimno puno, tako da u krajnjem slučaju bilo koja usporedba koju si ovdje radio također nije značajna, jer nije kontrolirani proces.\n\nŠto se tiče znanstvene strane, da zaključimo baljezganje, Dota je s obzirom na broj poteza daleko složenija igra od šaha. Zahtjeva veću inteligenciju u nekim područjima, kao npr. u mehanici i pamćenju, dok vjerojatno inducira manje stresa nego 3-minutni blitz, pa stoga zahtjeva manje brzog razmišljanja.\n\nKao i kolega polinom  trebao bi se ipak informirati oko nekih stvari prije nego što kreneš pričati o njima ko da znaš o čemu pričaš.",
      "votes": {
        "upvoters": [
          "Bobinator",
          "Hrvoje (Hrvoje45)",
          "Mirko_",
          "Trolololica",
          "[deleted]",
          "lup",
          "tamnodrvo96"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40661": {
      "poster": "Miki",
      "content": "@GAVRAN#40655 \n\nOno što sam htio reći je da je šah \"riješen\" pred više od 20 godina, Go je \"riješen\" pred par godina, a računalne igre kao što je Dota nisu jos \"riješene\". Nisam htio uspoređivati što bi bilo kad bi jedno računalno igralo protiv drugoga jer to nema smisla, nego sam uspoređivao kada su dosegli nadljudske performanse i moja logika je što je to ranije to je potrebno \"manje\" inteligencije.\n\nOvaj tvoj zadnji odlomak je upravo ono što sam htio reći. U šahu je prostor pretraživanja manji pa se mora kažnjavati svaka i najmanja greška, dok je u računalnim igrama on puno puno veći (beskonačan?) i nismo još na toj razini da je se može odigrati apsolutno savršeno. Moja usporedba sa umjetnom inteligencijom je čisto paralela na tvoje IQ testove jer realno ne postoji način za \"mjerenje\" inteligencije i jedan argument je jednako validan kao i drugi jer su oba loša.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40662": {
      "poster": "Filemon",
      "content": "> @micho#40656 Zahtjeva veću inteligenciju u nekim područjima, kao npr. u mehanici i pamćenju\n\nMislim da ni mehanika ni pamćenje ne spadaju pod većinu definicija inteligencije. Pogotovo ako je definicija u nekom od dva najčešća smjera: sposobnosti snalaženja u novim i nepoznatim situacijama ili sposobnosti da se steknu i primijene znanja i vještine iz danih informacija i iskustava.\n\nRefleksi, koordinacija oko - ruka i muscle memory te pamćenje podataka su svakako vještine, ali iz njih se ne stvaraju nove informacije.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "Miki",
          "Widlar"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40667": {
      "poster": "[deleted]",
      "content": "@Miki#40661 \n\nZelis rec da je racunalu potrebno manje umjetne inteligencije da rijesi taj problem ili je covjeku potrebno manje inteligencije da igra tu igru? Ako je prvo onda ne kuzim kakve to ima veze s tvojim prvim postom u temi. Koja je konekcija ljudske i umjetne inteligencije osim druge rijeci? Vuces tu paralelu pa me zanima jel mislis da posto je za neku gejmersku igru potrebno vise umjetne inteligencije da ju se svlada, onda  je i za njeno igranje potrebno vise ljudske inteligencije? \n\n@micho#40656 \n\nZasigurno je Miki govorio o emocionalnoj inteligencije. Inace, Usain Bolt je najinteligentniji covjek jer ne vjerujem da ima netko mehanicki bolji od njega. Kolega Filemon je to lijepo objasnio.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40677": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@lup#40546 SPosobnost dobrog pamcenje sahovskih algoritama( sto je to uopce, evaluacijske funkcije koje engini koriste?), poteza i otvaranja jako malo ili nimalo ne utjece na uspjeh jakih sahista u smislu da je skoro svatsko sposoban zapamtiti toliko  koliko je za sah potrebno. Na ozbiljnim turnirima sahisti se pripremaju za protivnika prije partije, a na jako ozbiljnim cak i prije turnira(parovi su poznati) te je tu mnogo bitnije ispravno predpostaviti koje otvaranje/varijantu ce protivnik igrati, nego zapamtiti tonu poteza.\n\n@Miki#40623 Najbolje sto mozes napraviti(dok si jos dijete) da maksimiziras svoj IQ je zdravo se hraniti, a najbolje sto mozes napraviti da minimiziras deterioraciju tokom odrasle dobi je prakticiranje zdravog zivota i tjelovjezbe, tako da ove pricaju padaju u vodu. \n\nPristup s racunarske perspektive je za ovu konkretnu raspravu nebitan jer ne govori nista o nacinu na koji ljudi razmisljaju o tim igrama. Racunala uvijek koriste odredeno stablo pretrazivanja i neku evaluacijsku funkciju sto je za ljude neupotrebivo.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40689": {
      "poster": "PeroPerica",
      "content": "> @iLabaviUmeDaZabavi#40677 da minimiziras deterioraciju tokom odrasle dobi je prakticiranje zdravog zivota i tjelovjezbe\n\nMislim da ovo nije istina. Dok god imaš relativno zdrav život (ne jedeš samo mek i ne sjediš 24/7), najbolja moždana tjelovježba je korištenje samog mozga. Dakle učenje recimo, rješavanje zagonetki, etc.",
      "votes": {
        "upvoters": [
          "Miki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40701": {
      "poster": "Miki",
      "content": "@GAVRAN#40667 \n\nDa, to je ono što želim reći, ako je umjetnoj inteligenciji potrebno više da ju svlada, onda je i za njezino igranje na visokoj razini ljudima potreba veća inteligencija (primjeti da govorim o visokoj razini igre, osnove razine može radit bilo tko tko nauči pravila, isto je i sa šahom). Paralela koju sam povukao je da sam uzeo to kao mjeru inteligencije vrhunskih igrača, ne da kažem da su igrači računalnih igri po inteligenciji superiorniji od igrača šaha, nego da pokažem da je potrebno imat visok stupanj inteligencije da bi se te igre igralo na visokoj razini.\n\n@iLabaviUmeDaZabavi#40677 \n\nNisam govorio o dijetetu, nego recimo da imaš odraslu već sazrelu osobu i počneš ju učit igrat šah. Njezini rezultati bi vjv. porasli, isto kao što se primjerice može vježbom podići IQ.\n\nI mi dok igramo šah koristimo određeno stablo pretraživanja, tako da se tu moram ne složit s tobom da je pristup sa računarske perspektive nebitan. Spomenuo sam ga čisto kao alternativnu mjeru inteligencije potrebne za igranje neke igre na visokoj razini.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40713": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Filemon#40662 što se tiče memorije, kratkotrajna memorija, tj. količina stvari koje možeš u njoj pohraniti je definitvno indikator inteligencije. Jedan dio te inteligencije se odražava u map awarenessu - pratiš što svi rade u igri i na osnovu toga predviđaš gdje će tko biti i koliko će netko biti jak.\n\nDota nije samo oko muscle memorija, nego moraš imati dovoljno dobre \"mehanike\" da bi bio dobar. Dok dio mehanika otpada na vrijeme reakcije (koji nije dio inteligencije), velik dio otpada na znanje kako se kretati. Neke komponente toga jeau vezane uz muscle memory (npr. turn rateovi i kiteanje), ali samo zato što se vježbom neki rad može dovesti na razinu automacije ne znači da to nije inteligencija - nije kao da si naštrebao kretnju, naštrebao si obrazac za kretnju, a inteligencija se svodi na to da taj obrazac trebaš znati primijeniri u raznim situacijama.",
      "votes": {
        "upvoters": [
          "Miki",
          "Mirko_",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40714": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @GAVRAN#40667 Zasigurno je Miki govorio o emocionalnoj inteligencije. Inace, Usain Bolt je najinteligentniji covjek jer ne vjerujem da ima netko mehanicki bolji od njega. Kolega Filemon je to lijepo objasnio.\n\nMože Miki govoriti o inteligenciji kakvoj hoće, ja sam se obratio tebi jer ti si ju počeo uspoređivati s inteligencijom programa koja\n\n- nema razlike od ljudske inteligencije jer inteligencija nije određena vrstom bića koje ju ima\n- ima drukčije (objektivnije) metrike za određivanje inteligencije, koje nisu kompatibilne s manje objektivnim metodama za ljude",
      "votes": {
        "upvoters": [
          "Miki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40723": {
      "poster": "Filemon",
      "content": "@micho#40713 Onda sam te krivo shvatio, mislio sam da pričaš o memoriji i mehanici kao samom pamćenju i kretanju, jer je imalo smisla u kontekstu rasprave.\n\nI jedno i drugo su potporni procesi u pozadini koje koristimo, npr. pamćenje da bi kao u ovom primjeru, ti na kratkoročnoj memoriji toga kako se netko kretao inteligentno predvidio njihova buduća kretanja i koliko su opasni.\n\nOdabir odgovarajuće taktike i strategije u danoj situaciji je svakako inteligencija. Mehaničko izvršavanje kako sam ga opisao nije.",
      "votes": {
        "upvoters": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40731": {
      "poster": "[deleted]",
      "content": "@Miki#40701 \n\n\"Da, to je ono što želim reći, ako je umjetnoj inteligenciji potrebno više da ju svlada, onda je i za njezino igranje na visokoj razini ljudima potreba veća inteligencija (primjeti da govorim o visokoj razini igre, osnove razine može radit bilo tko tko nauči pravila, isto je i sa šahom).\"\n\nNije da te vrijeđam, ali iskreno ovo je najgluplja izjava sto sam cuo u dugo vremena. To je usporedba u rangu, pošto je robotskoj ruci potrebno vise vremena za ubrati metar kubni grožđa nego razbiti metar kubni kamena u kamenolomu. Onda je za čovjeka branje grožđa fizički teži posao od razbijanja kamena u kamenolomu.  Kakve veze ima to kako nešto obavlja umjetna inteligencija, robot, mašina,životinja nebitno s time kako to radi čovjek? Ako majmun brže pobere banane od jabuke, onda berač jabuka mora bit veći stručnjak od berača banana?",
      "votes": {
        "upvoters": [
          "Ducky",
          "ink"
        ],
        "downvoters": [
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Lyras",
          "Miki",
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40741": {
      "poster": "Miki",
      "content": "@GAVRAN#40731 \n\nIsprogramiraj robota da razbija kamenja i robota za branje grožđa i reci šta je teže.\n\nAko je problem teži posljedično rješenje mora bit kompliciranije (inteligentnije), po meni tu nema diskusije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40742": {
      "poster": "[deleted]",
      "content": "@micho#40714 \n\nS drugom točkom si potvrdio sta sam rekao gore. Umjetna inteligencija se nema smisla uspoređivati sa ljudskom niti obratno.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40751": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@GAVRAN#40742 Nemoj strawmannati - ono što je problem je što znamo premalo o inteligenciji da bi mogli napraviti dobre testove za ljude. Ne znači da se ne bi trebala uspoređivati inteligencija ljudi i programa, nego da je besmisleno uspoređivati inteligenciju programa s IQ testovima.\n\nUsporedba inteligencije je prilično jednostavan pothvat. Uzmeš dovoljno generalizirani zadatak, i uspoređuješ tko ga bolje obavi n puta, recimo 100. Ako je zadatak u većoj mjeri fer, onaj tko pobjedi više puta je inteligentniji. Zato je stockfish inteligentniji od bilo kojeg čovjeka u šahu, zato je AlphaZero inteligentniji od stockfisha i konsekventno od bilo kojeg čovjeka u šahu, jer smo takvim testovima to i potvrdili.",
      "votes": {
        "upvoters": [
          "Miki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40755": {
      "poster": "[deleted]",
      "content": "@Miki#40741 \n\nUmjetna inteligencija ce igrati sah ili dotu, ne programirati sah i dotu. Isto kao sta ce robot obavljati posao a ne programirat posao. Ovo nije usporedba dviju stvari i pa korelacija, nego usporedba na usporedbu pa korelacija. U odnosu na ono sto si rekao prije.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40766": {
      "poster": "[deleted]",
      "content": "@micho#40751 \n\nJa nisam govorio kakav je pothvat usporedba inteligencije,il dali bi se trebala il nebi, nego da nema SMISLA uspoređivati ljudsku i umjetnu. To su dva sustava, jedan s praktički beskonačnom memorijom i par milijuna kombinacija po sekundi, a drugi sa patetičnom memorijom i par kombinacija po sekundi. Možda tebi ima, al meni nema. I ne samo ta usporedba, nego usporedba obavljenih zadataka(dva zadatka koja nisu ista, ovaj tvoj primjer su svi radili istu stvar) umjetne inteligencije te projekciranje dobivenih rezultata na  ljude.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40772": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@GAVRAN#40766 Pa znam da nisi govorio o smislu, o tome sam ja pričao kad si ga ti tako zbog nerazumijevanja štiva dumb downao.\n\nMislim da si totalno u krivu što se tiče limitacija - ljudski mozak iako ima veliki kapacitet ne može iskoristiti sav kapacitet. Ovo se događa i u računalima - čak smo primijetili da neuronske mreže doživljavaju isti fenomen gdje je samo jedan mali dijelić mreže efikasan kod rješavanja zadatka kao i ljudi. Ono što ne razumiješ ili odbijaš shvatiti je da računala imaju puno veći potencijal za pamćenje od ljudi jer ih se može paralelizirati, pa taj fenomen specijalizacije ne utječe toliko na njih. Ono što ne može naučiti jedan program, može drugi. Ljudi nemaju kapacitet biti toliko svestrani i iako mogu do neke mjere konkurirati u specifičnom području, potencijal računala je daleko veći i prije ili kasnije će nadmašiti ljudske sposobnosti. U većini slučajeva razlog zašto to već nije slučaj je zato što ne dajemo računalima podatke jednake kvalitete onima koje mi dobivamo, ne jer su ograničeni kapacitetom - 4 TPUa su najbolji igrač šaha na svijetu zato što nisu bili ograničeni kvalitetom podataka i ljudskim znanjem.\n\nESIT: Ali ono što sam htio reći je da usprkos tome što jedan ima veće mogućnosti od drugoga ne znači da se ne bi trebalo uspoređivati. Naši preci su isto imali smanjene sposobnosti pa uspoređujemo inteligenciju između njih i nas. Ljudi koji govore da se to ne bi trebalo uspoređivati su oni koji se boje da činjenica da računala imaju veći potencijal od ljudi ima neke negativne posljedice. Rezultati tih ispitivanja su ko zaključci da je 4 > 3. Znanstveno relevantni, ali ne mijenjaju baš ništa.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40779": {
      "poster": "[deleted]",
      "content": "@micho#40772 \n\nGovorio sam da nema smisla raditi usporedbu inteligencija, ili jos gore nema smisla raditi usporedbu obavljanja dvaju različitih zadataka pomocu UI i projekciju dobivenih rezultata na ljude. \n\nOstatak poruke ti je ista ideja kao u mojoj zadnjoj poruci. Samo si dao obrazloženje.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40793": {
      "poster": "[deleted]",
      "content": "@micho#40772 \n\nZadnje 2 recenice tvog dodatka ne znam kako imaju veze s icime prije napisanim. A 3. odzada je valjda neka, u kojoj bi se ja trebao prepoznati ili neka tvoja pretpostavka sta isto ne kuzim s cime ima veze. \n\nA za usporedbu ti imas svoje misljenje , moje je suprotno . Po meni nema smisla uspoređivati stvari u kojima je razlika nebo i zemlja. U kojima se 100 posto zna ishod meca. Niti ce san marino u ratu dobiti italiju,a nece ni carlsen dobiti stockfisha. Zasto bit budala i zaletavat se glavom u zid.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40797": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@GAVRAN#40793 Ova argumentacija je analogna onome \"Svi ćemo umrijet, zašto živjeti?\". U znanosti se stvari proučavaju iz znatiželje i zbog napretka. Usporedbom inteligencije možemo ne samo saznati kako obilježja računala utječu na pojedine tipove inteligencije i time poboljšati vlastitu, nego možemo naučiti nešto i o skrivenim pravilima u određenim zadacima. Ne samo to, takvo znanje će nam biti potrebno u ovom procesu spajanja s računalima. Tako da nije moje mišljenje da ima smisla uspoređivati inteligenciju, to je potrebno za razvoj znanosti. Možda je tebi to teško pojmiti jer ne vidiš da će čovječanstvo intenzivnije živjeti u simbiozi s računalima, možda ne vidiš vrijednost u toj grani znanosti, da je potrebna usporedba nečeg što će u konačnici biti \"ljudsko\", ali ja ti preporučam da se zagledaš u svoj mobitel pa možda skužiš da se takvo nešto već događa i da je poznavanje onoga što mobitel radi bolje od tebe, u čemu je inteligentniji, ipak relevantno znanje.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40821": {
      "poster": "[deleted]",
      "content": "@micho#40797 \n\nJoš nigdje nisam naisao na dokaz da se urođena inteligencija može poboljšavati. A i nikad nisam naisao na slucaj kad je neki retard postao genij, ako nije bio genij od malena. Ne znam od kud ti ta tvrdnja. Tipovi računala utječu na tipove inteligencije(cije racunalne). Sta sad racunala imaju i ostale vrste inteligencija. Jesu pocela osjecati? Za razvoj znanosti, ti ne uspoređuješ inteligencije, nego elemente ljudske pokusavas prenijeti na umjetnu. Voli bi znat kakav je postupak prenosenja umjetne na ljudsku. Oce li doc trenutak kada ce mozak raditi brzinom masine i imati memoriju masine. Jer ako nece onda si trosio vrijeme,ili u prijevodu zaletavao si se glavom uzid. Ti ces unaprijediti masinu, i razlika izmedju ljudi i masina ce se sve vise povecavati u korist masina.To svaki retard zna pa mi nije zasto vrtis istu recinu tri puta u svakoj poruci. \n\nTi i kolega Mike ste s usporedbe inteligencije elitnih sahista i gejmera otisli na temu, tko ima bolje sise bellucci ili hayek,koja je po nekoj teoriji relevantna za određivanje pocetnog pitanja.\n\nCisto ovako, da vidim dal si laprdalo ili botum. Po tvojoj procjeni, mjereno na IQ testu do 190 po SD 15. Tko bi ostvario bolji rezultat, top sto sahista svijeta ili top sto igraca LOLa?\n\nPošto ti meni preporucas, onda cu i ja tebi preporucit da se ostavis malo tog ekrana, izađi malo, ima i vani zanimljivih stvari.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40823": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @GAVRAN#40821 Još nigdje nisam naisao na dokaz da se urođena inteligencija može poboljšavati. A i nikad nisam naisao na slucaj kad je neki retard postao genij, ako nije bio genij od malena. Ne znam od kud ti ta tvrdnja. Tipovi računala utječu na tipove inteligencije(cije racunalne). Sta sad racunala imaju i ostale vrste inteligencija. Jesu pocela osjecati? Za razvoj znanosti, ti ne uspoređuješ inteligencije, nego elemente ljudske pokusavas prenijeti na umjetnu. Voli bi znat kakav je postupak prenosenja umjetne na ljudsku. Oce li doc trenutak kada ce mozak raditi brzinom masine i imati memoriju masine. Jer ako nece onda si trosio vrijeme,ili u prijevodu zaletavao si se glavom uzid. Ti ces unaprijediti masinu, i razlika izmedju ljudi i masina ce se sve vise povecavati u korist masina.To svaki retard zna pa mi nije zasto vrtis istu recinu tri puta u svakoj poruci.\n\nJel ti svjesno ili nesvjesno ignoriraš činjenicu da je inteligencija nešto što nije isključivo a priori? Ove izjave su totalno anekdotalne, preporučam da za početak pročitaš [ovo](https://ghr.nlm.nih.gov/primer/traits/intelligence) i pozabaviš se malo osnovama psihologije. Ova pitanja o osjećajima računala su izgleda nastala zbog nerazumijevanja materije. Da, računala mogu osjećati. Primjer toga ti je analiza sentimenta, koja uopće nije nova stvar. Vrlo je tužno što diskriminiraš inteligenciju na ljudsku i računalnu samo zato što umjesto mozga imaš silicij, kad je princip te inteligenciji isti, samo je izvod različiti. Poprilično je bahato to tvrditi kad ni ljudska inteligencija ne radi sasvim isto, ljudi iste stvari mogu različito shvaćati. Ni životinjski mozgovi ne rade kao naši pa opet možemo pričati o njihovoj inteligenciji i najvažnije - možemo je uspoređivati s našom.\n\n> @GAVRAN#40821 Cisto ovako, da vidim dal si laprdalo ili botum. Po tvojoj procjeni, mjereno na IQ testu do 190 po SD 15. Tko bi ostvario bolji rezultat, top sto sahista svijeta ili top sto igraca LOLa?\n\nOvisi o IQ testu. Kao što sam rekao, IQ testovi su subjektivni i generalno beskorisni za mjerenje inteligencije. Inteligencija ima više. To je ono što si trebao shvatiti u ovom razgovoru a očito nisi. IQ testovi kod pojedinaca koji su na vrhu u karijeri mogu samo pokazati koliko je neki test prilagođen kojoj grupi pojedinaca jer su IQ testovi relativni u odnosu na generalnu populaciju. Prema tome, pitanje je totalno krivo postavljeno.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40824": {
      "poster": "MordorGuy",
      "content": "Isusati daj branchajte ovu raspavu u IQ krugodrk temu",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Dome",
          "Filemon",
          "InCogNiTo124",
          "Jakic007",
          "Miki",
          "RS7",
          "feel_d_boot (iNut)",
          "lup",
          "rija"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40835": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@micho#40823 \n\n\"These studies have not conclusively identified any genes that have major roles in differences in intelligence. It is likely that a large number of genes are involved, each of which makes only a small contribution to a person’s intelligence.\" Apsolutno nista novo ovime nisu rekli. \n\n\"Intelligence is also strongly influenced by the environment. Factors related to a child’s home environment and parenting, education and availability of learning resources, and nutrition, among others, all contribute to intelligence.\" Kako education and availability of learning resources utjece na IQ ako je empirijski utvrdeno da djeca imaju najveci IQ prije/u nizim rareda osnove  skole? Na prezervaciju IQ-a da doduse.\n\nSto tocno zamjeras mensinim IQ testovima? Sigurno poznajes ljude u spektru [100,145], korelira li IQ po mensinim testovima s tvojim subjektivnim dozivljajem njihove sposobnosti zakljucivanja? \n\nInteligencija nije kvantifikativna i podjela inteligencije na razne vrste je cisto stvar dogovora. Na temelju prethodnog sintagma \"mjerenje inteligencije\" isto tako nema smisla. Mensini testovi po meni imaju jako dobru korelaciju s definicijom inteligencije: \"Most definitions of intelligence include the ability to learn from experiences and adapt to changing environments\", progresivne matrice u vjerojatno najbolji oblik testa prvog i drugog dijela definicije koji je moguce sprovesti na velikom uzorku ljudi u pismenom obliku.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40836": {
      "poster": "[deleted]",
      "content": "@micho#40823 \n\nKoristim ono sto se danas najviše koristi za mjerenje inteligencije. Kad ti ili netko od znanstvenika napravi nešto što će zamijeniti do sada najčešće upotrebljavanu metodu. Onda ću se prikloniti vama. Trenutno se služim onim što mi nude. Ali vidim da si i psiholog pa budem malo psihologiju proučavao kad si mi ti preporučio.\n\nAnaliza sentimenta kažeš, jeli bacio osmijeh kad su ga poškakljali.\n\nA što se tiče drugog dijela, drago mi je da smo se složili oko šaha.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40846": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @iLabaviUmeDaZabavi#40835 Kako education and availability of learning resources utjece na IQ ako je empirijski utvrdeno da djeca imaju najveci IQ prije/u nizim rareda osnove  skole? Na prezervaciju IQ-a da doduse.\n\nPa IQ nije relavantna mjera. IQ testovi nisu standardizirani, i samim time nisu relevantni. Sad bi ja mogao pričati o tome da su djeca najsposobnija što se tiče \"hardvera\" itd. itd. ali kako ne znam o kakvim IQ testovima pričaš nije vrijedno komentirati. Ne zna se u odnosu na kakvu populaciju se uzimaju, kakva su pitanja, kakva je raspodjela zadataka, i tako. Vidiš uzorak?\n\nMislim gle, slažem se da je to vjerojatno najbolje što imamo. Ali da je IQ odraz inteligencije - čak i stručnjaci kažu da samo u manjoj mjeri, ne trebaš meni vjerovati.\n\n> @iLabaviUmeDaZabavi#40835 Sto tocno zamjeras mensinim IQ testovima? Sigurno poznajes ljude u spektru [100,145], korelira li IQ po mensinim testovima s tvojim subjektivnim dozivljajem njihove sposobnosti zakljucivanja?\n\nNemam ja problema s mensinim testovima, problem je što je cijela metodologija IQ testova izrazito pristrana. IQ je možda najpopularnija metoda procjene inteligencije, ali je samo jako slabo povezan s inteligencijom. Otprilike ti dođe na to ko da mjeriš volumen kompleksnog tijela ravnalom. Možeš dobiti neku osnovnu ideju, ali cijelu sliku - nikako.\n\nUglavnom, dok god je IQ jedan broj, IQ testovi su loš sustav i većinom beskorisni za detaljnu usporedbu inteligencije. Čak i kad IQ postane red brojeva, treba pomno istražiti ŠTO bi se trebalo ispitivati tim testovima, s obzirom da današnji IQ testovi još uvijek znaju imati pristrana pitanja.\n\n> @GAVRAN#40836 Koristim ono sto se danas najviše koristi za mjerenje inteligencije. Kad ti ili netko od znanstvenika napravi nešto što će zamijeniti do sada najčešće upotrebljavanu metodu. Onda ću se prikloniti vama. Trenutno se služim onim što mi nude. Ali vidim da si i psiholog pa budem malo psihologiju proučavao kad si mi ti preporučio.\n\nNajčešće korištene stvari nisu uvijek najbolje. Primjer: Windows, Volkswagen auti, Steinway & Sons klaviri itd. IQ testovi su samo tužna realnost našeg nepotpunog shvaćanja inteligencije i nekompetencije ili nedostatka volje za boljim sustavom.\n\n> @GAVRAN#40836 Analiza sentimenta kažeš, jeli bacio osmijeh kad su ga poškakljali.\n\nNe vidim kako je ovo relevantno za osjećaje, sad pričaš o osjećaju taktilnog podražaja i konceptu škakljivosti. Neki ljudi nisu škakljivi, ovim ih praktički dehumaniziraš. Ali svejedno, računala mogu i to naučiti bez problema. To je samo jedan izlaz za specifične ulaze.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40850": {
      "poster": "[deleted]",
      "content": "@micho#40846 \n\nBilo bi lakse da si rekao odma da se slazemo,nego da smo i jedan i drugi ispisali po 10 poruka.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40856": {
      "poster": "Mike (Klaud Konzultanta)",
      "content": "I ja gledam Rick & Mortya.",
      "votes": {
        "upvoters": [
          "Amon",
          "Gulbash",
          "HeHe (Direktor života)",
          "__builtin_popcount (std::popcount)",
          "iFart"
        ],
        "downvoters": [
          "Ducky"
        ]
      },
      "reactions": {
        "haha": [
          "BedaTheNic",
          "G-bear",
          "GTX9800",
          "Gulbash",
          "HotPotato",
          "McKovalski",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)",
          "feel_d_boot (iNut)",
          "ink",
          "nnn (dinoo)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "40873": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "Glede i u svezi robotskog sentimenta, osjecaju taktilnog podrazaja i koncepta skakljivosti stavit cu ovaj clanak ovdje https://qz.com/1246712/im-building-a-robot-boyfriend-and-you-can-too/\n\nEDIT: nije mi dalo da zalijepim video pa je za potpuni efekt potrebno otvoriti clanak",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "40876": {
      "poster": "Mulder",
      "content": "moram poradit na svom iq i memoriji, dok dođem do kraja posta u ovoj temi već zaboravim što sam pročitao",
      "votes": {
        "upvoters": [
          "1vq",
          "Dome",
          "Filemon",
          "HeHe (Direktor života)",
          "M-16",
          "MarokMarsci (Collapse Enjoyer)",
          "McKovalski",
          "NekocBraca",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "benac (caneb)",
          "ink",
          "miss_anthropocene (neunist.iva)",
          "rija",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Miki",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "40917": {
      "poster": "Bog (Charlie Brown)",
      "content": "@Mulder#40876 \n\nA ja čitam, a ništa ne razumijem",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41414": {
      "poster": "PeroPerica",
      "content": "Evo nešto vezano uz temu [On being smart](https://kam.mff.cuni.cz/~matousek/mustafa-onbeingsmart.pdf)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41420": {
      "poster": "[deleted]",
      "content": "Kako da povećam svoj iq?",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "41423": {
      "poster": "STAGGER_LEE",
      "content": "@Psychosis#41420 \n\nteleci mozak za rucak svaki dan",
      "votes": {
        "upvoters": [
          "Ducky",
          "Filemon",
          "MarokMarsci (Collapse Enjoyer)",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "soplagaitas (sopla)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41426": {
      "poster": "Lyras",
      "content": "@Psychosis#41420 Možeš povećati nešto što se zove kristalizirani IQ, basically, domain knowledge.\n\nŠto se tiče fluidnog IQ-a, get fucked",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41429": {
      "poster": "[deleted]",
      "content": "@STAGGER_LEE#41423 \n\nVolim posolit mozak dobro, jel bolje da nije začinjen\n\n@Lyras#41426 ne vjerujem, oću drugo mišljenje. Mora biti neki kurs na internetu i za to",
      "votes": {
        "upvoters": [
          "Lyras",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Lyras"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "41430": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "throwback na 3. razred kad me stari uvjeravao da školska djeca ne smiju jesti korijen celera jer je to doping za mozak 😂",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Ducky",
          "Mioch",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [
          "InCogNiTo124"
        ],
        "tuga": []
      }
    },
    "41433": {
      "poster": "InCogNiTo124",
      "content": "@micho#41430 jbt jos si dobro i ispo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41435": {
      "poster": "[deleted]",
      "content": "Mene isto interesuje povecanje iq-a. Jel pomaze sta ona rubikova kocka?",
      "votes": {
        "upvoters": [
          "HeHe (Direktor života)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41438": {
      "poster": "[deleted]",
      "content": "@ElitePer#41435 \n\nDobra ideja. Ja sam u zadnje vrijeme počeo gledati dosta šaha na jutjubu. Već se osjećam pametnije.\n\nhttps://youtu.be/fHIVmi-R29w",
      "votes": {
        "upvoters": [
          "HeHe (Direktor života)",
          "InCogNiTo124",
          "[deleted]",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Ducky",
          "__builtin_popcount (std::popcount)",
          "ink"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "41527": {
      "poster": "Lyras",
      "content": "![](assets/2020-06-18/00012.png)\n\nBTFO doomeri [(izvor)](https://ourworldindata.org/intelligence)",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41540": {
      "poster": "HeHe (Direktor života)",
      "content": "Zamisli bit toliko nesiguran u svoje intelektualno znanje da si ga moraš mjerit 👽️",
      "votes": {
        "upvoters": [
          "Dome",
          "Filemon",
          "GTX9800",
          "Hrvoje (Hrvoje45)",
          "JoKing",
          "Kushim",
          "MarokMarsci (Collapse Enjoyer)",
          "McKovalski",
          "Mioch",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "lup",
          "miss_anthropocene (neunist.iva)",
          "xeqte"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "GTX9800",
          "Svarog (Veles)",
          "soplagaitas (sopla)"
        ],
        "wtf": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "tuga": []
      }
    },
    "42047": {
      "poster": "Jezza (Clarkson)",
      "content": "@Psychosis#41438 Negative talent in life",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bioxed"
        ],
        "wtf": [],
        "tuga": []
      }
    }
  }
}