{
  "title": "5G RAN Slicing",
  "creator": "Asura (Asura)",
  "slug": "5g-ran-slicing",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "41811": {
      "poster": "Asura (Asura)",
      "content": "Već par dana gledam malo ovu tematiku pa me zanima ima li nekog ko se susreo time. Ugl. radi se o načinu koji organizira mrežu u više manjih logički mreža koje mogu funkcionirati neovisno i pružati neki service. Može se na to gledati ko da imate mrežu s nekim resursima i sad napravite više manjih docker kontejnera i u svaki stavite sve što treba za pružanje neke usluge. Fora je sad u tome što treba naći koje komponente treba u koji kontejner stavit i u kojoj mjeri da se mreža iskoristi što više a da korisnici usluga imaju najbolju performansu. \n\nTreba i uzeti u obzir da ovo mora biti relativno brzo i da korisnici nisu bakice koje samo sjede na istom mjestu s nekoliko desetaka uredjaja spojenih na mrežu.\n\nIma dosta papera koji se bave time, neki koriste reinforcement learning, neki deep learning, neki heuristike, neki su pojednostavili problem i koristili neke gotove optimizacijske algoritme za pojednostavljeni problem.\n\nPS. Problem sam pojednostavio malo da ne moram puno pisat.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41813": {
      "poster": "InCogNiTo124",
      "content": "Nije li ovo samo problem iz teorije grafova?",
      "votes": {
        "upvoters": [
          "Asura (Asura)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "41814": {
      "poster": "Asura (Asura)",
      "content": "@InCogNiTo124#41813 \n\nMože bit ali ako se pojednostavi dosta, barem po mom nekom mišljenju. \n\nJer ne znaš koliko ćeš korisnika imat spojeno, ne znaš koliko ćeš sliceova napravit.\n\nNisam pročitao niti jedan paper do kraja jer sam ih odabrao 30 pa sam htio vidit dal ne neko možda već našao nešto pa da ja ne moram xD",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}