{
  "title": "[IPIOUZ] Završni ispit - 2019/2020",
  "creator": "Nabas",
  "slug": "ipiouz-zavrsni-ispit-20192020",
  "tags": [
    "FER",
    "Istraživanja, publikacije i odgovornost u znanosti",
    "Ispiti"
  ],
  "posts": {
    "44142": {
      "poster": "Nabas",
      "content": "Zna li netko dal se ponavaljaju pitanja, koliko će biti bodova piše pod nastavnim aktivnostima 14-40 što to znači?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44185": {
      "poster": "Bobicki",
      "content": "@Nabas#44142 Ako će biti kao što piše na uvodnoj prezentaciji, ZI nosi 40 bodova, od čega je potrebno ostvariti 14 bodova (35%) za prag. Vjerojatno zato piše 14-40.",
      "votes": {
        "upvoters": [
          "Nabas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44616": {
      "poster": "Jahac_Rumene_Kadulje (JahacRumeneKadulje)",
      "content": "Pisemo li cijelo gradivo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44619": {
      "poster": "Kristijan",
      "content": "@Jahac_Rumene_Kadulje#44616 ![](assets/2020-06-25/00041.png)\n\nDa, napisali su u obavijesti.",
      "votes": {
        "upvoters": [
          "Jahac_Rumene_Kadulje (JahacRumeneKadulje)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45308": {
      "poster": "Bobicki",
      "content": "Od pitanja s onog popisa s materijala iz 2015-16 ponovilo se jedno 7-8 od 20 pitanja u istom ili sličnom obliku. Dolje sam napisao nova pitanja kojih se sjećam. Kako nisu sva pitanja ili odgovori koje sam napisao skroz potpuni, molim vas da me netko ispravi ako se sjeća kako je trebalo ići. Također ako se sjećate još nekog drugog pitanja koje je bilo, slobodno napišite. Kad skupimo što više pitanja i uredimo ih, onda ću to pripojiti ovim pitanjima iz 2015-16 i sve zajedno staviti na materijale da bude što više starih pitanja za buduće generacije.\n\n**Pitanja kojih se sjećam:**\n\n**1. Što od navedenog ne vrijedi za primijenjena istraživanja?** Otkrivanje novih spoznaja (nešto u tom smislu, uglavnom jedan od odgovora gdje se otkriva nešto novo).\n\n**2. Što predstavlja CC BY licenca?** Ne znam točno kako je glasio odgovor, ali pisalo je nešto kao da je dopušten otvoreni pristup, preuzimanje, korištenje, itd. Bila su dva slična odgovora, a u drugom se spominjalo korištenje samo u nekomercijalne svrhe, ali taj odgovor nije točan. \n\n**3. Zadatak s određivanjem h-indeksa, ne sjećam se točnih brojki.** Išao je kao „Autor je objavio X1 radova koji su citirani Y1 puta, X2 radova koji su citirani Y2 puta i X3 radova koji su citirani Y3 puta. Koliki je h-indeks autora?“\n\n**4. Koja od navedenih nije pokazatelj alternativne metrike?** Bili su ponuđeni: broj citata, broj čitatelja na Mendeleyu, broj preuzimanja i još jedan odgovor. Mislim da je točan odgovor broj citata.\n\n**5. Koji od navedenih nisu alati za upravljanjem referencama?** Bili su ponuđeni: Zotero, EndNote, Mendeley i još jedan odgovor koji nije alat, a to je bio točan odgovor.\n\n**6. Što od navedenog nije razlog za odbijanje, nego reviziju znanstvenog rada?** Neutemeljeni zaključci.\n\n**7. Koji je hijerarhijski posljednji korak kod objavljivanja znanstvenog rada?** Mislim da je točan odgovor recenzija, ali nisam siguran.\n\n**8. Što se ne nalazi u poglavlju Rezultati znanstvenog rada?** Rasprava o rezultatima prijašnjih istraživanja.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}