{
  "title": "Predmeti 1. godine preddiplomskog studija",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "predmeti-1-godine-preddiplomskog-studija",
  "tags": [
    "FER",
    "Općenito",
    "Informacije o predmetima"
  ],
  "posts": {
    "44399": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Ovdje možete podijeliti iskustva, preporuke i/ili pitati u vezi predmeta **1. godine preddiplomskog studija**.\n\nUkoliko želite podijeliti mišljenje(a) o predmetu, možete koristiti sljedeći predložak:\n\n```markdown\n## Ime predmeta\n\nnešto o predmetu\n\nTežina: **? / 10**\nKorisnost: **? / 10**\nBih li preporučio/la predmet: **Da / Ne**\n```\n\nšto će rezultirati:\n\n>## Ime predmeta\n\n>nešto o predmetu\n\n>Težina: **? / 10**\n\n>Korisnost: **? / 10**\n\n>Bih li preporučio/la predmet: **Da / Ne**\n\nNije imperativ da koristite ovakav predložak (ili bilo koji drugi), ali ovo izgleda sažeto i vjerujem da uz najmanji trud i najmanje tipkanja možete ponuditi lijepo formatirane informacije.",
      "votes": {
        "upvoters": [
          "Galke"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44541": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "# Zimski semestar (FER2)\n\nKako neki predmeti više ne postoje, napisat ću recenzije za predmete koji su ostali.\n\n## Digitalna logika\n\n>! Najteži predmet na 1. semestru po meni (možda je LINALG teška sad). Nije on suštinski toliko težak, a i ljudi iz strukovnih bi ga trebali prošišati, ali ima nekoliko ali. Prva stvar je da ovaj predmet zahtijeva kontinuiran rad. Dakle, ako zapnete negdje, you're fucked. Gradivo je čak dobro složeno. Ima par profesora koje želite izbjegavati (Glavinić, nekima i Blašković), ali nije ni Čupić za sve. Postoji stalno dilema oko laboratorijskih vježbi, koje uzeti. Prije su sklopovske bile pay to win, jer za razliku od simulacijskih nisu imali ulazni blic (na kojem ste mogli pasti vježbu). Ja sam osobno bio na simulacijskima, dok su još bile \"teže\", i drago mi je radi toga. Svaki student će, naravno patiti zbog poluproizvoda zvanog VHDLLab, ali u suštini nije VHDL toliko strašan, niti su labosi preteški. Meni bi, recimo, sklopovski labosi bili teški (olakšavalo bi ih samo to što ih se može prepisati pa i nije toliko strašno). Ali tabula rasa mislim da su simulacijski lakši.\n\n> Inače što se tiče korisnosti, a ono, neki bi možda rekli da je predmet beskoristan, ali jako puno stvari u smislu logike se radi i dalje, i to je nekako u pozadini svega. Zato možda ima relativno iznadprosječnu korisnost - nije koristan jer ćete uz to znanje raditi ne znam što, nego jer je stvarno temelj.\n\nTežina: **6 / 10**\n\nKorisnost: **7 / 10**\n\n----\n\n## Osnove elektrotehnike\n\n>! Po meni dosta dosadan i šablonski predmet. Opet, strukovnjaci će kroz njega prošišati. Ne brinite se što je pod zimski semestar, tako je bilo na FER2. Koliko sam skužio, predmet je uvelike neizmjenjen. Što se tiče predavača, bio sam kod Dadića i za početnike je on upravo profesor kod kojeg biste trebali ići. Ima vrlo lagani tempo, a opet nije glup. Ako ga pitate nešto vrlo vjerojatno će vam znati odgovoriti. Uz sav stres na prvoj godini, mislim da je Dadić upravo razlog zašto mi je bila toliko ugodna, jer je lako mogao biti kap koja prelijeva ćašu (da je npr. Knežević). Apropo Kneževića, nije on toliko loš profesor koliko ljudi govore, ali je intenzivan. Ako ste slabašni ili pomalo glupašni, možda je bolje da ga izbjegavate za vaše i njegovo dobro.\n\n> Što se tiče korisnosti, a ono, meni je dosta tih stvari kao računarcu beskorisno. Ali to je isto kao i kod digitalne logike temeljno znanje. Iz tog istog razloga mu dajem relativno visoku korisnost.\n\nTežina: **4 / 10**\n\nKorisnost: **6 / 10**\n\n----\n\n## Uvod u programiranje\n\n>! Mislim da je ovaj predmet na prvoj godini najveće razočaranje. C je zaista sjajan jezik, ali jako puno predavača ga predaje totalno pogrešno. Ima sjajnih predavača, kao npr. prof. Pinter, ali onda imate predavača koji će ubiti entuzijazam u ljudima, kao npr. prof. Vrdoljak. Ono što je bitno kod ovog predmeta je raditi kontinuirano. Ne čak ni puno, samo nemojte zaglibiti negdje. Gradivo je lagano. Možda malo kriptično ljudima koji su do sad radili u Pythonu, ali u suštini nije to ništa teško. Ono što hoću reći je da su vam na ovom predmetu najveći problem predavači i ispravljači. Jako malo predavača predaje da se ovo može nazvati dobrim predmetom. I onda dođe ispit i ispravljači vas oderu za tako nebitne stvari.\n\n> Npr., ja sam jednom dobio 1/8 bodova, nikad to neću zaboraviti, jer sam umjesto konstante vraćao varijablu (koja je uvijek imala vrijednost te konstante u tom slučaju). Predao sam elegantnije rješenje, koje je imalo jednu sintaktičku pogrešku - 4/8. Ali meni je nevjerojatno što sam uopće morao ići na uvide radi tako glupe stvari. Nije problem dobiti bodove gdje zaslužuješ, problem je što na uvide uz tebe dolaze ljudi koji žicaju i onda nadrkaju ispravljače. Automatski su ti ispravljači manje voljni dati bodove.\n\n> Isto tako, labosi su puno puta tako složeni da ih morate rješavati kak se radilo na predavanju. Npr., jednom prilikom mi je oduzeto 7/12 bodova iz labosa jer sam u zadatku u kojem sam u memoriji trebao transponirati matricu automatski učitavao transponiranu matricu. Dakle moje rješenje, koje je u smislu složenosti bilo najoptimalnije, je dobilo manje od pola bodova jer nisam napravio O(n), potencijalno O(n^2) operaciju, iako sam njime pokazao da razumijem kako je transponirati.\n\n> Što se tiče korisnosti, ovaj predmet je apsolutni must-know za bilo koga tko misli imati ikakvu karijeru pisajući kod. Postoje neke stvari koje bih volio da se više obrađuju, ali što se gradiva tiče - good enough.\n\nTežina: **5 / 10**\n\nKorisnost: **9 / 10**\n\n----\n\n## Vještine komuniciranja\n\n>! Ah yes, predmet filtar. Vjerujem da vam je već puno ljudi reklo da ovaj predmet nije zajebancija. Kažem vam i ja da nije. Kad sam bio brucoš, bio sam prva generacija s novim Paletovim programom. Bio sam dosta bahatiji nego sad, ali opet nisam bio bahat kao neki ljudi koji su ga uzeli zdravo za gotovo. Neki od tih ljudi su pali. Nakon rokova. Tako da, moguće je, i zapravo sasvim lagano pasti ovaj predmet. Pogotovo s tim glupim pragom od 60 bodova (umjesto klasičnih 50). Ali zapravo, ovaj predmet nije teško proći. Ono što trebate je samo raditi redovito i dolaziti na predavanja. Ako radite to, olakšali ste si učenje, stvarno nije teško naučiti ovaj predmet.\n\n> Ono što me jako boli, boli me srce, što ovaj predmet na tako loš način uči krucijalna znanja. Ne znam je li to zato što puno ljudi izgubi poštovanje za Paleta nakon njegove demonstracije postignuća na prvom predavanju. Ne znam je li to zato što ima toliko zadaća i projekata da ih ljudi naprave preko kurca. Ali kad ti dođe netko s 2. i 3. godine, tko ne zna napisati mejl, ne zna napisati CV, motivacijsko pismo, hell, ljudi na jebenom diplomskom ne znaju pričati s kolegama - e onda se ražalostiš. Sve ove stvari se obrađuju na predmetu. Ne nešto intenzivno, ali praksa postoji. I usprkos tome, autizam kod mnogih nadvlada. Tako da, iako ovaj predmet nije zajebancija, ali nije ni težak, mislim da je tužno što uz toliku Paletovu investiciju opet to znanje ne dopire do ljudi onoliko dobro koliko bi trebalo.\n\nTežina: **4 / 10**\n\nKorisnost: **8 / 10**\n\n\n----\n\n# Ekstra - Tjelesna i zdravstvena kultura\n\nIma 4 ovih predmeta, ali svi su otprilike isti, i sve ću ih odjednom tu pokriti (gdje su ljudi najmanje vjerojatno upućeni). \n\n>! Dakle, prva stvar - nemojte se zajebavat s ovim predmetom, može vam produljiti studiranje (iako dosta teško). Druga stvar, kad sam bio mlađi mislio sam da je pobjednička strategija ići u sekciju. Prošao sam sva 4 tjelesna badmintonom jer mi je to bilo zabavno. Neki ljude odu u šahovsku sekciju i to je praktički free prolaz. Čuo sam da se može učlaniti i u veslačku i onda je to 100 ili 200 kn za prolaz. Uvijek sam htio izbjegavati ture na Sljemenu i Maksimir, ali sad vidim da je to zapravo jako dobra prilika, i mislim da bi to preporučio nekom tko nije u strci s vremenom.\n\n>! Prvi razlog zašto mislim da je to dobro je iz razloga što se morate probuditi rano, čime ne gubite subotu, i onda idete na lijepu tjelovježbu. Koliko god netko mislio da što će mu tjelovježba na FER-u, korisno je. Ostarit ćete, sjebat će vam se leđa i atrofirat ćete. Ako se ne bavite sportom ili ne idete u teretanu, ovo vam je super stvar. Druga stvar, možete se upoznati i družiti s drugim ljudima. Sljeme i Maksimir sami po sebi nisu toliko atraktivni, ali kad imate ekipu s kojom se zajebavate po putu, brzo vam prođe vrijeme. Možda možete izvući i nešto više od samo ekipe, tko zna. Ali evo, da s ovim znanjem biram kako bih prošao tjelesni, išao bih u te šetnje jer bi mi dobro došlo. Da, potrošio bih puno više vremena, ali ne bi to bilo izgubljeno vrijeme.\n\nMetrike korisnosti i težine mislim da nisu potrebne, pa ih neću ni predložiti.",
      "votes": {
        "upvoters": [
          "Galke",
          "Hrvoje (Hrvoje45)",
          "ZvonkoSisoje",
          "klukas",
          "macaklin"
        ],
        "downvoters": [
          "Fica (Prof)",
          "jlo"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44553": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "# Ljetni semestar (FER2)\n\n## Fizika (1 i 2)\n\nOvdje ću napisati recenziju za obje fizike s obzirom da je to spojeno sad, ali isto je.\n\n>! Ovdje se prvi put susrećete sa ZPF-om, jednom od najopuštenijih zavoda na faksu. Da ne duljim, predavanja su sranje, ali mogu biti korisna. To je vrijedilo za obje fizike, vrijedi i dalje koliko vidim. Ono na čemu želite biti su **pokusi**. Pokusi nisu nešto korisni za prolaz predmeta, ali su kul i mogu vam olakšati shvaćanje nekih fenomena. Isto tako, vidjet ćete jednu jako underrated legendu ovog faksa, kolegu Ječmenicu. Ako imate kakvih pitanja u vezi pokusa, možete ga pitati i taj vrlo dragi čovjek će vam pomoći. Optimalna strategija bi onda bila da u vašoj ekipi ide netko na predavanja. Ta osoba može ići iz raznih razloga - sviđa mu se netko na predavanju, želi nešto naučiti, ili jebiga popušio je sik-sak-suk. Ta osoba će vam dojaviti kad su pokusi, a za to vrijeme vam se više isplati učiti fiziku negdje na faksu, rješavati zadatke. Ako već želite ili morate ići na predavanja, kolega Ilijić je jako dobar predavač i ići kod njega na predavanje se čak može i isplatiti.\n\n> Ono što daje težinu ovom predmetu su ispiti. Ispiti imaju pragove. Nedavno su uvedeni i negativni bodovi na teorijska pitanja. Ono što je imperativ je da ispunite uvjet točno riješenih zadataka na međuispiti. Inače vam je gotovo garantiran rok. Ta praktična pitanja, ona nisu teška. UVIJEK postoji 1 zicer i 1 super lagani zadatak. Ali ni ta ostala 2 zadatka nisu previše teška - ljudi koji prođu kroz Kulišića i Horvata će ih riješiti žmirećki.\n\n> Ono što na ovom predmetu treba raditi je kontinuirano učiti. Moguće je naučiti stvari za ispite kampanjski, ali to zahtjeva znatnu alokaciju vremena. 2. semestar je jedan od težih sada, tako da iako se to prije moglo dozvoliti, sad se baš i ne može.\n\n> Što se tiče korisnosti, well, korisno je znati te stvari. Hoće li vam pomoći u daljnjem obrazovanju - ne osobito. Ovo ne znači da je računarcu beskorisno - vjerovali ili ne, i računarci će koristiti neke stvari iz fizike (jer je fizika inspiracija za neke mehanizme). Ali naravno, ovo je više predmet opće inženjerske kulture.\n\nTežina: **5 / 10**\n\nKorisnost: **5 / 10**\n\n----\n\n## Menadžment u inženjestvu\n\n>! Mislim da je ovo najlakši predmet koji sam imao na preddiplomskom. Predavao mi je kolega Huljenić, i meni se on činio kao baš simpa lik. Jako puno puta je poistovjećivao neke stvari s Ericssonom, bio je čovjek iz industrije. Nisam previše naučio, ali barem sam se zabavio kad sam pisao projekte i crtao razne dijagrame. Znači to je predmet na kojem mi je stvarno zabavno bilo odraživati obaveze, iako je bio jako lagan i sjećam se jako malo stvari s njega.\n\n> Ono što je malo zeznuto je što ne znam baš kako bih ga naučio bez predavanja. Mislim da je veliku ulogu u uspjehu na predmetu imala činjenica što sam išao na predavanja redovito.\n\n> Što se tiče korisnosti, vjerujem da stvari na predmetu mogu biti korisne. Možda ne toliko za inženjere direktno, ali je dobro znati kako stvari funkcioniraju iz upravljačke perspektive. Automatski time možete znati što ponuditi klijentu ili šefu.\n\nTežina: **1 / 10**\n\nKorisnost: **5 / 10**\n\n----\n\n## Objektno orijentirano programiranje\n\n>! Ovo tu je vaš problem ovaj semestar. Bili aspirirajući računarac ili elektrotehničar, ova stvar će vas zgaziti (ako joj dopustite). Ono što morate shvatiti da je ovaj predmet ozbiljan, puno ozbiljniji od dosadašnjih. Možda bih se čak usudio reći da je ovo matematika programiranja. Ono što bih preporučio nekome tko sad kreće s 2. semestrom je da si da headstart, da prouči malo materiju prije jer ono što će se puno ljudi dogoditi je da prestanu u koraku pratiti predmet. To je nešto što se zbog labosa ne smije dogoditi, jer labosi su uvjet za izlazak na ispit. Ja sam imao veliku sreću što sam ljeto prije 2. godine, jer nama je OOP bio u 3. semestru, radio u C#-u. Nisam imao pojma o OOP-u, ali sam na svoju ruku nešto naučio. Predmet mi je radi toga bio osrednje težak, nisam sve znao, ali u odnosu na druge kolege neusporedivo lakši. Praktički sam mogao prespavati prvih 7 tjedana.\n\n> Kod odabira predavača, well, navodno se Čupić vratio iz protesta na predmet, kod njega ljudi navodno vole biti. Osobno sam bio kod Kušeka i on mi je bio okej predavač, ali ništa posebno. Čuo sam da jako puno ljudi ne voli Pripužića, a na zamjeni sam se uvjerio i zašto - lik je smrt. Ali generalno gledajući predavači na ovom predmetu su čist okej.\n\n> Labosi na ovom predmetu su prava opasnost. Potrudite se da prvih par riješite za sve bodove. Puno ljudi preskače zadnji labos (koji je nama bio grafičko sučelje, ne znam jel još uvijek tako). 4. labos zna biti dosta naporan, ali to je zato što su njihova rješenja napisana tako da krše sve konvencije, pa i Ženevsku, i to je nečitljivo. Ispiti **mogu** biti teški, ako ih je pisao Čupić obično i jesu. Rokovi su obično brutalni, tako da se potrudite da prođete kontinuirano.\n\n> Što se tiče korisnosti, ovaj predmet iako gradivom nije toliko koristan, sam koncept OOP-a je **neizostavan** u računarstvu. Ljudi su glupi, i onda retardirani koncept kao OOP im omogućava da usprkos gluposti brzo napišu nešto što radi. Sve u svemu, kod programiranja je danas prva pomisao \"napravi to u OOP-u\", i stoga mislim da je ovaj predmet jedan od korisnijih na faksu, ali samo zato što je struka trenutno (nepravedno) takva.\n\nTežina: **7 / 10**\n\nKorisnost: **8 / 10**",
      "votes": {
        "upvoters": [
          "Galke",
          "Hrvoje (Hrvoje45)",
          "McKovalski",
          "TheNubKiller (Lumpy)",
          "ZvonkoSisoje",
          "indythedog",
          "klukas",
          "macaklin",
          "turunturu (Cement)"
        ],
        "downvoters": [
          "jlo"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "47305": {
      "poster": "klukas",
      "content": "Kao trenutni brucoš koji upravo završava prvu godinu, ovdje ću ponuditi svoje mišljenje u vezi nekih kolegija. Neka divlja sreća je odlučila da su upravo kolegiji koje kolega prije mene nije pokrio oni kolegiji o kojima imam najsnažnije mišljenje i o kojima mogu najviše pisati. \n\n## Matematička analiza 1\n\nMeni je ovaj kolegij bio prvi veliki šok FERa. Drugi veliki šok mi je bila Linearna algebra, ali taj dio ću pokriti u nastavku. Kod mene u srednjoj školi, a pretpostavljam jednako tako i kod većine drugih, matematika se obrađivala na skroz drukčiji način nego na fakultetu. Shodno tome, kad sam došao na faks, imao sam skroz krive predodžbe o tome kako matematiku zapravo učiti. Tek sam na faksu naučio da prava ljepota matematike leži u apodiktičnoj izvjesnosti koja se krije iza postupaka rješavanja zadataka, odnosno da u prvom planu leži \"zašto\", a tek u drugom \"kako\".\n\nS obzirom da ovaj kolegij pokriva najosnovnije pojmove matematičke analize, bilo ga je posvuda i skroz je bilo raštrkano, i vjerujem da je to dodatan razlog zašto me ovaj kolegij (nepotrebno) preplašio. Ako se ne varam, unutar 3 tjedna se rade relacije, kombinatorika i nizovi, tri stvari koje nemaju veze jedna s drugom. Ukoliko ova zadnja informacija nije 100% točna, u najmanju je ruku prikladna hiperbola gradiva i njegovog rasporeda. Na kraju semestra, kad se obrađuju derivacije i integrali, gradivo se stabilizira i postane lakše i ugodnije pratiti ga.\n\nOno što također mogu reći jest da je moguće u mnogim se stvarima izvući na razinu predznanja, ukoliko ste vješti u računanju. Teoriju nećete moći bez učenja savladati, ali same zadatke nije nemoguće. Ja sam bio dosta ispraksiran zbog srednje, pa sam izvukao sasvim okej rezultat uz jako malo vježbanja. I sada žalim što se ovome nisam bolje posvetio kad sam mogao, jer kolegij stvarno nije toliko težak, samo je šokantan i obeshrabrujuć na prvu.\n\nNajveći savjet koji mogu ponuditi budućim brucošima koji ovo čitaju je da učite teoriju s razumijevanjem. Rješavati zadatke bez poznavanja teorije je u najboljem slučaju krpanje na jedva, bez da ikad znate što zapravo radite. Rješavati zadatke uz poznavanje teorije je u najgorem slučaju povezivanje stvari koje znate i razumijete i primjena tog znanja. Uz usvajanje nekih standardnih metoda i \"šablona\", bilo samo pručavanjem kako se zadaci rješavaju, a još bolje samostalnim radom, ovo je moguće jako lijepo položiti. Također, pristup koji sam ja imao za učenje teorije je taj da kontinuirano mogu pratiti što se događa i zašto i da razumijem što radimo, ali nisam učio same dokaze tijekom semestra, već sam učenje dokaza ostavljao za kraj, jer je to znanje koje lako i brzo ispari. Dakle, dok god možete pratiti gradivo i shvaćate što se događa, nemate pojma u kolikom ste plusu, jer je nevjerovatno lako izgubiti se.\n\nJa sam kontroverznog mišljenja da su matematički kolegiji (iz mog iskustva dosad, nisam još slušao ViS pa ne znam za to i pls me nemojte kamenovati) najlakši kolegiji na FERu, barem ovi na prvoj godini, i da samo treba redovito raditi za njih, i to je iz više razloga. Prvi je taj da je oko 40% ispita teorija koju se lako nauči ako se alocira dovoljno vremena na nju. Drugi je taj da su zadaci relativno šablonski, i rijetko sam, ako ikada, susretao na testovima nešto neviđeno i wow, većinom su to poznati tipovi zadataka, i ako prođete kroz zadatke u skripti na konju ste. Treći je razlog taj da je literatura jako jako dobra. Skripte iz analize su vrhunske, u njima su detaljno raspisani teoremi, dokazi istih, načini rješavanja zadataka i slično. Vizualno su isto privlačne; definicije, teoremi i korolari su vizualno odvojeni tako da je moguće uočiti ih na prvu. Četvrti je razlog ujedno i najsubjektivniji. Smatram da su profesori matematičkih kolegija jako kvalitetni, i imam neizmjerno poštovanje prema ZPMu, no o tome ću više pisati pod analizom 2. Samo ću reći da su svi profesori s kojima sam dosad interagirao iznimno susretljivi i ljubazni i spremni pomoći u bilo čemu, i nisam imao niti jednu negativnu interakciju s bilo kojom osobom s tog zavoda.\n\nAnalizu 1 sam slušao kod prof. Žgaljić Keko. Ona je dosta tiha i nije baš uspješno obuzdavala buku u predavaoni, niti se osobito trudila, djelovala je kao da joj ne smeta buka, niti je se tiče. Unatoč tome, imam krajnje poštovanje prema njoj. Jako je draga žena i iznimno je susretljiva i ide dovoljno sporo da ju se može pratiti bez većih muka. Osobno je više nisam pratio nego što jesam iz svih opisanih razloga - stran pristup učenju matematike, raštrkano gradivo i činjenica da sama profesorica nije bila osobito dinamična, a ja vjerojatno imam neki nedijagnosticirani ADHD i redovito mi je pucala koncentracija. Mislim da će ona odgovarati ljudima kojima odgovara malo statičniji, sporiji pristup bez puno showa i drame, i ja sam inače jedan od tih ljudi, no iz svih drugih razloga sam se gubio u gradivu. Također je jako uzbuđeno zvučala dok je pričala npr. o Numeričkoj matematici, i čini mi se da je to više njen đir pa se nadam da ću je imati prilike gledati u tom svjetlu kad vjerojatno upišem numeričku ukoliko ona to bude držala, no to su sad spekulacije i nade pa neću ulaziti u to.\n\nTežina: **7 / 10**\n\nKorisnost: **8 / 10**\n\n\n\n## Linearna algebra\n\nSada sljedi kontroverzno i nepopularno mišljenje, no i dalje jedno koje imam snažnu želju iznijeti. Meni je ovo najljepši kolegij prve godine. U prethodnoj je rečenici snažan naglasak na riječi \"najljepši\". Ne najkorisniji (to je vjerojatno OOP). Definitivno ne najlakši. Ali najljepši, meni osobno, sigurno jest.\n\nSam kolegij je podijeljen u dva dijela. U prvom se dijelu uči računanje s matricama i determinantama, i potom rješavanje sustava linearnih jednadžbi preko matrica. Na kraju ovog dijela se uči računanje s vektorima. Ovdje je naglasak više na računskom snalaženju, mada ima tu teorije. Moj je savjet iz međuispita izvući što je više bodova moguće, jer je gradivo na završnom neusporedivo teže. Ja sam bio dovoljno glup da međuispit failam, i onda sam se baš morao natezati na završnom da bih navukao na ocjenu kojom bih bio zadovoljan.\n\nDrugi ciklus linearne algebre je meni bio drugi veliki šok FERa. Sjećam se predavanja kad smo radili vektorske prostore. Profesorica govori da je to gradivo čista apstrakcija i da je jako teško pohvatati, i da samo trebamo biti uporni. Ja već nestrpljivo čekam da krenemo jer sam od prijatelja s PMFa slušao malo o vektorskim prostorima i zanimalo me. I onda je profesorica krenula. Aufff. Na ploču je ispisala 8 kriterija koje vektorski prostor zadovoljava. Zatim je dokazivala neke stvari preko tih kriterija. Ja u šoku sjedim i gledam i pokušavam prepisivati mada ne znam što se događa. Kolege oko mene su jednako izgubljeni. Kako idu tjedni, gradivo divlja. Linearni operatori su me dotukli, mada sam tu već bio skroz izgubljen i nisam znao što se događa. Zatim dođu svojstvene vrijednosti i skalarni umnožak, pojmovi koji su također nevjerovatno apstraktni, ali u ovom trenutku već očekujem neočekivano i ne iznenađuje me. Bliži se završni ispit. I tu mi je nekako sve kliknulo.\n\nMoj pristup učenju ovog je bio kriv. Ja sam htio shvatiti zašto je vektorski prostor definiran tako kako jest, i dok sam se ja još patio s tim, mi smo išli dalje s gradivom. Pred kraj sam shvatio kako se ovo treba učiti. Uopće nije bitno zašto je vektorski prostor definiran tako kako jest. Bitno je uzeti te kriterije zdravo za gotovo, a priori, i potom raditi s njima i iz njih vući zaključke. Kad sam odustao od pokušaja shvaćanja nečeg toliko apstraktnog i bacio se na prihvaćanje toga, latentno sam to shvatio i to je bio jedan od ljepših trenutaka studija (zasad). I to je moj glavni savjet za drugi ciklus: nemojte se patiti s teorijom kako sam se ja patio, prihvatite je apriorno, radite s njom tako da ste je uzeli zdravo za gotovo, i jednom ćete shvatiti da je shvaćate. Zvuči paradoksalno, ali istina je.\n\nSada razlog zašto mi je ovo najljepši kolegij prve godine. Kad sam jednom dobio intrinzični osjećaj za to kako cijeli taj sustav funkcionira, meni se promijenio život, i ja se ne šalim kad ovo kažem. Dobio sam dubinsko razumijevanje toga kako funkcioniraju linearni sustavi, što su zavisne i nezavisne varijable i sl. To mi je znanje latentno služilo na analizi 2, ali i šire. Recimo, kad sam na Osnovama elektrotehnike rješavao Kirchoffove jednadžbe, ja sam imao savršen osjećaj za to koliko mi jednadžbi treba u odnosu na to koliko varijabli imam, što se dogodi ako imam premalo ili previše jednadžbi i sl. I svugdje gdje sada koristim sustave linearnih jednadžbi, ja osjećam euforiju zbog tih spoznaja. Možda ja gubim razum. Ali meni su ove stvari predivne.\n\nDrugi razlog zašto mi je ovo toliko lijepo je taj da sam na ovom kolegiju naučio koliko tijesno mogu biti povezani teorija i zadaci. Na analizi 1 i 2 je tehnički moguće rješavati zadatke bez razumijevanja teorije, udri na šablonu i dobar si. Ovdje nije. Ovdje je nemoguće odrediti što je uopće teorija, a što zadatak, jer je to sve isprepleteno u gustu mrežu, i usuđujem se reći da su svi zadaci teoretski. \n\nZadaće su ovdje jako opširne, ali su ujedno jako dobra priprema za ispite.\n\nDa ponovim misao dana - meni je linearna algebra uljepšala život onda kad sam joj otvorio svoje srce.\n\nPredavanja sam slušao kod profesorice Nakić. Prema njoj gajim poštovanje kakvo ne gajim prema niti jednom drugom profesoru koji mi je predavao. Njena predavanja su bila predivna i istinski sam im se veselio. Teoriju je tumačila s meni dotad neviđenom količinom entuzijazma, i istinski se trudila da ne otpišemo matematiku \"jer to inženjerima ne treba\". Redovito nas je podsjećala zašto nam to treba, i držala snažne motivacijske govore kako mi možemo uspjeti, kako se trebamo truditi, kako je okej pasti koji ispit i sl. Kao jadnom malom zbunjenom brucošu koji je došao iz malenog grada u Zagreb i bio je skroz izgubljen i usamljen, meni su te riječi jako puno značile i ohrabrivale me. Toplo preporučam njena predavanja.\n\nTežina: **7 / 10**\n\nKorisnost: **9 / 10**\n\n\n\n## Matematička analiza 2\n\nS obzirom da sam predmete drugog semestra slušao online, iskustvo će mi vjerojatno biti (iskreno se nadam) drukčije nego budućim generacijama. Ovo je bio daleko najorganiziraniji predmet za vrijeme online nastave. Od prvog je dana bilo jasno da se održavaju online predavanja, i to je ostalo kontinuirano do kraja semestra. Samim time, najviše sam vremena posvetio ovom predmetu, jer sam najviše pozornosti i truda dobivao na njemu. \n\nOčekivao sam analizu 1 na steoridima, i dobio sam to, ali u najboljem mogućem svjetlu. Gradivo je puno bolje raspoređeno nego na analizi 1, postoje 2 distinktne cjeline, i predmet je stvoren da se polaže po principu MI + ZI. Sve savjete koje sam udijelio za analizu 1 naučio sam samostalno primjenjivati na analizi 2, i bila je istinski ugodna za praćenje. Skripte su jako dobre, zadaci iz njih su jako dobri, izvodi su u njima jako dobri.\n\nŠto se tiče profesora, iskušao sam ih sve pomalo, jer su se mijenjali u snimanju online predavanja. Popularno je mišljenje da su prof. Burić i prof. Horvat Dmitrović najbolji, i ja to ne mogu poreći. Njihova su predavanja bila dinamična i jako laka za pratiti. Ja bih ovdje još istaknuo prof. Puljiza, jer sam ja u njegovim predavanja možda najviše uživao na ovom kolegiju. On ide osjetno sporije od svih drugih, ali mi ga je zbog toga bilo i najlakše pratiti, i poslije njegovih (daleko najduljih) predavanja sam ja morao najmanje samostalno raditi. Ukratko, nećete pogriješiti s profesorima Burić, Horvat Dmitrović i Puljiz, ali niti s bilo kojim drugim, jer su meni stvarno svi odgovarali. Kvaliteta online predavanja iz analize 2 je vrhunska, i nadam se da to neće micati narednih godina, jer je meni to koristilo i u učenju za završni.\n\nOvo je objektivno zahtjevniji kolegij od analize 1, ali je meni subjektivno bio lakši, jer sam od prvog dana znao kako ga moram učiti.\n\nTežina: **6 / 10**\n\nKorisnost: **8 / 10**\n\n\n\n## Pretraživanje informacija i tehničko izražavanje\n\nJedan od 3 izborna predmeta u drugom semestru. Drže ga prethodni dekan i trenutni dekan, odnosno prof. Grgić i prof. Gledec. Profesor Grgić drži dio s pretraživanjem informacija, što je samo obrađivanje raznih znanstvenih baza podataka. Profesor Gledec držio dio sa tehničkim izražavanjem, što je kvalitetno pisanje radova i gramatičko ispravno izražavanje. Profesor Grgić je rekao da je ovaj kolegij prirodni nastavak na Vještine komuniciranja, i s tim se mogu složiti.  Kad sam birao izborni kolegij, pitao sam se hoće li mi najviše koristiti znanje pisanja radova, dizajna ili menadžmenta, i osobno sam se odlučio za ovo prvo. Stoga očekujem da će mi ova znanja na suptilan način koristiti kasnije, kad budem pisao razne radove i seminare. Ovo je jedan dosta benigan predmet, inače se cijeli riješi u jednom ciklusu.\n\nTežina: **3 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporučio predmet: **Da**",
      "votes": {
        "upvoters": [
          "1vq",
          "BrownPerson (Bambi)",
          "Dome",
          "Filemon",
          "Goliathus",
          "InCogNiTo124",
          "MiqeloS",
          "Tinki-Winky (Tinky Winky)",
          "[deleted]",
          "amnael",
          "gasho115 (Eros Bosanđeros)",
          "iNavy (mornar Ica)",
          "indythedog",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "tamnodrvo96"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "HARAmara (decko_sa_balkana)",
          "LUJXIV",
          "McKovalski",
          "PikachuOnAcid (Kaneki kun)",
          "djeno",
          "in1"
        ],
        "wtf": [],
        "tuga": [
          "Fica (Prof)"
        ]
      }
    },
    "48125": {
      "poster": "freshwaffle",
      "content": "@klukas#47305 Dodatak na linearnu: \n\nvrlo suprotan efekt postiže prof. Žubrinić. Iako entuzijastičan i vidno zainteresiran za gradivo, nekako ga nije uspio prenijeti, meni je sve ostalo nekako mutno i jos uvijek preapstraktno. Znao je pričati nekakve anegdotice i bacati neke fore i stvarno nije bilo loše na predavanjima, ali ne znam, nisam kliknula s njim i žao mi je što nisam prešla kod prof Nakić.\n\nOvo može biti subjektivo jer je prijateljica s PMF-a godinu prije imala problema sa svojom linearnom, pa sam odlučila ostaviti predmet za rok već pri kraju prvog ciklusa. Rekla bih da je cilj na svim kolegijima stvarno Pratiti, ne samo dolaziti na predavanja, i kad nešto ne razumijete obavezno što prije pokušajte shvatiti, pitajte, otiđite na konzultacije. \n\nDodatak na Matan, oba semestra:\n\nuživo sam slušala prof.  Horvat Dmitrović, prof. Puljiza i prof. Pašića. Lana općenito je super predavačica ali mi je njen tempo bio mrvicu brz. Puljiz je možda dobar online, ali uživo zrači nekakvu zbunjenost. Također, često ne bi završio zadatke do kraja jer nije bilo vremena (jer je spor), pa \"riješite vi to za zadaću\". Najbolji od ovo troje mi je bio Mervan, ima dobru vibru, malo je sporiji od Lane ali mi je ljepše objašnjavao. Da se razumijemo, nije spor, brzo prolazi kroz gradivo. Samo mi je njegovo objašnjavanje ljepše sjelo. Mogući razlog zašto je u side notesu niže, ali mi je iskreno zanimljiv kao predavač. O prof. Buriću sam čula sve najbolje, ali nisam bila ni na jednom njegovom predavanju. Dobra stvar koju je izrodila cijela ova situacija su njegova i Mervanova video predavanja. Ako ostanu online obavezno pogledajte pi-ponavljanje pred završni ispit. Postoji i verzija za FSB koja je vrlo primjenjiva za ferovce. \n\nJoš nekakvi side notes: \n - U prvom semestru to nisam prakticirala, dio drugog jesam i jako mi je olakšalo shvaćanje Matan(a vrlo vjerojatno bi mi rasvijetlilo i linearnu) - prođite skriptu prije predavanja. Ako se samo upoznate s gradivom, bit će vam ga na predavanju lakše shvatiti i možete lako smisliti pitanja koja želite postaviti bez da se mislite jesu li glupa, imaju li smisla, hoće li to biti obrađeno kasnije... \n - Kao osobi iz jezične gimnazije koja se nije previše susretala s programiranjem (shocker), UPRO i OOP nisu predstavljali prevelik problem. Na početku budete malo zbunjeni dok pohvatate sve konce, a onda je smooth gliding ako učite redovito. Na to će vas tjerati labosi. Najučinkovitiji, zapravo jedini način za učiti je da sami prođete primjere iz prezentacija i stvarno ih pokušate shvatiti. Onda auditorne i stare ispite. Sve što budete rješavali pokušajte prvo sami, ako zapne nakon 10-15 min razmišljanja i razmatranja opcija pogledajte rješenja. Tijekom ovih video auditornih iz oop smo se znali iznenaditi nekim novinama koje su odlučili prvi put pokazati na auditornim vježbama.\n - Čitala sam na starom forumu da je fizika bubačina i zato nisam učila ništa od 3. mjeseca do ZI. U 7 dana sam naučila za 2(nisu još izašli rezultati, brojala sam bodove), dakle stvarno se da, ali molim vas izbjegavajte si to raditi. Malo sam prelistala neke skripte koje je sastavila prof. Plesić i prošla kroz zadatke s auditornih i iz zbirke zadataka preuzetih iz prošlog programa koja je na intranetu. Pokušala sam Kulišića, bilo mi je previše, ali ako radite na vrijeme i želite bolju ocjenu, ako prođete to, ne biste trebali imati problema s ispitom. Teoriju sam počela čitati noć prije ispita i slučajno pročitala teorem koji je bio na ispitu. Stvarno si nemojte uzeti 7 dana, ovo mi je uspjelo na neku ludu sreću.\n - Ako opet bude nekakva situacija učenja na daljinu ili samo ne želite dolaziti na predavanja što ne preporučam prvi semestar, napravite si neku rutinu i slijepo je slijedite. Teško je natjerati se raditi, a svaki dan dolazi nova hrpa gradiva koje bi trebalo shvatiti.\n -  Ne mogu dovoljno naglasiti koliko je bitno kontinuirano učiti.",
      "votes": {
        "upvoters": [
          "1vq",
          "Amon",
          "Bananaking",
          "BrownPerson (Bambi)",
          "InCogNiTo124",
          "McKovalski",
          "MiqeloS",
          "NailAndGear",
          "amnael",
          "djeno",
          "iNavy (mornar Ica)",
          "idontwannabemyself",
          "in1",
          "indythedog",
          "klukas",
          "macaklin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "macaklin"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "51596": {
      "poster": "Janus",
      "content": "Pozz ljudi, znam da je meni tokom prve godine pomogao onaj vodič za brucoše (ako ga netko još uvijek ima, bio bih zahvalan ukoliko bi mi ga poslao). Da ne duljim...ukratko ću napisati vlastita mišljenja za svaki predmet prve godine.\n\nInače, upisao sam fer tek toliko, nisam imao iskustva u programiranju, dvoumio sam se između fera i pmf-fizike i sad mi je drago da sam ovdje na feru. Sve sam ispite prošao kontinuirano, no treba zagrijati stolicu!\n\n## PRVI SEMESTAR\n\n## Vještine Komuniciranja\nNišta nije teško, jedini problem je 'bombardiranje' sa zadaćama na moodleu koja počinju odmah na početku studija (Samo treba otvarati moodle bar 3 puta tjedno i sve će biti okej). ZI i MI su free, ne mora se učiti, dovoljno je samo biti na predavanjima. Projekt nosi većinu bodova i on određuje ocijenu. Samo polako, sve se stigne u manje od tjedan dana, treba ispoštivati sve upute.\n\nTežina: **1 / 10**\n\nKorisnost: **7 / 10**\n\nBih li preporučio/la predmet: **Da** (Sve će vam objasniti prof Pale ;))\n\n## Matematička Analiza 1.\n\nGradivo se uglavnom nadovezuje na srednjoškolsko. Ako ste išli u mioc ili neku matematičku gim. večinu ovoga će vam biti poznato. Ja nisam. Bio sam na svakom predavanju, tokom tjedna uzeo bi si bar 7-8 sati tjedno za ovaj predmet i riješio par primjera. Konzultacije su JAKO korisna stvar ovdje, ne sramite se ići na njih. Za Mi i Zi (ili rok, ne znam jer nisam bio) morate sjesti i raditi. Preporučam skripte sa ferweba koje su odlične. Oko profesora ne treba stvarati preveliku strku, ukoliko vam ne paše, promijenite ga! Dokazi; ah...snađi se nekako. Najvažnije je savladati limese, integrale i derivacije koje će vam trebati za idući semestar, a i kasnije.\n\nTežina: **7/ 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n\n## Linearna Algebra\n\nMoj prvi pakao, iako volim matematiku ovaj dio je stvarno abstraktan. Počinje lagano vektori,matrice itd.. Za Mi probajte sakupiti što više bodova, jer sad kad gledam Mi je stvarno laganica. I onda kreće linearna...neke stvari sam morao čitati po 4 puta da bih uopće shvatio što se želi reći. Skripte su uredne i da se učiti iz njih, ali ako ne shvaćate neke koncepte, ili ako niste radili redovito pa vam se nakupilo...ajoj. Konzultacije su ovdje također jako korisne (preporučio bih konzultacije kod asistenta Kilasse, stvarno dobar čovjek i odlično objašnjava. Više sam naučio na njegovim konzultacijama, nego kroz tih par tjedana predavanja u 2 ciklusu). Priprema za ispite; skripte i zbirke zadataka. Sjećam se kako su kolege uvijek dramile oko matan 1, a linearnu shvaćali kao zezanciju, no meni je bilo baš obratno. Puno više vremena sam morao uložiti u linearnu.\n\nTežina: **9 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n\n## Digitalna Logika\n\nPredmet je šablonski. Naučit će te rješavati zadatke, te će se takvi ili slični pojaviti na ispitu. I to je to! Ovdje teorije i ne znači baš puno ukoliko želite samo proći predmet. Da razbijem onu zavjeru \"Ne može se proći digitalna ako nisi kod Čupića\", najveća glupost koju sam ikad čuo. Jedina prednost Čupića je da se on na svojim predavanjima isključivo posvećuje rješavanju zadataka (riješit će te ih više nego kod ostalih profesora). No to se sve da doma, samostalno.\n\nLiteratura; prezentacije su dosta loše, no korisne su za pojasniti nešto. Čupićevu knjigu sam isprintao (800 strana) i otvorio 3 puta, tako da... Najkorisnija stvar je ona stranica za diglog gdje imate online zadatke i naravno minilessons.\n\nTežina: **5 / 10**\n\nKorisnost: **7 / 10**  \n\nBih li preporučio/la predmet: **Da**\n\n## Uvod u Programiranje\n\nPo meni, najorganiziraniji predmet na prvoj godini! Prezentacije su super i koncept labosa je idealan i doslovno možete učiti samo za labose i položit ćete predmet bez problema. Kao što sam naveo, ovo je moj prvi susret s programiranjem. Tempo mi je bio savršen, na početku sam imao problema s edgarom (edgar je program koji \"ocjenjuje vaš kod\", na jako lošem glasu). Treba raditi redovito jer se gradio nadovezuje. Ispiti na papiru su mala glupost, no da se. Oduzimat će vam i davat bodove na svakakve gluposti, no zato postoje uvidi. Bitno je proći prag na labosima (ja sam ga prošao tek na predzadnjem labosu, ali sam ta zadnja dva labosa imao sve točno). Rokovi su navodno teži od kontinuiranog.\n\nTežina: **6 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## TZK\n\nNema se tu što reći. Ako vam se ne da dolaziti, upišite neku sekciju (ja sam bio u košarkaškoj, i došao sam svega 2 puta na trening). Postoje subotnje ture po slijemenu, to je navodno dosta chill za odmorit um i dušu od učenja.\n\n## DRUGI SEMESTAR\n-treba uzeti u obzir da je ovaj semestar bio online, zbog virusića.\n\n## Matematička Analiza 2\n\nPuno jednostavniji predmet od matan 1. Manje dokaza i izvoda, lakše gradivo. Profesori su odlični, skripte sa ferweba također. Gradivo se uglavnom nadovezuje na linearnu i matan 1. U 2 ciklusu najzahtjevniji su redovi (koje nisam baš učio). Također treba raditi donekle redovito i stisnuti stolicu pred ispite.\n\nTežina: **6 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Fizika\n\nUh...dosta nepregledan predmet. Svaki prof ima svoje prezentacije, literatura je loša. (npr. za optiku iz 2 ciklusa uopće nije postojala literatura). Predavanja su useless, ali zabavno je dok rade svoje pokusiće. Učenje; ja sam planirao ostaviti ovaj predmet za rok, jer je bio covid i trebali smo pisati 5 roka odjednom. Dan prije ispita sam prošao neke zadatke i nešto malo teorije i eto izgurao za prolaz. Zadaci su lvl mature, no dosta je ljudi palo jer nisu zadovoljili uvjet da im zadatak bude 100% točan (inače na roku moraju biti 2 zadatka ). Dakle, predmet je na sreću osim ako ne posudite Horvat 1 i Horvat 2 i primite se posla. Magnetizam je dosta teško gradivo, pogotovo jer očekuje znanje matana2 (parcijalne derivacije, trostruki ili dvostruki integrali, dif jednadbe), a vi to taman slušate paralelno.\n\nTežina: **6 / 10** \n\nKorisnost: **6/ 10**\n\nBih li preporučio/la predmet: **Da**\n\n\n## Objektno Orijentirano Programiranje\n\nJava i OOP, bar meni puno lakši koncept nego funkcijsko programiranje. Predavanja su jako zanimljiva i općenito OOP je jako zanimljiv. Labosi su slični kao i na UPRO, no ovdje morate proći blic (koji nema negativnih) jer inače ne možete pisati programske zadatke. Labosi nose veći dio ocjene. Literatura; prezentacije i Čupićeva knjiga za javu (korisna ukoliko želite naučiti puno više od ovoga što se radi na ovom predmetu). Profesori su ok, ne znam iskreno što je s njima i zašto su mrzovoljni. Ne prepisujte labose, jer se to sazna! I stisnite pred ispit. Good Luck.\n\nTežina: **7 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n\n## Osnove Elektrotehnike\n\nSličan predmet kao diglog, po konceptu! Imate zadatke koje učite rješavati i takvi dođu na ispitu. Profesori i asistenti su odlični i uvijek će objasniti ili pojasniti što treba. Korisna stvar, FELJE! Iz felja vade zadatke za ispit i takvi zadaci su po skriptama i prezentacijama. Teorije nema puno. Zadaci nisu teški, ali ima ih dosta. Treba znati raditi sa kompleksnim brojevima i treba znati služiti se kalkulatorom. Ispiti su na zaokruživanje s negativnim bodovima, ne podcjenjujte negativne bodove! Sve u svemu super predmet.\n\nTežina: **5 / 10**\n\nKorisnost: **8 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Izborni; Menadžment u Inženjerstvu\n\nRandom predmet, gradivo govori o menadžerima, poslovanju, tvrtkama, rizicima itd.\n\nMeni je bio dosadan. Učio sam 4h prije ispita i dobio 4. Jedina stvar ovdje je projekt.\n\n\nTežina: **2 / 10**\n\nKorisnost: **3 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "1vq",
          "InCogNiTo124",
          "SuperSjajan3",
          "indythedog",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51730": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Janus#51596 ako ga netko još uvijek ima, bio bih zahvalan ukoliko bi mi ga poslao\n> \nNa materijalima je, u korijenskom FER repozitoriju.",
      "votes": {
        "upvoters": [
          "Janus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "55594": {
      "poster": "aux",
      "content": "Sad sam završio prvu godinu, pa evo fresh review svih predmeta. \n\nBtw ako netko zna kako stavit da se može sakriti tekst kao što je netko gore napravio, pošaljite mi PM. Puno je ovo teksta, malo neuredno hahahaha.\n\n### PRVI SEMESTAR\n\nPrvi semestar sam prošao sve sa 5, osim Vjekoma kojeg sam s 4. Jbg, zajeban predmet.\n\nNajvažnije je krenit odmah učiti kontinuirano i s razumijevanjem. \n\n## Matematička analiza 1\n\n**Gradivo:**  Rade se većinom iste stvari kao i u srednjoj, samo na malo višem levelu. Ako ste iz malo bolje srednje, sve (osim kombinatorike) bi vam trebalo biti poznato i ne bi trebalo biti problema. \n\n**Kako učiti:** Skripte su savršene. Svaki tjedan jedan skripta. Prolazite polako i kontinuirano, dokaze pokušate shvatiti, na kraju skripte riješite zadatke. Prije ispita riješite par prijašnjih ispita, i manje-više naučite napamet dokaze koji se najčešće pojavljuju. Predavanja su dobra, ja sam imao prof. Marangunića, jako simpatičan, reći će vam točno što sve trebate znati za ispit. No predavanja vrlo usko prate skriptu samo, a meni se nije bas dalo ustajat ujutro, pa sam samo došao na obaveznih pola predavanja i dalje radio sam po skripti. Ako vam je teško shvatit samo iz skripte nešto, nije loše otići na predavanja.\n\n**Težina:** 6/10\n\n**Korisnost:** 9/10\n\n\n## Linearna algebra\n\n**Gradivo:** Linearna krene lagano, malo operacije s matricama, pa vektori, okej, ima sve smisla. I onda odjednom krene nešto vrlo apstraktno i seemingly beskorisno i pogubite se u gradivu. No jednom kada sve klikne i kada shvatite što se zapravo događa, predmet postane vrlo lagan, pogotovo jer su ispiti šablonski. Učite s razumijevanjem - bitno je znati linearnu kasnije.\n\n**Kako učiti:** Skripte su odlične za naučiti za ispit, no malo su suhoparne i možda vam neće biti jasno zašto se to sve radi. Stoga bih definitivno preporučio da na početku semestra, i ako je potrebno opet kasnije, pogledate [3Blue1Brown's Essence of Linear Algebra](https://youtu.be/fNk_zzaMoSs), i bit će jasno šta se događa. Predavanja su bila okej, ali eto ja preferiram ucit sam po skripti pa sam opet samo odradio tih 50% i gotovo, ne znam koliko su korisna. Znači isto kao i Matan1 - skripte i prije ispita ispiti. \n\n**Težina:** 7/10\n\n**Korisnost:** 8/10\n\n\n## Uvod u programiranje\n\n**Gradivo:** Učite programirati u C-u na vrlo basic razini. Ako već znate imalo programirat u bilo kojem drugom jeziku, predmet bi trebao biti vrlo lagan - samo učenje nešto malo sintakse C-a. Ako nista imali doticaja do sad s programiranjem... eh, za to ne mogu puno reći, bude puno teže koliko sam vidio. Svaki tjedan imate labose koji vas tjeraju da kontinuirano učite. Za labose dođede na faks, sjednete za PC, prvo imate \"blic\" od 5 pitanja na zaokruzivanja koji zahtijevaju bas ono teoretsko razumijevanje kako C radi, i onda imate 3 sata za 3 programska zadatka. Vremena je više nego dovoljno ako znate što radite.\n\n**Kako učiti:** Svakako morate učiti za labose (prezentacije su jako dobre + rješavanje zadataka), nose pola ocjene i morate imati barem 50%. Na kraju poslije labosa imate vec hrpu bodova i dosta znanja, pa vam ne bi trebalo trebati puno vremena za pripremit ispit, možete se tad fokusirat na ostale stvari. Mali downside je što se ispit piše na papiru, no programčići koji zadaju na ispiti budu stvarno jednostavni i da se pisat na papiru. Preporučio bih da ne koristite nikakav poseban IDE da se ne navikavate. Notepad++ i cmd su dovoljni za UPRO, i onda pred ispit probate riješiti koji ispit na papiru kod kuće čisto da vidite kako je. Ako znate već programirat, predavanja će vam biti beskorisna.\n\n**Težina:** 4/10\n\n**Korisnost:** 8/10\n\n\n## Digitalna logika\n\n**Gradivo:** Diglog je vjerojatno najteži predmet jer se nema baš odakle učiti. Ako znate baratati s binarnim brojevima, trebalo bi bit lagano krenit s diglogom, i gradivo se samo slaže jedno na drugo. Labosi su malo čudni jer nemaju baš previše veze s gradivom, no puno su opušteniji od UPROa. Kupite tu FPGA plocicu koju onda na labosima programirate da radi neke stvarčice. Većinom svi dobiju sve bodove na tom, jer, kako prof. Zec kaže, svrha labosa je da naučite nešto i da igrate, a ne da se provjerava vaše znanje. Nažalost, asistentni i nemaju baš isti mentalitet pa znaju skidat bodove, no uvijek imate demose koji će vam pomoći.\n\n**Kako učiti:** Ovo je jedini predmet za koji bih definitivno preporučio da idete na sva predavaja. Naime, nema skripte nikakve, a prezentacije su jako loše. Na predavanju ćete vjerojatno manje-više shvatit sve, i onda prezentacije postanu solidan izvor za učenje. Ja sam slušo predavanja kod prof. Mikuca, meni se on svidio i sve sam od njega naučio, no većini je on malo \"dosadan\" (monotono priča nekako?). Neki preporučuju Čupićevu knjigu, no ogromna je, ja ju nisam ni otvorio. Ovdje se isplati samo rješavati što više ispita.\n\n**Težina:** 8/10\n\n**Korisnost:** 4/10\n\n\n## Vještine komuniciranja\n\n**Gradivo:** Ah, Vjekom. Jedini društveni predmet u prvom semestru. Inače nije toliko loš, nauči se i par korisnih stvari (npr. pisanje životopisa, izrada videa, etc). Definitivno najgora stvar kod predmeta je što je svaki četvrtak deadline za neke random zadaće pa morate trošiti jako puno vremena na to. No ispit je na Moodleu, tako da nije teško proći. Predavanja znaju biti zabavna i nose bodove, tako da idite na predavanja (iako nije tolki problem ako propustite).\n\n**Kako učiti:** Nemojte. Rješavajte samo sve zadaće da nakupite bodova, dolazite na predavanja za bodove, tamo možda i naučite nešto za ispit. Ispit bude relativno lagan, pišete od kuće, ali opet dobro je da znate malo stvari s predavanja.\n\n**Težina:** 2/10\n\n**Korisnost:** 2/10\n\n\n## Tjelesna i zdravstvena kultura\n\nTjelesni imate svaki semestar, i birate što želite raditi: neki sport, pješačenje, teretana, šah. Navodno je šah najbolja stvar ako vam je cilj samo riješit se ovoga, jedino je problem upast (ugh da, nisam upao...). No dobro dođe malo tjelovježbe inače.\n\nJa sam izabrao teretanu. Za pravu teretanu ionako nemate baš vremena, a još bi ju i platili. Teretana je super jer samo dođete u dvoranu kojigod dan želite (ali u određenom terminu), i radite štogod želite, nitko vas ne nagleda. Downside je što i nema baš nešto previše sprava kao u pravoj teretani, no svakako se da smislit neki workout. Moguće da bude malo dosadno ako ste sami te ako ne znate što raditi, no bude vrlo lijepo i opušteno ako imate gym buddyja s kojim idete.\n\nAko idete u teretanu, morate obavezno i otići dva puta po semestru na Sljeme (subotom ujutro). Zvuči naporno, no samo nemojte po zimi ići i bude to fora iskustvo, malo se prošetate i opustite.",
      "votes": {
        "upvoters": [
          "1vq",
          "NailAndGear",
          "iMakeApps (12345678901234567890)",
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "55606": {
      "poster": "aux",
      "content": "### DRUGI SEMESTAR\n\nEh, drugi semestar nas je zahvatila korona. Samo smo dva tjedna imali predavanja, dalje je sve online. Podijelit ću iskustva ovdje, ali YMMV. Mislim da su nam i dosta olakšali neke ispite zbog sve te situacije s koronom.\n\nOE i OOP sam imao 4, ostalo 5.\n\n\n## Matematička analiza 2\n\n**Gradivo:** Nastavlja se na Matan1, tako da je vrlo bitno da znate sve iz Matana1 i da se dobro snalizite s Linearnom algebrom. U Matan1 ste imali funkcije jedne varijable i sve je u 2Du, sada imate funkcije više varijabli i 3D, i onda na kraju redovi i diferencijalne jednadžbe. Preporučujem da krenete odmah učiti Matan2 kontinuirano i da ga ne ostavljate za kasnije, jer će vam biti potrebno znanje Matan2 u Fizici.\n\n**Kako učiti:** Manje-više isto kao i Matan1. Prvih par skripta je super, za to gradivo nisam uopće pratio online predavanja. Redovi su definitivno najteže gradivo, i iako se može razumjeti iz skripte, meni su puno pomogli videi prof. Pašića (i za redove i za diferencijalne prvog reda). Zadnja skripta za diferencijalne drugog reda je, po mom mišljenju grozna, te će na prvu činiti kao jako teško gradivo. Za to gradivo sam samo po Youtubeu tražio metode rješavanja koje se spominju u skripti, i onda kad malo bolje razumio što se događa, vratio sam se na skriptu i prošao sve s razumijevanjem. Ispiti su šablonski opet.\n\n**Težina:** 6/10\n\n**Korisnost:** 9/10\n\n\n## Objektno orijentirano programiranje\n\n**Gradivo:** Očito vjerojatno najvažniji predmet ako planirate na R smjer. Programirate u Javi, ali puno veći je fokus na \"OOP mentalitetu\" nego na sintaksu Javi. Pretpostavlja se da već znate UPRO, pa se u usporedbi s UPROom čini da gradivo krene jako brzo odjednom. Isti sistem s labosima i ispitima kao i na UPROu, iako nama su labosi bili online pa je bilo sve nekako opuštenije. \n\n**Kako učiti:** Učio sam većinom samo iz prezentacija, kasnije sam krenio pratit i online predavanja. Malo čudno, ali većinu sam gradiva naučio na labosima. Ispit opet na papiru, što ovdje nema baš previše smisla (nećete sigurno Javu pisat u Notepadu), tako da riješite i koji ispit na papiru kod kuće.\n\n**Težina:** 6/10\n\n**Korisnost:** 10/10\n\n\n## Fizika \n\n**Gradivo:** U fizici praktički prođete u jednom semestru cijelo gradivo srednje škole, i to na puno višem levelu. Nužno je da znate Matan1 i Matan2 jer ćete stalno koristiti integrale. Fizika nam je bio najneorganiziraniji predmet, bez online predavanja, te svaka grupa ima svoje prezentacije pa nije bas jasno odakle učiti. Malo je problem što se krenu dosta rano tu koristit diferencijalne jednadžbe koje tek na kraju semestra naučite iz Matan2, ne morate ih znat za fiziku no neke formule i izvodi se onda stvore niotkud i bude malo nejasno. Također u elektromagnetizmu se koriste npr. linijski i površinski integrale, što je (ako se ja ne varam) gradivo Matan3E, no znanje Matan2 te malo googlanja (KhanAcademy i 3Blue1Brown su super) je dovoljno da se u načelu shvati sve.\n\n**Kako učiti:** Meni su najbolje bile prezentacije prof. Sušac (grupa 4). Vrlo sažeto i lijepo objašnjeno, sa zadacima na kraju. Svaki tjedan sjednete, prođete teoriju u prezentaciji, krenete rješavat zadatke te kroz zadatke zapravo shvatite kako koristiti teoriju koju ste naučili. Na kraju imate i zadatke s ispita, što je dost korisno. Postoje skripte za mehaniku i elektromagnetizam, no jako su opširne i teške za razumjeti. Ako baš želite shvatiti u potpunosti matematičku podlogu svega, okej su, no nisu nužne. \n\n**Težina:** 8/10\n\n**Korisnost:** 6/10\n\n\n## Osnove elektrotehnike \n\n**Gradivo:** Ovaj predmet ima neki sličan feel kao i Diglog, ali ima dobre skripte. Treba malo vremena da vam klikne sve u glavi kako točno funkcionira. Kad jednom shvatite kako stvari funkcioniraju, predmet postane lagan jer stvarno nema skoro uopće učenja napamet, nikakvi dokazi ni ništa, samo treba znati rješavati zadatke, a formule koje dobijete su jako opširne. \n\n**Kako učiti:** Ja sam većinom samo pratio skripte, neke su dobre, neke su očajne. Možda malo previše zadiru u teoriju kada nije potrebno, ali sve u svemu su ok. Najkorisniji su zadaci na kraju, većinom sam samo njih rješavo. Navodno svi preporučuju rješavat zadatke iz Pavič-Felje, ali ja nekako nikako nisam ni pogledo tamo. U biti point cijelog predmeta je samo rješavati masu zadataka dok stvari ne sjednu.\n\n**Težina:** 6/10\n\n**Korisnost:** 8/10\n\n\n## Pretraživanje informacija i tehničko izražavaje (izborni)\n\n**Gradivo:** Uh... ne znam ni ja iskreno. Ali definitivno preporučujem pročitati upute za pravopis koje vam daju čisto iz zabave. Ozbiljno - presmiješno je.\n\n**Kako učiti:** Dan prije ispita prođete kroz sve prezentacije jednom-dvaput. \n\n**Težina:** 1/10\n\n**Korisnost:** 1/10\n\n**Bih li preporučio predmet:** Da, ne može baš biti lakše od ovoga. Koliko sam skužio, za MUI se moralo stalno nešto raditi, a za OND ne znam baš.",
      "votes": {
        "upvoters": [
          "1vq",
          "NailAndGear",
          "login"
        ],
        "downvoters": [
          "VincentVanSkok"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56176": {
      "poster": "Theanko (Mirko Žmirko)",
      "content": "Evo s obzirom da još nitko nije napisao ništa o Elementarnoj Matematici i Uvodu u Fiziku i dosta brucoša ni ne zna za te predmete ovo je moje mišljenje o njima i ukratko i o ostalima na temelju prošle godine (moguće da se nešto promijenilo). \n\n## Elementarna matematika\n\n>! Ukratko ako se iz matematičke gimnazije ili ste imali 5 na maturi iz matematike ovo vam ne treba. Ja sam iz bio iz opće gimnazije u kojoj smo preskočili jako puno obaveznog gradiva, na maturi sam imao nešto vise od 50%(da i takvi mogu upisati fer) i ovo mi je bilo jako korisno. Ovaj kolegij krene mjesec dana prije početka faksa dobivate prezentacije i zadatke svaki tjedan i na kraju tjedna dobijete test za vježbu. Prolazi se skoro svo gradivo srednje škole koje će vam trebati na faksu. Ima puno toga i neće vam trebati bas sve ali vrijedi barem pogledati i odmah vidjeti sto vam fali od znanja i primiti se posla. Bit će vam teško već 1.9 (mislim da je tako nekako bilo prošle godine) krenuti učiti. Svi vaši se još provode i kupaju a vi peglate po tamo nekim zadatcima ali to će vam puno vremena uštediti kada krene faks. A u prvom semestru dok se još ne priviknete na faks svaka ušteda vremena je važna. Ovaj predmet vam ne nosi ništa, ne dobivate ni dodatne ects bodove, niti vam piše u diplomi, napravljen je samo za vas i u svakom trenutku možete jednostavno odustati. Trebate sami za sebe procijeniti vaše znanje ali nemojte se zavaravati ma ja znam matematiku ne treba meni pomoć jer će vas analiza 1 **pojesti** \n\nBih li preporučio ovaj predmet: onaj tko zna da ne zna **SVAKAKO**, vama matematičarima će ovo sve biti smiješno vi uživajte još mjesec dana.\n\nKorisnost: **11/10**\n\n----\n\n## Uvod u Fiziku\n\ntl;dr Ako znaš fiziku beskorisno, ako ne znaš još beskorisnije jer na ovom predmetu ju nećeš naučiti a uložiti ćeš 40+ sati. Tih 40+ sati vam može spasiti godinu ako ih uložite u nešto drugo. **Ne upisuj.**\n>! Predmet zvuci odlično. Malo drugačiji od ELEMAT jer nosi 3 ECTS-a i imate ga 3 puta tjedno od 6 do 8. To je već prvi problem, ako ste ujutro na faksu, morate ponovo dolaziti na predavanja kojih ću se dotaknuti malo kasnije, a ako ste popodne onda ste na faksu od 1 do 8 kada se još uzme putovanje do faksa i tako 3 puta tjedno, nakon 3 tjedna uz svo ostalo učenje i labose nećete imati vise volju ni za faksom ni životom(osobno iskustvo). Drugi problem su profesorice, predmet drže po pola prof. Pleslić i prof. Bistričić, nisam izdržao do prof. Bistitričić pa za nju ne znam ali sam ćuo da je sve isto kao kod prof. Pleslić. Mislim da je kod nje problem što ima toliko znanja i iskustva da se ne može spustiti na nižu razinu i objasniti neke stvari.(slična situacija je i kod predmeta Fizika, skripte su joj jedne od boljih ali predavanja su smrt) Predavanja se svode na to da ona neku skupinu gradiva ispriča za 20ak min, sasvim u redu sve smo to već čuli u srednjoj vise nije ni potrebno ali onda krene sa zadacima, na način da jedan po jedan zadatak prikazuje na prezentaciji te postupak **prepiše** sa svog papira na ploču, uglavnom sve ubacuje u jednu formulu koju mi vidimo tek kad ona završi sa pisanjem, pita ima li pitanja i nastavi dalje. Ja sam fiziku u srednjoj dosta dobro znao maturu odlično napisao, ali nakon 2 tjedna predavanja ja sam bio apsolutno pogubljen. U fizici je bitno razmišljanje o zadatku i postupku a na ovom predmetu se to ne radi, nego se pokušava prepisati sto vise zadataka na ploču unutar 2 sata. I onda pošto 95% ljudi odustane od predavanja je taj cijeli zavod ljut, valjda na nas. I ta ljutnja i frustracija se vidi i na predmetu Fizika s kojom onda ljudi imaju problema a predmet se može položiti sa srednjoškolskim znanjem. (nemojte se zato previše opustiti)\n\n... I tako se jedan dan na faksu pročuje da za 2 dana pišete ispit. Niti znate sta, niti ste bili na predavanjima, imate 100 drugih stvari i problema za napraviti pa krenete nešto malo učiti dođete na test kao padobranac, gledate oko sebe ljude oni gledaju vas postoji nešto malo ljudi koji stvarno znaju i bili su na svim predavanjima(svaka čast) i onda se stanete u red za ispravljanje i prepisujete rješenja od drugih, ako ste imali sreće da je kolega do vas znao, prošli ste čestitam imate +3 ECTS (koja vam ne znače ništa ako padnete neki glavni predmet) a ako niste pišete ponovo, **ZA 2 DANA**, opet ista situacija niste puno naučili od srijede do petka, samo ovaj put još manje ljudi zna i tako nisi ste sta naučili niti ste sta dobili. Dok se nešto ne promijeni na tom predmetu ne upisujte možda shvate u čemu je problem.\n\nJoš jedan problem je sto ta 3 ECTS-a ne znače ništa, ne mogu vam spasiti godinu tj. ne broje se sa ovih 60 običnih, nego su to dodatni koji idu u posebnu diplomu. Znaci uložiš 30 sati predavanja, još min. 10 učenja za apsolutno ništa, onaj tko zna fiziku njemu ovo ne treba samo gubljenje vremena, a onaj tko ne zna njemu je ovo još veće gubljenje vremena, uložite tih 40 sati u analizu 1 ili labose za upro, od toga nešto imate. \n\nKorisnost: **0/10**\n\nBih li preporučio ovaj predmet: **NE**\n\n\n----\n----\n\nNapisati ću još i mišljenje o ostalim predmetima stvarno ukratko jer sve je već rečeno. \n\nZimski semestar je po meni lakši od ljetnog, potrudite se i položite sve da imate mirniju glavu u ljetnom.\n\n## Digitalna logika\n\n>! Predmet je okej, ako vam ne odgovaraju predavanja u vašoj grupi idite kod Čupića, on će vam vrlo vjerojatno biti super. Meni je i Đurek bio dosta dobar radi puno grešaka ali objasni. Kada se redovito prati nije teško. Jako korisno vam je ferko.fer.hr/diglog/ imate tamo sve stare ispite i auditorne. Labosi nisu neki problem, dosta vremena uzmu ali uvijek ima netko tko zna i može pomoći.\n\nTežina: **5/10**\n\nKorisnost: kao što je rečeno predmet je temelj morate biti barem upoznati sa tim stvarima.\n\n----\n\n## Linearna Algebra\n\n>! Prošao sam to ni sam ne znam kako, do MI je okej i to je temelj to stvarno morate naučiti, a onda se krene nešto petljat sa nekim pojmovima i dokazima...  Imao sam Ilka on je odličan za nekog tko zna i razumije, ako pogodite njegovu frekvenciju predmet će vam biti predobar, ja pojma nisam imao ali je bar bilo zabavno na predavanjima. Mali privatni teatar. I zaboravite na pauze kod Ilka, uvijek je vrijeme za pauzu kada se taman uživi pa on uvijek smatra \"pauza bi u ovom trenutku bila kontraproduktivna\" i nastavi dalje, zabavno :)\n\nTežina: **7/10**\n\nKorisnost: **?/10**\n\n----\n\n## Matematička Analiza 1\n\n>! To mi je ostalo za jesenski rok, nisam se još bio snašao a odmah je krenulo opako, po meni najteži predmet prve godine. Taj predmet stisnite od početka i probajte položiti kontinuirano, nemojte misliti ma budem ja to na roku jer ne budete i ostati će vam za ljeto a na ljeto ćete imati predmete ljetnog semestra i onda morate na jesenski. Ja sam imao prof. Bukala, odličan profesor, svaki teorem i zadatak lijepo napise i objasni, nisam volio matematičku analizu 1 ali sam volio ići na njegova predavanja. \n\nTežina: **10/10**\n\nKorisnost: **9/10**\n\n----\n\n## Uvod u programiranje\n\n>! Ne pre težak predmet, ja nikad u životu nisam ni Hello World napisao a uspio sam ga lijepo savladati, jednostavno morate sami raditi. Imate stvarno puno zadataka za vježbu i probajte sami doći do rješenja. **Nemojte** sebe zavaravati pa pogledati rješenje pa to prepisati i onda misliti ma ja to znam. To vam je recept za pasti ovaj predmet i labose. \n\nTežina: **5/10**\n\nKorisnost: **8/10**\n\n----\n\n## Vještine Komuniciranja\n\n>! Nemojte se praviti pametni i ne raditi zadaće i zadatke na moodleu. Svaki tjedan moraš jednom otvoriti moodle i predati neku glupost. I morate skupiti prag sa predavanja, ali vam to može jedan iz ekipe klikati za vas. Predmet je free. Test vam je na moodleu, i smijete koristiti materijale. Jos jednom predemet je free nemojte biti posebni i pasti ovo. \n\nTežina: **1 / 10**\n\nKorisnost: možda ne toliko na prvoj godini ali bitno je znati neke stvari - **8/10**\n\n----\n----\n\n**Ljetni semestar smo imali online, neke stvari će možda biti drugačije, i po meni su završni ispiti bili olakšani pazite na to**\n\n## Fizika\n\n>! Kao i kod uvoda u fiziku, profesori uništavaju ovaj predmet. Koliko sam čuo fizika je uvijek bila predmet koji se može proći kapmanjski, tako je i sad. Nudi vam se 20 FREE bodova na zadaćama i labosima, zadaće možete i prepisati, a labose smo mi imali malo drugačije pa vam ne mogu puno pomoći ali također free bodovi. Sa tih 20 na ispitu vam treba 30/80, postoji i neki prag ali nije nikakav problem, šablonski su zadaci, dvojku svatko može upecati, samo nemojte odustati prije ispita i misliti ma nisam ništa radio ne mogu položiti. Ja sam u 2 dana ulovio točno 30 na ispitu. (ovo ne kažem da se opustite i ne radite nego da ne odustajete koliko god malo vremena imali) \n\nTežina: **3/10**\n\nKorisnost: **0/10**\n\n----\n\n## Matematička analiza 2\n\n>! Lakši i zanimljiviji predmet od matan1, čini se puno teže nego što zapravo je. Skripta i prof. Burić -> BEST BUY \n\nprof. Burić ima i ponavljanje za ispit na svom YT, prof. Pašić ima ponavljanje diferencijalnih jednadžbi na svom kanalu. Pitajte ih za to ako će vam trebati, jako kvalitetno!\n\nTežina: **5/10**\n\nKorisnost: dosta korisno ali ne znam što od toga koristimo dalje\n\n----\n\n## Objektno Orijentirano Programiranje\n\n>! Meni je bilo zabavno iako predmet je težak i još ga oni sa ispitima zakompliciraju ali to je temelj koji se mora znati. Slično kao za UPRO, nemojte sami sebe varati i gledati rješenje pa misliti da znate. Ovdje je problem što baš i nemate zadatke za vježbu. Ovaj predmet učite stvarno sa razumijevanjem i kontinuirano, inače bi moglo biti veselo...\n\nTežina: **8/10**\n\nKorisnost: **10/10**\n\n----\n\n## Osnove elektrotehnike\n\n>! Okej predmet, nije preteško, treba se učiti i vježbati zadatke ali se može i malo kampanjski, ako mislite na E smjer ovaj predmet shvatite ozbiljno. Imate i labose koju su uglavnom free, neke bliceve za koje nešto i treba znati, zadaće ako ne znate ćete se snaći, nije neki problem.\n\nTežina: **5/10**\n\nKorisnost: **10/10**\n\n----\n\nU materijalima imate još i vodič za brucoše, tamo je još detaljnije sve rečeno, Ako vam se stvarno ništa ne da čitati, ovo si zapamtite, što prije to shvatite biti će vam lakše. \n>! ![](assets/2020-07-21/00009.png)",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "NailAndGear",
          "WickyWinslow",
          "ZvonkoSisoje",
          "[deleted]",
          "iftedbytwosh",
          "klukas",
          "zdravoljubac (rajka)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217448": {
      "poster": "[deleted]",
      "content": "## Matan1\n\nJako zabavan i zanimljiv predmet. Manje više gradivo matematičkih gimnazija nešto dublje obrađeno plus integrali. Predmet nije problem položiti kontinuirano samo treba nakon svake lekcije izvježbati istu da ne bi došao u poziciju gdje moraš sve gradivo izvježbati 3 dana prije ispita jer logično to neće biti baš lagano. Profesori i više nego ugodni. Ja sam slušao Pašića dok smo bili uživo, a s video predavanja mi se jako svidio Bukal. Bojanjac ima najbolje auditorne. Marangunić je navodno puno bolji uživo i prednost je što izvede sve dokaze koji se pojavljuju na ispitima. Imajte na umu da su dokazi i slična teorija 40% ocjene tako da isto preporučujem dokaze shvatiti kad se izvode na nastavi, a ne trošiti vrijeme pred ispit štrebajući iste\n\nTežina: **6.5 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Linal(g)\n\nNajkorisniji predmet prvog semestra. Iako će većina reći da je prvi ciklus (do MI) puno lakši ja bi se samo donekle složio. Kreće se lagano (računski) al izrazito nepovezano. Uvedu puno novih pojmova (matrice, determinante i sl.) koje si apsolutno ne možeš predočiti što znače. Sjećam se međuispita di računam determinantu i pitam se zašto bi ovo itko računao. U drugom ciklusu dobijete odgovor na to što je ustvari matrica, i cijeli smisao toga što se radi na ovom kolegiju a to su linearni operatori. Učinite si uslugu i apsolutno prije svega si pogledajte \"Essence of Linear Algebra\" kanala 3b1b. Predmet se da stvarno lagano proći jer je nažalost maksimalno šabloniziran. Auditorne su overkill u odnosu na ispite, pa ih nema smisla baš ni gledati/slušati osim ako ne ciljate na višu ocjenu ili vas to baš izričito zanima (što nije nemoguće jer je linearna stvarno izvrstan predmet). Od profesora preporučujem profesoricu Aljinović, a savjetujem da izbjegavate Ilka jer to je jedna vrlo kompleksna, dapače osebujna, pojava s kojom je bolje ne imati posla. Čovjek je nedvojbeno pametan, ali moja malenkost smatra da je promašio ceo fudbal što se tiče predavanja. Uštedi te si živce i odite na nekog drugog.\n\nTežina: **4 / 10**\n\nKorisnost: **10/ 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Diglog\n\nNema se što reći, svi profesori korektni. Nema se otkud učiti pa idite na predavanja. Ispiti su šablona, al nije toliko lako za proć. Ako se radi kontinuirano ne bi trebalo biti problema. Ja sam slušao Čupića i bilo je stvarno solidno. Na predmetu se uče neke osnove toga kako digitalni svijet funkcionira. Hibridno gradivo E i R smjera. Sve u svemu okej, iako ne pretjerano korisno. Starije kolege imaju običaj držati masovne što ti apsolutno može dignuti ocjenu jer vam pokažu neke trikove i pristupe rješavanju (shoutout kolegi @Filemon). \n\nTežina: **6 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Upro\n\nUvod u programiranje. Kao što ima kaže učiš programirati u jednom od najtežih (sintaksno) jezika. Ako si programirao u srednjoj predmet će ti biti laganica i svodit će se na učenje sintakse (ako već ne znaš C). Ako ćeš ovdje se prvi put susrest s programiranjem onda će ti već biti malo teže. Ovdje je najlakše proći ako rješavaš zadatke za vježbu koje dobiješ nakon predavanja jer te jako dobro spreme za ispit. Labosi su lagani. Ispiti konceptualno isto, al je teže što programiraš na papiru. Preporuke za profesora Pintar. Simpatičan jako i dobro predaje. \n\nTežina: **3 / 10 ili 7/10**\n\nKorisnost: **8 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Vjekom(a)\n\nTlaka i konceptualno koristan, ali izvedbeno totalno promašen kolegij. Pale je neopisiv narcisist, al što je tu je. Radite zadaće i proći ćete.\n\nTežina: **4 / 10**\n\nKorisnost: **1 / 10**\n\nBih li preporučio/la predmet: **Ne**\n\n**##Došli smo do drugog semestra##**\n## Matan2\n\nLakši od jedinice bar što se ispita tiče. Gradivo konceptualno teže al samo računanje lakše. Dosta zanimljiv predmet i sve u svemu najbolji predmet drugog semestra. Preporučujem svakako Šikića, meni najbolji osobno. Još sam čuo pohvale za profesora Pašića, kao i profesora Burića. Pošto je dio nastave bio online svi navedeni su imali super predavanja barem po meni. Boajnjac uvjerljivo najbolje auditorne i sve u svemu možda i najbolja osoba s kojom sam imao interakcije u prvoj godini. Stvarno voli pomoći oko svega što vas muči. Same preporuke za zavod i kolegij.\n\nTežina: **6 / 10**\n\nKorisnost: **8 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## OOP\n\nReal deal programiranje. Jezik je Java što je okej jer sintaksa nije pretjerano zahtjevna. Kolegij je sve u svemu ne pretežak barem po gradivu. Ali problem su ispiti gdje su zadatci jako loše napisani, ne znaš što žele od tebe i imaju neki suludi sustav bodovanja. Asistenti su većinom nesusretljivi, a od profesora preporučujem Milašinovića i Babića. Učite za bliceve iz labosa jer sam tu prosuo cca 5 bodova. Ponavljam, ne žele vam baš izaći u susret pa se spremite na živciranje. K tome ispravljanje MI-ja je trajalo 3 tjedna, pa ako neko s tog kolegija ovo čita zamolio bih da se malo to ubrza čisto jer je to već malo predug vremenski interval (po mome skromnome mišljenju). I da Edgar je naporan al što je tu je.\n\nTežina: **7 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Osnele\n\nNije teško, nije lagano. Ispiti su šablona. Treba vježbat Pavić Felju i sve će biti uredu. Kao R-ovcu stvari su mi bile zanimljive al ne pretjerano korisne. Također studenti imaju običaj držati masovne što dosta pomogne (shoutout @MarokMarsci). Prepouručam il Trkulju il Kneževića (i da ima i bmw x5 i porschea)\n\nTežina: **5 / 10**\n\nKorisnost: **? / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Fizika\n\nClusterfuck od kolegija i zavoda. Prvi dio relativno lagan i tu treba skupit bodove. Drugi relativno težak i predmet nije toliko šablonski pa se nemojte kao ja nadati naučit u dva dana prije ispita. Nažalost masovnih nema a mogle bi biti stvarno korisne. Učit se nema baš iz čega. Imate Ilijćevu skriptu koja je tak tak. Preporučujem preze prof Plešić iako neće vas ni to spasiti ako nemat određenu dozu intuicije i ljubavi prema fizici. Nisam slušao nikoga jer su predavanja pusti izvodi i svašta nešto. Preporučujem pokuse kolege Ječmenice. Lab vježbe su zabavne čak i relativno chill.  \n\nTežina: **6 / 10**\n\nKorisnost: **-5 / 10**\n\nBih li preporučio/la predmet: **Ne**",
      "votes": {
        "upvoters": [
          "Filemon",
          "GAVRAN",
          "MarokMarsci (Collapse Enjoyer)",
          "Muad-Dib (MuadDib)",
          "Vishnjevac",
          "ZvonkoSisoje",
          "[deleted]",
          "[deleted]",
          "indythedog",
          "macaklin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Katie",
          "Luc",
          "Svarog (Veles)",
          "ZvonkoSisoje",
          "gladiator",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "indythedog",
          "turunturu (Cement)",
          "wutangfan (HugoStiglitz)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "218494": {
      "poster": "kRoko (rKr3)",
      "content": "Pozdrav ekipa, evo prije nekoliko dana završio sam prvu godinu pa evo malo reviewa kako je sve to išlo. Odmah na početku ću napomenuti da je nama brucošima nastava bila organizirana tako da smo ponedjeljkom i utorkom bili uživo na faksu, a ostatak tjedna pratili online. Gotovo svi labosi održavali su se također uživo.\n\nEvo za početak prvo ova dva mostna kolegija:\n\n## Elementarna matematika\nApsolutno preporučam svima koji su u srednjoj imali malo klimaviju matematiku da prate ovo jer ćete kroz tih nekoliko tjedana prije faksa proći ukratko sve gradivo srednje za koje se očekuje da ga već znate kada dođete na prvi matematički kolegij. Predmet vodi prof. Lana Horvat o kojoj ću pisati malo više kasnije. Uglavnom na kraju svakog tjedna imate konzultacije gdje možete pitati profesoricu ako nešto ne razumijete i sve je to lijepo organizirano da vas pripremi za ono što slijedi kasnije.\n\nTežina: **0 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Uvod u fiziku\nOvaj \"kolegij\" vam za razliku od ElMat nosi dodatne ECTSove koji su praktički useless jer vam ne mogu spasiti godinu, a ako ih ne položite nikom ništa. Toplo bih vam preporučio da ovaj kolegij izbjegnete jer je fizika zaista jedan od lakših kolegija, a vrijeme koje biste uložili u ovo vam može pomoći da bolje pripremite neki drugi teži predmet prvog semestra.\n\nTežina: **? / 10**\n\nKorisnost: **0 / 10**\n\nBih li preporučio/la predmet:  **Ne**\n\n## ZIMSKI SEMESTAR\n\n\n## Uvod u programiranje\n\nPrije nego što krenem komentirati predmet želio bih odmah adresirati jednu stigmu, a to je da se prije FERa treba dobro znati programirati. Ovo nikako nije istina s obzirom da se kreće sa apsolutne 0 i ništa nećete propustiti ako ste početnici.\n\nGradivo:\n\nProgramira se u jeziku C, kreće se vrlo polako sa sintaksom i sličnim, ali dosta brzo se zakomplicira kada se uvedu pokazivači, funkcije itd., ali u suštini nije ništa preteško da je nemoguće za savladati.\n\nLiteratura:\n\nMeni su njihove prezentacije bile sasvim dovoljne, vrlo su dobro i jasno napisane i dovoljno je učiti samo iz njih.\n\nProfesori: \n\nMeni je odličan bio profesor Pintar, bar na online predavanjima, uživo nisam baš išao.\n\nKako položiti: \n\nOvo je predmet koji, ako ste početnici u programiranju, definitivno želite učiti redovito, a na to će vas natjerati i labosi koji nisu ništa užasno teški. Nisam siguran kako labosi izgledaju u normalnoj nastavi, ali nama su nosili svega 7-8 bodova, bili su online(Edgar) i to je bilo poprilično free. Još jedna stvar koja će vas izvrsno pripremiti za ispite su zadatci za ponavljanje na kraju svake lekcije. Zadatci su slične težine kao i oni u ispitima te ako ih znate riješiti nećete imati velikih problema na ispitu. \n\nTežina: **3 / 10 za iskusne, 7/10 za početnike**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da, ovo su zbilja osnove osnova i bez znanja ovog kolegija OOP će vam biti noćna mora**\n\n## Linearna algebra\n\nGradivo:\n\nOvo je jedan od dva matematička kolegija prvog semestra. Na početku ćete raditi matrice, determinante, rješavanje sustava jednadžbi itd. što je poprilično lagano za naučiti i savladati, ali se u drugom ciklusu pojavljuju razni vektori, vektorski prostori, operatori itd. što je većini studenata vrlo apstraktno i teško za savladati. Preporuke da pogledate videe sa yt kanala 3blue1brown gdje su te stvari jako dobro objašnjene.\n\nProfesori:\n\nProfesorice Andrea Aglić i Anamari Nakić su mi bile zbilja odlične kako uživo tako i preko online predavanja. Izbjegavajte profesora Brnetića, još nisam čuo pozitivan komentar na njegova predavanja.\n\nLiteratura:\n\nKnjižice profesora Elezovića su zbilja super, preporučam da si ih kupite u skriptarnici ili od nekog starijeg jer online verzija nema zadatke za vježbanje na samome kraju. \n\nKako položiti:\n\nOvdje vam rješavanje domaćih zadaća(sama točnost je nebitna, možete poklikati random odgovore i dobiti sve bodove) spušta prag na svega 40 bodova što je iznimno malo. Definitivno preporučam da ovaj predmet riješite već na međuispitu jer je gradivo zbilja šablonsko i lagano te da si time olakšate drugi ciklus jer možete ignorirati predmet ako ste zadovoljni sa dvojkom. Meni je kontinuirano rješavanje zadaća i zadataka iz knjižica bilo iznimno korisno te definitivno preporučam takav način učenja i vježbanja.\n\nTežina: **6 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Digitalna logika\n\nGradivo:\n\nOpet se kreće dosta lagano, uče se brojevni sustavi, Booleova algebra i još neke stvari koje su vam možda i poznate iz srednjoškolske informatike, ali se kasnije uvode multipleksori, dekoderi, bistabili i slične stvari koje se koriste do samog kraja kolegija. Meni je ovo bio najteži predmet prvog semestra.\n\nProfesori:\n\nJoš jedna lažna stigma da onaj tko nije kod Čupića ne može proći kolegij. Meni su njegova predavanja bilo iznimno dosadna i naporna jer objašnjava vrlo sporo i spominje neke nebitne stvari koje samo zbunjuju. Na uživo nastavi su mi odlični bili profesori Đurek i Mikuc.\n\nLiteratura:\n\nGotovo nepostojeća, učite rješavati zadatke iz prošlih ispita, druge vam nema. Imao sam onu Čupićevu knjigu, otvorio je 3 puta i nikad više, nikako ne preporučam.\n\nLabosi:\n\nNa početku se dijelite na tzv. sklopovske i simulacijske grupe. Definitivno preporučam da radite sklopovske na toj FPGA pločici jer su zadatci dosta razumljiviji u smislu da možete lakše vizualizirati to što radite samim pritiscima na gumbe. Prvih par labosa su jako lagani, ali zadnjih par nosi dosta bodova i baš su mi bili teški i za pripremu i za samo izvođenje na satu. Pazite se da to dobro odradite jer labosi imaju prag koji morate položiti kako biste prošli kolegij.\n\nKako položiti:\n\nPreporučam da na međuispitu sakupite dosta bodova jer je gradivo puno lakše nego na završnom. Ispiti su teška šablona i znam dosta ljudi da su prošli ispite tako da su štrebali ispite prošlih nekoliko godina dva dana prije. Jedina stvar koja zezne dosta studenata je taj prag od 40%(čini mi se) na završnom koji je malo teže zadovoljiti ako učite dan prije.\n\nTežina: **9 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporučio/la predmet: **Ne**\n\n## Matematička analiza 1\n\nŠećer na kraju 1. semestra, čuvena matematika.\n\nGradivo:\n\nViše manje srednjoškolsko gradivo podignuto na jednu višu razinu + integrali. Također nova stvar sa kojom se većina prvi put susreće u matematici, a to su dokazi koji na svakom ispitu nose otprilike 40-ak% bodova. Uistinu nije ništa preteško kao što se predstavlja, a prag za dvojku je svega 45 bodova što nije teško za skupiti. \n\nProfesori:\n\nMeni definitivno najdraža profesorica sa svih predmeta prve godine je Lana Horvat. Žena na predavanjima pršti od energije i doslovno skače sa jednog kraja ploče na drugi. Također riješi iznimno velik broj zadataka što će vam biti korisno za ispite te većinu dokaza malo pojednostavi i pojasni. Profesor Mervan Pašić se svidio većini studenata, ali za moj ukus je mrvicu prespor. Prof. Bukal je bio vrlo dobar na online predavanjima, nisam siguran kakav je uživo. Prof. koju u ovom predmetu želite izbjeć je vrlo vjerojatno Pina Milišić. Vrlo je draga i dobra osoba, ali predavanja su zaista loše kvalitete. \n\nLiteratura:\n\nSkripta je jedina literatura, ali je stvarno top tier i definitivno najbolja literatura na cijelom 1. semestru.\n\nKako položiti:\n\nOvo je također predmet koji želite učiti kontinuirano, inače vam rok ne gine. Za međuispit većina ljudi preskoči kombinatoriku, iako je gradivo poprilično lagano i logično tako da preporučam da to ne radite. Za završni učite te derivacije i integrale tako da riješite što više zadataka iz skripte(ima ih valjda 100tinjak bar iz integrala). Dokaze ćete morati naštrebati, ali nisu ništa posebno teški i daju se svi naučiti 2-3 dana prije ispita. \n\nIako ne uspijete položiti kolegij, obavezno naučite te derivacije i integrale jer ćete bez njih imate velikih problema u MatAn2.\n\n\nTežina: **8 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\nOvako bih poredao težinu ispita na kontinuiranoj nastavi(u zagradi je ciklus, znači prvi ili drugi:\n\nLinearna(1)<Diglog(1)<Upro(1)<Upro(2)<Matan(1)<Matan(2)<Diglog(2)<Linearna(2)\n\n## LJETNI SEMESTAR\n\n## Osnove elektrotehnike\n\nGradivo:\n\nKreće se lagano, strujni krugovi na razini srednjoškolske fizike, ali ipak na jednoj višoj razini gdje se koriste imaginarni brojevi. Kasnije se uvode razni teoremi, transformacije krugova, trofazna trošila itd. \n\nProfesori:\n\nNisam baš pratio predavanja, ali mi je uživo najbolji bio definitivno profesor Knežević. Super predaje te drži odličnu atmosferu u učionici. \n\nLiteratura:\n\nJako slaba, postoji i knjiga i prezentacija, ali imao sam problema sa učenjem i iz jednog i iz drugog. Preporučam zbirku zadataka Pavić Felja, osim samih zadatka ima i mali uvod u svako gradivo sa pojašnjenjem osnovnih pojmova.\n\nLabosi: \n\nViše manje free bodovi, dođete tamo, spojite te krugove, zabilježite odgovore i gotovi ste. \n\nKako položiti:\n\nOvaj predmet ima sličan vibe kao Digitalna logika u smislu da su ispiti vrlo šablonski, zadatci se ponavljaju te također na međuispitu želite sakupiti malo više bodova jer je dosta lakši. Također je i jedini predmet koji na kraju ima usmeni ispit(nama nije bilo zbog korone, idk kako će biti sljedećih godina), ali to nije ništa strašno teško. Predmet se da spremiti dva dana prije, ali ne preporučujem da to radite.\n\nTežina: **5 / 10**\n\nKorisnost: **0 / 10 za računarce, 10/10 za elektrotehničare**\n\nBih li preporučio/la predmet: **Ne jer idem na R**\n\n## Fizika\n\nGradivo:\n\nViše manje cijelo srednjoškolsko gradivo, ali ga sada učite uz integrale i derivacije.\n\nProfesori:\n\nPredavanja na ovom kolegiju su beskorisna, ali ako baš želite ići, idite kod profesora Saše Ilijića, daleko je najbolji od svih. Izbjegavajte Gomzija. \n\nLiteratura:\n\nOpet nepostojeća, imate onu Ilijićevu skriptu i Horvatovu knjigu, ali to je po meni overkill.\n\nLabosi:\n\nFree bodovi, neke vježbice su čak i zanimljive za izvodit. Na kraju zadnjeg labosa dobijete neki blic za 3-4 boda, također free.\n\nKako položiti:\n\nOvo je predmet koji će velika većina vas učiti dan, maksimalno dva prije samog ispita. Preporučujem da riješite te labose i zadaće dobro jer vam onda preostaje da skupite svega 30 bodova na ispitima. Za ispite dobro naučite bar jedno gradivo da vas ne zezne onaj glupi prag od bar jednog 100% zadatka. Izvodi na ispitima su free bodovi. \n\nTežina: **5 / 10**\n\nKorisnost: **-10 / 10**\n\nBih li preporučio/la predmet: **NE**\n\n## Matematička analiza 2\n\nGradivo: \n\nPrvi ciklus radite funkcije više varijabli te će vam tu znanje gradiva 1. semestra iz Linearne i Analize 1 biti vrlo korisno. \n\nDrugi ciklus je nešto skroz novo, učite redove i diferencijalne jednadžbe.\n\nProfesori:\n\nOpet su tu Lana Horvat i Mervan Pašić, ali odlični su i Burić te Šikić. Nećete pogriješiti kod god od njih bili.\n\nLiteratura:\n\nOpet top tier skripta, ista kao i MatAn 1.\n\nKako položiti:\n\nKontinuirano učenje+rješavanje velikog broja zadatka. Iako je po meni gradivo ovog kolegija teže nego MatAn1, mislim da ga je lakše položiti. U završnom ispitu dosta ljudi ignorira redove, ali opet ne preporučujem da to radite jer stvarno nisu toliko teški. \n\nTežina: **8 / 10**\n\nKorisnost: **8 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Objektno orijentirano programiranje\n\nGradivo:\n\nObjektivno najteži predmet cijele prve godine te vaš prvi susret sa malo ozbiljnijim programiranjem. Radite u Javi i gradivo se obrađuje vrlo brzo tako da preporučam da ne izgubite korak sa gradivom jer ćete se inače jako teško vratiti u normalu. Uče se klase, nasljeđivanja, datoteke, Swing itd.\n\nProfesori:\n\nOdlični su profesori Milašinović i Jagušt, za ostale ne znam. \n\nLiteratura:\n\nSlično kao i UPRO, prezentacije su vrlo dobro i jasno napisane i dovoljno je učiti iz njih.\n\nLabosi:\n\nNose čak 50 bodova te imaju prag od 25 koji ako ne položite prebacujete predmet na sljedeću godinu. Zadatci su poprilično teški te zahtijevaju od vas dobro razumijevanje gradiva. Također imaju i one pitalice koje rješavate prije samog programskog zadatka, ali one zbilja nisu teške. Mislim da sam negdje pročitao da su zadnja 2 labosa najteža, ali to nije baš istina, ja sam imao iskustvo da sam u 2. labosu dobio ultra teške zadatke, a u zadnjem mi je rješenje bilo 5 linija koda tako da vam je to čista sreća. \n\nKako položiti:\n\nOvo je predmet koji sam ja vrlo vjerojatno učio triput više nego ostala tri zajedno. Težina ovog predmeta ne leži nužno u samoj težini gradiva, već u bezbroj pragova na koje morate paziti i položiti te vrlo nespretno napisanim zadatcima u ispitima i labosima. Također ovo je predmet kojeg se želite pod svaku cijenu riješiti u kontinuiranoj nastavi jer su rokovi dosta teži. Iako je Swing među studentima dosta omražen, nije pretjerano težak te ako samo naučite onaj raspored komponenti na završnom ispitu već imate 5-6 free bodova. Također, za završni ćete trebati naštrebati dosta toga jer jbg programira se na papiru.\n\nTežina: **10 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **DA**\n\n\nOvako bih poredao težinu ispita na kontinuiranoj nastavi:\n\nOE(1)<Fiz(1)<Fiz(2)<Matan(2)<Matan(1)<OE(2)<OOP(1)<OOP(2)",
      "votes": {
        "upvoters": [
          "1vq",
          "Emma63194",
          "Filemon",
          "GAVRAN",
          "Kaladonter",
          "Svarog (Veles)",
          "WickyWinslow",
          "[deleted]",
          "idontwannabemyself",
          "kRoko (rKr3)",
          "kix7 (Fish99)",
          "macaklin"
        ],
        "downvoters": [
          "Grdobina2000 (Grdobina)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "241445": {
      "poster": "iMakeApps (12345678901234567890)",
      "content": "Brucoš sam i zanima me kako najmanje vremena izgubiti na ovom fakultetu, a opet proći sve. \n\nNije mi nikakav problem sjesti i natjerati se da učim, pa mi je zgodno to što nije obavezno dolaziti na predavanja.\n\nNa predmete kojih predavanja je najkorisnije dolaziti, a koje mogu brze sam naučiti?\n\nIsto me zanima i za TZK (kako proć, a najmanje vremena izgubiti).\n\nOvo su mi trenutno upisani predmeti:\n- digitalna logika\n- linearna algebra\n- matematička analiza 1\n- TZK\n- uvod u fiziku (mostni kolegij)\n- uvod u programiranje\n- vještine komuniciranje",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "241447": {
      "poster": "Bucc (Olive Oil)",
      "content": "@\"iMakeApps\"#p241445 sve sam gang. ispiši uvod u fiziku, kaj će ti to? TZK ne moraš dolazit, ja nisam, otišao tri puta na sljeme u sva 4 TZK-a i prošao.",
      "votes": {
        "upvoters": [
          "iMakeApps (12345678901234567890)",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "241449": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@\"iMakeApps\"#p241445 ngmi",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": [
          "Upforpslone"
        ]
      },
      "reactions": {
        "haha": [
          "Filemon"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "241471": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "@\"iMakeApps\"#p241445 digitalna definitivno odi na čupićeva predavanja, to je recept za lagani prolaz uz minimalan rad kod kuće. Matan1 je najbolji kod mervana (barem meni), a za ove ostale nezz.",
      "votes": {
        "upvoters": [
          "1vq",
          "iMakeApps (12345678901234567890)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "241481": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"iMakeApps\"#p241445 Najbolje ti je na sve ići\n\nVjekom je onako, možda i redundantan, ali možda je zanemarivanje tog predmeta razlog zašto je toliko FERovaca incelasto, ne zna komunicirati s kolegama, i ne zna pisati mailove, CVove i motivacijska pisma\n\n¯\\\\\\_(ツ)_/¯",
      "votes": {
        "upvoters": [
          "Filemon",
          "iMakeApps (12345678901234567890)",
          "kix7 (Fish99)",
          "nk53955",
          "nnn (dinoo)",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "241550": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@\"iMakeApps\"#p241445 neces proci programiranje s gledanjem predavanja, waste of time",
      "votes": {
        "upvoters": [
          "iMakeApps (12345678901234567890)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}