{
  "title": "[EIIT] Predmeti 2. godine diplomskog studija",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "eiit-predmeti-2-godine-diplomskog-studija",
  "tags": [
    "FER",
    "Općenito",
    "Informacije o predmetima"
  ],
  "posts": {
    "44412": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Ovdje možete podijeliti iskustva, preporuke i/ili pitati u vezi predmeta **2. godine diplomskog studija [u]elektrotehnike i informacijske tehnologije[/u]**.\n\nUkoliko želite podijeliti mišljenje(a) o predmetu, možete koristiti sljedeći predložak:\n\n```markdown\n## Ime predmeta\n\nnešto o predmetu\n\nTežina: **? / 10**\nKorisnost: **? / 10**\nBih li preporučio/la predmet: **Da / Ne**\n```\n\nšto će rezultirati:\n\n>## Ime predmeta\n\n>nešto o predmetu\n\n>Težina: **? / 10**\n\n>Korisnost: **? / 10**\n\n>Bih li preporučio/la predmet: **Da / Ne**\n\nNije imperativ da koristite ovakav predložak (ili bilo koji drugi), ali ovo izgleda sažeto i vjerujem da uz najmanji trud i najmanje tipkanja možete ponuditi lijepo formatirane informacije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52480": {
      "poster": "Dell",
      "content": "Neuronske mreže i obrambeni sustavi i tehnologije, iskustva?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137912": {
      "poster": "[deleted]",
      "content": "Dojmovi, ERI zimski semestar, 2020./2021., korona semestar 2\n\n**Alati za razvoj digitalnih sustava**\n\nVučićev predmet. Na predmetu se uči osnovama digitalnog dizajna na FPGA, koristeći jezik VHDL. Gradivo međuispita pokriva većinom sintaksu VHDL-a i njegovu primjenu na zadatcima, dok gradivo završnog ispita pokriva još i teoriju vezanu uz strukturu FPGA. VHDL se uči iz nule, te je puno bolje i dublje odrađano područje nego u 3. ciklusu URS-a. Ove godine su predmet slušali ljudi s 3. godine (FER3), 4. i 5. (FER2). FER2 je imao dva labosa, od kojih je jedan bio čisto simulacijski, dok je drugi imao tri zadatka. Zadatci su se pisali kod kuće, te su se onda isprobavali u labosu. Ukupno nose 15 bodova, to se dosta lako može skupiti. FER3 ima jedan labos više, ali zato 1 zadatak manje na ZI. MI nosi 35 bodova, ZI 50, kumulativni prag iznosi 50%. Ispiti su dosta naporni i vremenski zahtjevni. Pišu se VHDL kodovi na papiru, zadatci koji se pojavljuju su tipski, i nalaze se u nekom svom obliku ili u skripti ili na labosima. S druge strane, Molnar to dosta blago ispravlja. Gradivo predmeta je pokriveno odličnom skriptom u tri dijela, koja vam je i više nego dovoljan izvor informacija za ovaj predmet. Ako se mislite baviti nekom vrstom digitalnog dizajna nakon faksa, ovaj predmet će vam dati odličnu podlogu za početak rada u industriji, a gradivo skripti vam može tada poslužiti i nakon završetka predmeta. \n\nTežina: 5/10\n\nKorisnost: 9/10\n\nBih li preporučio/la predmet: Da\n\n**Napredne metode digitalne obrade signala**\n\nPredmet drže Seršić i ASK. Po n-ti put na faksu gradivo ćete započeti Fourierovim transformacijama. Nakon toga uče se Wavelet transformacije i njihove efikasne realizacije. Organizacija predmeta je dosta čudna, ali nastaje u dogovoru sa studentima. Ima 4 MI po 20 bodova, te postoji \"meki\" uvjet na svakom 50% (mislim da nikome to nije bio problem). Ti MI se onda, naravno, ne poklapaju vremenski s ostalim međuispitima, tako da prvi MI možete očekivati već početkom 3. tjedna predavanja. MI se sastoje od 2 ili 3 lakša pitanja, i dosta se blago ocjenjuju. Nadalje, predmet ima 9 labosa. Za jedan labos vam treba otprilike 1 dan, uz slušanje prezentacija i pisanje pripadajućeg MATLAB koda. Termin prezentacija zapravo služi za prezentaciju labosa, a prezentacije slušate kad god želite, snimljene na stranicama predmeta. Još 2 boda koji preostaju svi dobiju. Uglavnom, na dijelove naporan predmet jer morate konstantno raditi, ali sve se to isplati odličnim ocjenama i jednim predmetom manje za vrijeme ostalih ispita. jedan od dražih labosa se sastojao od snimanja glasovnog zapisa, i njegove obrade tako da se iz grafičkog prikaza može raspoznati notni zapis. Profesori su ugodni i susretljivi, ako napišete labos na vrijeme gotovo sigurno ćete dobiti 2 boda iz labosa, ocjene su na kraju bile odlične.\n\nTežina: 6/10\n\nKorisnost: 5/10\n\nBih li preporučio/la predmet: Da\n\n**Programska potpora industrijskih ugradbenih sustava**\n\nDžapin predmet. Predmet počinje s teorijskim uvodom koji se dosta poklapa s gradivom PURS-a, zatim se nastavlja na freeRTOS (sustave za rad u stvarnom vremenu), te završava s teorijskim uvodom o Linuxu kao operacijskom sustavu za ugradbena računalna. Mi nosi 40%, ZI nosi 40%, prag na njima je 50% svaki. Po meni, ispiti su odlično napravljeni, od pitanja na zaokruživanja, crtanja state machina kako rade određeni protokoli, do tumačenja koda (što će navedeni isječak koda ispisati). Ispiti se mogu za gotovo sve bodove spremiti slušanjem predavanja, te prolaskom još jednom-dvaput kroz skripte, koje su odlične. Labosa ima 4, svaki po 5 bodova, uvjet na svaki 2.5. Izvode se neki zadatci na STM32F4DISCOVERY pločici. Tjedan dana prije labosa dobiju se upute, zadatci se riješe doma (dozvoljen rad u paru, jer je jedna pločica na dva studenta), te se u terminu labosa odgovara na pitanja desetak minuta. Za ispitivanje se najbolje spremiti čitajući uputstva za labose i ponavljanjem ključnih pojmova s predavanja. Četvrti labos je bio dosta zeznut, trebat će vam vjerojatno dva dana, pa nemojte krenuti u zadnji tren (a krenut ćete u zadnji tren, jer realno, zadnji tjedan prije ispita je uvijek panika). Ako se mislite baviti embeddedom, bilo bi dobro poslušati ovaj predmet. Također, imate usmeni na roku, tako da nemojte past.\n\nTežina: 7/10\n\nKorisnost: 9/10\n\nBih li preporučio/la predmet: Da\n\n**Digitalna obrada govora**\n\nPetrinovićev predmet. Predavanja klasik uspavanke, ne znam dal itko to može poslušati do kraja. Teorija predmeta je, realno, dosadna. Imate popis pitanja po kojima naučite za ispit, na materijalima su većinom odgovorena, naučite to par dana prije za ispit i bit će super bodovi. MI i ZI nosi svaki 30 bodova, piše se valjda dva sata, al sat vremena je dosta, blago se ocjenjuje. To je tako zato što je, kako profesor kaže, cilj predmeta samostalan rad, i tu se nalazi većinu posla. I u pravu je. Potrebno je kroz semestar riješiti domaću zadaću. Upute za domaću zadaću imaju 209 stranica, podijeljenih u 14 poglavlja. Dva od tih 14 poglavlja predstavljaju dvije laboratorijske vježbe, koje rješavate zajedno jer su malo teže od ostalih cjelina. Za pripremu izvještaja vam treba nekih tjedan dana (moje izvješće je imalo 60ak stranica), te nosi do 30 bodova. Tu se opet daju lijepi bodovi ostvariti, što je odlično, jer onda ne morate na opcionalni usmeni od 10 bodova, i zaboravljate predmet. Šalu na stranu, neka poglavlja zadaće su stvarno fora, ali nažalost, ništa nije fora u zadnjem tjednu prije ispita. Ako radite kontinuirano tu zadaću (što nećete, jer vas nitko ne tjera), mislim da čak može biti i zabavno.\n\nTežina: 4/10\n\nKorisnost: 3/10\n\nBih li preporučio/la predmet: Da\n\n**Neuronske mreže**\n\nPao sam na meme. Predmet vodi trio Lončarić, Petković i Subašić, a svi znamo što to znači: 61 bod za 2, 50% uvjet na svim aktivnostima na predmetu, na roku se brišu bodovi iz seminara i labosa, te dobivate usmeni od 50 bodova (ali je i dalje uvjet 50%). Od aktivnosti predmet se sastoji od: MI i ZI po 30 bodova, projekta od 20 bodova i labosa od 20 bodova. Labosi se pišu preko Jupyter notebooka u pythonu. Velika većina kodova vam je dana, vi ih provrtite, flippate neke parametre i zapišete opažanja. To ne nosi bodove, ali je obavezno. Ono što nosi bodove su blicevi na Moodlu, za svaki labos po jedan blic od 15ak minuta. Nadalje, projekt se radi u skupinama od pet studenata, asistenti ponude neke teme ili vi smislite svoje, te kao rezultat projekta se očekuje pdf s rezultatima i snimljena prezentacija na engleskom jeziku od 10 minuta (cijeli predmet se izvodi na engleskom). E sad, teme projekata će biti zahtjevne za prosječnog ERI-jevca, poput mene. Tek na 3. labosu se uče osnove tensorflowa, a za to vrijeme se očekuje da na projektu rješavate kompleksne probleme vezane uz neuronske mreže. Ako upisujete bez dobrog predzanja, pobrinite se da u vašem timu imate nekog s RZ-a, ili nemojte upisivati. Ispiti su također bili na Moodlu, meni je bilo dosta napeto s vremenom, i jedva sam skupio prag na ZI. Uglavnom, puno stresa oko pragova, nisam siguran da se isplati osim ako niste zaista zainteresirani za temu. A opet, ako jeste, vjerojatno ste već na RZ-u i slušali ste SU i DU, pa se opet ne isplati upisati. Ne znam za koga je predmet namijenjen. Također, prezenetacije su na dijelovima kritične, sastoje se od opskurne matematike koju nitko ne shvaća. Mislim da je previše pokušano ugurati u jedan predmet, i onda to ispadne ne baš najsretnije.\n\nTežina: 7/10\n\nKorisnost: 3/10\n\nBih li preporučio/la predmet: Ne\n\n**Poduzetništvo i izvoz u visokim tehnologijama**\n\nPredmet vode BIlas i njegova sestra. Bilas iznenađujuće ugodan na ovom predmetu. Priča nešto o poduzetništvu, ljudi koji su slušali redovito čak kažu da je bilo ok. Kroz semestar su bila 4 gosta, i ta predavanja morate slušati (ali mislim da nitko nije bio kažnjen ako nije). Od obaveza imate MI i ZI od po 30 bodova na Moodlu (nije teško), i seminar od 40 bodova. Seminar se piše u grupi od tri studenta, trebate smisliti neku poslovnu ideju i onda o njoj raspisati analizu poslovne prilike. Krajnji rezultat seminara je pdf duljine minimalno 6 stranica, te pitch od 5 minuta u kojem kolegama objasnite zašto je vaša poslovna prilika dobra. Na kraju smo svi dobili dosta dobre ocjene iz seminara, ali pripazite, oduzet će vam, realno, dan-dva. Možda postoji lakši društveni, ali u svakom slučaju, ovo je solidan izbor.\n\nTežina: 2/10\n\nKorisnost: 2/10\n\nBih li preporučio/la predmet: Da\n\nDodatak: kolega s dojmovima o INEU\n\n**Izvori napajanja elektroničkih uređaja**\n\nPredmet je joint venture Cifreka i Kroisa; Cifrek prva tri predavanja priča o električnoj mreži i baterijama (u stilu Senzorskih), dok ostatak drži Krois i priča o linearnim i prekidačkim regulatorima, korekciji faktora snage, EMI filtru, hlađenju i PCB designu izvora napajanja. Krois, osim što ga je zabavno za slušat, daje različite tips and tricks i većinu onoga što govori bit će vam korisno ako ćete ići raditi napajanje za nešto. Također, pojedini komadi gradiva se poklapaju s KEU, ali su odrađeni na bolji način, i stoga ako ste na ERIju nema razloga da ikada upisujete KEU. Primjerice, predmet vas uči da ćete u većini slučajeva kupiti gotov prekidački regulator, što, koliko se sjećam, na KEU nitko nikad nije spomenuo da uopće postoji. Materijali, nažalost, nisu najbolji i razbacani su po razno raznim PDF-ovima, skenovima papira i pametnih ploča, datasheetovima i slično. Najbolji način za učenje je, po mome mišljenju, pustiti snimku predavanja i raditi bilješke. Predmet ima dva labosa koji su se zbog korone radili od doma u LTSpiceu, neke simulacije se vrte, ništa strašno, asistent je ugodan i svi na kraju dobe sve bodove. MI ima 40 bodova i prag 20, a ZI 10 bodova (!) i prag 5. U ZI je išlo samo gradivo 2. ciklusa. Usmeni nosi 30 bodova, ja sam bio kod Cifreka, tri pitanja na papir i onda još nešto sitno pita o tome, ako ste učili sve OK, ne pita nikakve ludorije.\n\nTežina: 6/10\n\nKorisnost: 8/10\n\nBih li preporučio/la predmet: Da\n\nSada kad sam odslušao navedene predmete, mislim da sam trebao upisati INEU umjesto Neuronskih. Sve u svemu, lakši semestar nego prošli, ali ne i lagan. Ako želite raditi uz ove predmete, možda biste ipak trebali istražiti lakše opcije (npr. ne upisati ERI).",
      "votes": {
        "upvoters": [
          "JoYiSeo (Bang)",
          "Ksai8",
          "LanaRelej (Lana Relej)",
          "Svarog (Veles)",
          "Viks",
          "Widlar",
          "[deleted]",
          "ataxia",
          "helot",
          "in1",
          "rhythm_controll",
          "tekamolo",
          "zlizlek"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "spejs"
        ],
        "wtf": [],
        "tuga": []
      }
    }
  }
}