{
  "title": "[RAC] Predmeti 2. godine preddiplomskog studija",
  "creator": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
  "slug": "rac-predmeti-2-godine-preddiplomskog-studija",
  "tags": [
    "FER",
    "Op캖enito",
    "Informacije o predmetima"
  ],
  "posts": {
    "44416": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Ovdje mo쬰te podijeliti iskustva, preporuke i/ili pitati u vezi predmeta **2. godine preddiplomskog studija [u]ra캜unarstva[/u]**.\n\nUkoliko 쬰lite podijeliti mi코ljenje(a) o predmetu, mo쬰te koristiti sljede캖i predlo쬬k:\n\n```markdown\n## Ime predmeta\n\nne코to o predmetu\n\nTe쬴na: **? / 10**\nKorisnost: **? / 10**\nBih li preporu캜io/la predmet: **Da / Ne**\n```\n\n코to 캖e rezultirati:\n\n>## Ime predmeta\n\n>ne코to o predmetu\n\n>Te쬴na: **? / 10**\n\n>Korisnost: **? / 10**\n\n>Bih li preporu캜io/la predmet: **Da / Ne**\n\nNije imperativ da koristite ovakav predlo쬬k (ili bilo koji drugi), ali ovo izgleda sa쬰to i vjerujem da uz najmanji trud i najmanje tipkanja mo쬰te ponuditi lijepo formatirane informacije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45184": {
      "poster": "Sulejman",
      "content": "Jel ima bruco코a op캖e na ovom forumu lol, mislim da ne tro코im vrijeme ak nitko ovo ne캖e gledat",
      "votes": {
        "upvoters": [
          "McKovalski",
          "MiqeloS",
          "Theanko (Mirko 콯mirko)",
          "mijauexe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45294": {
      "poster": "Emma63194",
      "content": "@Sulejman#45184 Da je i samo jedna osoba ovdje bruco코, mislim da vrijedi napisati 游땏",
      "votes": {
        "upvoters": [
          "1vq",
          "Amon",
          "Filemon",
          "McKovalski",
          "Mioch",
          "MiqeloS",
          "NekocBraca",
          "Wolf7 (matrix)",
          "[deleted]",
          "djeno",
          "indythedog",
          "jarza",
          "meta",
          "mijauexe",
          "xeqte",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45297": {
      "poster": "mijauexe",
      "content": "@Sulejman#45184 ma ima def, gledat cemo kad cemo upisivat/kad prodju ispiti",
      "votes": {
        "upvoters": [
          "1vq",
          "Emma63194",
          "HeHe (Direktor 쬴vota)",
          "Tinki-Winky (Tinky Winky)",
          "jarza",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45307": {
      "poster": "McKovalski",
      "content": "@micho#44416 Implying da cu doci do druge godine...",
      "votes": {
        "upvoters": [
          "1vq",
          "mijauexe",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BrownPerson (Bambi)",
          "HeHe (Direktor 쬴vota)",
          "mijauexe"
        ],
        "wtf": [],
        "tuga": [
          "Amon",
          "Emma63194",
          "iNavy (mornar Ica)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ]
      }
    },
    "45323": {
      "poster": "djeno",
      "content": "Po코to na 2. godini nema izbornih predmeta osim dru코tvenih, pi코em za one dru코tvene koje sam ja polo쬴o. Ovo je sve  _**moje mi코ljenje**,_ ako neko od kolega misli druga캜ije nek napi코e dolje svoja iskustva sa predmetom. Ako ikoga zanima mogu napisati i svoja iskustva sa obaveznim predmetima. \n\n## Okoli코, odr쬴vi razvoj i ubla쬬vanje klimatskih promjena\n\nSasvim okej dru코tveni predmet iz kojeg se mo쬰 pokupiti lagana 4 ili 5 ako vam se da ulo쬴ti malo truda. Ja sam imao 4 dan prije predavanja sam pro코ao prezentacije i samo metodom eliminacije rje코avao ispiti i koristio bazu ve캖 odgovorenih pitanja s Moodle bliceva. Dobivaju se bodovi za prisutnost ve캖ina ljudi samo do캠e potpi코e se i ode. Gradivo je okej, mo쬰 se pone코to nau캜iti 캜ak ak vam je to volja, ali sve u svemu kao ve캖ina dru코tvenih dosta zamorno.  MI i ZI su zadaci na okru쬴vanje i mo쬰 se pokupiti siguran prolaz jer su pitanja tako jednostavna, a po코to nema negativnih bodova mo쬰te samo metodom eliminacije pogoditi to캜no. Postoje i KPZ-ovi koji se rje코avaju preko Moodle-a. 2x9 bodova. Ima dosta nakupljenih pitanja, ali kad preda코 ispit ne pi코e je l'  odgovor to캜an ili neto캜an pa su ve캖inom ljudi KPZ-ove rje코avali tak da neko objavi pitanja i poga캠a koji od njih su krivi dok se ne do캠e do 9/9 pitanja. Kad budete tra쬴li materijale za ovaj predmet tra쬴te FER3 ina캜icu jer se dosta razlikuje od FER2 ina캜ice predmeta.\n\nTe쬴na: **2 / 10**\n\nKorisnost: **2 / 10**\n\nBih li preporu캜io/la predmet: **Da**, jer sam po pri캜ama 캜uo da je IN콯EKO jako zamoran, a umjetnost novih medija se nije ni mogla upisivati kad smo mi uzimali.\n\n## Upravljanje rizikom\n\nJako sli캜no kao okoli코 samo ima vi코e posla. Isto pitalice na Moodleu samo jo코 dodatni zadaci s Case studyem. Ove godine zbog vajrusa nismo imali predavanja na faksu. Plan je bio da su predavanja obavezna i da se rade neki zadaci na faksu tijekom predavanja, a ako vam se ne da ba코 s tim zezati bolje upi코ite Osnovna na캜ela dizajna. Prezentacije su jo코 zbunjuju캖e od prezentacija s Okoli코a i nemaju ba코 korisnih informacija. Jako random predmet.\n\nTe쬴na: **4/ 10**\n\nKorisnost: **1 / 10**\n\nBih li preporu캜io/la predmet: **Ne**, ako imate mogu캖nost upisati Osnovna na캜ela dizajna. \n\n\n## Osnovna na캜ela dizajna\n\nMo쬰 se upisati i na drugoj godini, iako sam ga ja zavr코io na prvoj.  Od svih ovih predmeta najkorisniji i najzabavniji koliko dru코tveni predmet mo쬰 biti. Nakon tri predavanja nema vi코e puno korisnih informacija koje se mo쬰 pokupiti. MI i ZI su prezentacije di koristite na캜ela dizajna da objasnite za코to je taj proizvod (digitalni ili fizi캜ki) dizajniran tako. MI se predaje na Moodleu i radi se individualno, a ZI se radi u timu i izla쬰 se pred svima u velikoj dvorani. Meni je to sve bilo dosta intuitivno i najmanje zamorno od svih gore predmeta. Predaje profesor s grafi캜kog fakulteta i njegova asistentica. Poslije predavanja su labosi koji su samo dodatna predavanja 코to nekad zna biti zamorno. Prezentacije su tu samo da vam daju inspiraciju 코to 캖ete napisati i analizirati u prezentacijama za MI i ZI. Sve u svemu zabavno koliko mo쬰 dru코tveni predmt bit.\n\nTe쬴na: **2/ 10**\n\nKorisnost: **6/ 10**\n\nBih li preporu캜io/la predmet: **DA!**",
      "votes": {
        "upvoters": [
          "AromaticConfusion (VrloZbunjen)",
          "Filemon",
          "Galke",
          "Jaki",
          "Joskica",
          "Lukki",
          "McKovalski",
          "Retard00",
          "WickyWinslow",
          "__builtin_popcount (std::popcount)",
          "freshwaffle",
          "iNavy (mornar Ica)",
          "if------",
          "indythedog",
          "mijauexe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45546": {
      "poster": "BaboTrojka",
      "content": "Malo o zimskom semestru, da znaju ljudi 코ta o캜ekivat\n## Diskretna matematika\n\nMeni iskreno fora predmet, ali nekome tko nije taj 캠ir bi mogao biti masu dosadan. Labosi su free bodovi, ispituje se razumijevanje koda kojeg ima코 za odre캠ene algoritme. Sad taj kod mo쬰코 sam napravit (mo쬰 ti oduzet ne코to vremena jer bi trebao biti u toku s gradivom), ili ga mo쬰코 na캖i negdje i nau캜it 코to isto uglavnom rezultira maksimalnim brojem bodova. Tako캠er jako lagano za polo쬴t, a i dignut prosjek. Jedan majstor je imao 2/40 MI, na kraju zaklju캜enu trojku. Anamari je korektna na predavanjima, ali mo쬰 se i bez toga.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Algoritmi i strukrure podataka\n\nZalutalo na drugu godinu po mom mi코ljenju. Dosta lagan i bazi캜an predmet, labosi su isto free, dobije코 zadatke unaprijed. Meni je Boti캜ki na predavanjima bio dosadan i prespor, ne znam kakvi su ostali. Predmet se i bez predavanja lagano rije코i.\n\nTe쬴na: **4 / 10**\n\nKorisnost: **8 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Vjerovatnost i statistika\n\nPo meni najozbiljniji predmet na drugoj godini. Kombinacija Ilko, Vel캜i캖 i Elezovi캖 nam je posijala pakao na MI, 코to je ote쬬lo prolaz za dosta ljudi. Meni je Vel캜i캖 najvi코e sjeo za predavanjima, iako ima tu dosta ljudi koji se s tim nebi slo쬴li.\n\nNeki zadaci se mogu na 코ablonu rije코it, posebno dio sa statistikom. Preporu캜ujem Buri캖evu bilje쬹icu uz skriptu, ima je vjerovatno na materijalima.  \n\nTe쬴na: **7/ 10**\n\nKorisnost: **7/ 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Arhitektura ra캜unala\n\nChill predmet, stalno ima코 neke labose i bliceve 코to te tjera da bude코 relativno u toku s gradivom. Labosi se pi코u od doma kao preduvjet za izlaz, a u terminu pi코ete blic koji nosi bodove. Blicevi su dan ranije najavljeni. MI i ZI ne bih rekao da su prete코ki, na FER3 su uveli zaokru쬴vanje i negativne, ali programski zadaci uglavnom prate 코ablone starijih ispita. Kova캜 mi je skroz korektan bio kad sam isao na faks. I knjiga i prezentaciju su dosta dobro napravljene, tako da se mo쬰 i sve od ku캖e. \n\nTe쬴na: **5 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Teorija informacija\n\nSkupi na meduispitu kolko god mozes (idealno 30+), inace si fasovo\n\n\nSad ozbiljno, po FER3-u racunarstvu se ne obra캠uje Fourier koji 캜ini dobar dio gradiva na TINF-u. Pretpostavljam da 캖e se ne코to po tom pitanju promijeniti u budu캖nosti, ali ako ne bude, ra캜unajte barem 2 3 zadatka da na zavr코nom odmah prekri쬴te. Mislim da je prag 40 bodova, nemojte da vas to zavara. Kao sto rekoh, meduispit je po mom mi코ljenju lagan i potegnite kolko se mo쬰, ina캜e 캖e vas Ba쬬nt pojesti. Kolko sam 캜uo, rok je tako캠er dosta nezgodan. Na predavanjima su Ili캖 i Ba쬬nt vi코e nego korektni dok se ne do캠e do Fouriera.\n\nNemojte slat glupa pitanja Ba쬬ntu, ima majstor kratak fitilj.\n\nTe쬴na: **7 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Ne**\n\n## INZEKO 1\n\nNajnizu ocijenu taj semestar sam upravo imao iz Inzeka. Doduse, ulozio sam sveukupno 2 3 sata u taj predmet. Predavanja su u zavisnosti od predavaca obavezna. Prof. Vranic je imala Moodle pitalice da provjeri prisutnost sto znaci da jedna osoba mo쬰 rje코avati za vi코e ljudi. Dovoljno za pojavit se jednom u 3 4 tjedna na predavanju. Nama su slozili uzasno lagan MI i uzasno tezak ZI tak da bi ipak trebalo ne코to vremena ulo쬴t u to. \n\nTe쬴na: **2 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporu캜io/la predmet: **Ne**\n\nSve u svemu dosta okej semestar, lak코i je od idu캖eg. \n\nTo je moje kratko mi코ljenje, isao sam sve kontinuirano na ocijenu, tako da nemojte uzimati neke stvari zdravo za gotovo.",
      "votes": {
        "upvoters": [
          "1vq",
          "Aa-Kilotee",
          "Amon",
          "Dome",
          "Goliathus",
          "Kennedy",
          "Lenobius",
          "Retard00",
          "Vonj",
          "WickyWinslow",
          "boban_rajovic (ravindrababu ravula)",
          "djeno",
          "gladiator",
          "iNavy (mornar Ica)",
          "if------",
          "indythedog",
          "macaklin",
          "mijauexe",
          "nnn (dinoo)",
          "stalak-za-lakat (stalak za lakat)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45583": {
      "poster": "djeno",
      "content": "@BaboTrojka#45546 \n\n> @BaboTrojka#45546 Zalutalo na drugu godinu po mom mi코ljenju. Dosta lagan i bazi캜an predmet, labosi su isto free, dobije코 zadatke unaprijed. Meni je Boti캜ki na predavanjima bio dosadan i prespor, ne znam kakvi su ostali. Predmet se i bez predavanja lagano rije코i.\n\nVelike preporuke odite na predavanja profesora Jagu코ta.",
      "votes": {
        "upvoters": [
          "1vq",
          "Fica (Prof)",
          "JeleeII",
          "McKovalski",
          "MiqeloS",
          "Vonj",
          "haworthia (bulrog)",
          "meta",
          "neksi (filip)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "46209": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "# Zimski semestar\n\n## Algoritmi i strukture podataka\n\n>! Ovaj predmet se navodno malo izmijenio otkad sam ga polagao. Sad se radi ne코to sitno C++, ali naravno, sve je to jadno i neprimjereno uop캖e spominjanju C++-a. Meni je bio kul prof. 말ki캖. Jako pristupa캜an, dovoljno detaljan, uvijek je bila dobra atmosfera kod njega. Dosta lagano su se mogli dobiti bodovi iz predavanja. Ono 코to je bitno kod ovog predmeta je dobro napisati labose. U principu, me캠uispit je lagan ako se kontinuirano radi. Optimalna taktika je rasturiti me캠uispit jer kasnije dolaze te쬰 stvari, a prva polovica je dosta lak코a od 2. Predmet su코tinski nije te쬬k - jedan je od lak코ih. Ali nije kao da nema za raditi.\n\n> 맚o se ti캜e korisnosti, ovo su temelji programiranja i trebaju vam i da vas netko probudi u pola no캖i. Mo쬯a teorija grafova malo manje (iz razloga 코to se to vi코e obra캠uje na drugim predmetima, i bolje), ali sortiranja i strukture vam svakako trebaju.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **8 / 10**\n\n----\n\n## Arhitektura ra캜unala 1R\n\n>! Mi nismo imali ni코ta druk캜iju Arhitekturu ra캜unala od struji캖a, ali mislim da se za ra캜unarce nije znatno promijenila. Kod ovog predmeta je IMPERATIV da sami radite labose. Bez samostalno odra캠enih labosa ulazite u cca 6. krug pakla beskona캜nim rje코avanjem zadataka iz zbirke. Ako samostalno rije코ite labose, onda vas 캜eka max 2. krug pakla. Predmet je su코tinski lagan - ono 코to je te코ko je razmi코ljati na tako niskom nivou apstrakcije. Ono 코to ljudi ne shva캖aju na ovom predmetu je da si mo쬰te dozvoliti manje gre코kice - svaka linija koda dosta malo toga radi, pa su gre코kice manje utjecajne. Jedini je problem 코to su asemblerski jezici toliko jednostavni da nikad ne bi trebali imati sintaksnu gre코ku, eventualno logi캜ku. U캜estalost takvih gre코aka opet ovisi o tome koliko je razvijeno razmi코ljanje neke osobe.\n\n> Ne znam kakva je raspodjela profesora, no kad sam ja polagao ovaj predmet, prvo sam bio kod Hoffmana, koji me usprkos trudu nije uspio zainteresirati za predmet, a onda sam oti코ao kod prof. Bosni캖 koja me o쬴vila i onda mi je bilo 쬬o 코to nisam cijelo vrijeme bio kod nje. Toplo preporu캜am.\n\n> 맚o se ti캜e korisnosti - ovisi 캜ime 캖ete se baviti. Na PPJ se npr. u zadnjem labosu te쬰 ina캜ice prevodi kod sli캜an C-u u FRISC. FRISC sam po sebi nije toliko koristan, a nije ni ARMv7. Ali kao neki uvod u asemblerske jezike je tako ne코to potrebno. Puno bih ra캠e da su nas u캜ili x86 asembler jer bi nam to pomoglo oko puno stvari u 쬴votu, ali za x86 asembler vjerojatno treba jedan cijeli predmet.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **6 / 10**\n\n----\n\n## In쬰njerska ekonomika (1 i 2)\n\n>! Ovo su sada odvojeni predmeti. Ovaj predmet **mo쬰** biti koristan. To dosta ovisi o vama, koliko 캖ete raditi. Me캠utim, predmet sam po sebi nije koristan. Ne캖e vas natjerati da nau캜ite neke relevantne stvari. Dobro je 코to je razlomljen - sad je mogu캖e detaljnije obra캠ivati neke stvari, ali predava캜i na ovom predmetu znaju biti toliko dosadni, a i provjera pristustva je retardirana...\n\n> Da ne govorim da sam skoro popu코io sve bodove iz prisustva jer je moj preuranjeni odgovor na krivu pitalicu bio detektiran kao poku코aj prevare, pa sam trebao gnjaviti 2 od 8 kolega koji su bili na predavanju (ne pretjerujem, jer sam bio na tim predavanjima pa sam mogao vidjeti) da mi izjave da sam bio na predavanju tad i tad. Sad kad gledam, to je bilo malo poni쬬vaju캖e, jer je problem bio kod njih, a ne kod mene.\n\n> Bio sam kod prof. Vrani캖, i ona je okej predava캜. Vidio sam predavanja kod prof. Malari캖a i to je za mene bila smrt. Bio sam par minuta na predavanju kod prof. Tom코i캖a ali ne dovoljno dugo da steknem dojam, po broju ljudi rekao bih da je bio okej ali nemojte me uzeti za rije캜.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **? / 10** (koliko se potrudite za predmet, mo쬰 biti doslovno **0 / 10**)\n\nBih li preporu캜io predmet: **Ne** - Okoli코 je lak코i, zanimljiviji predmet, a meni je bio i korisniji.\n\n----\n\n## Okoli코, odr쬴vi razvoj i ubla쬬vanje klimatskih promjena\n\n>! Imao sam ovaj predmet bez ovog zadnjeg dijela. Predava캜i se rotiraju tako da nemate jednog (barem je tako bilo kod nas), i iako je ve캖ina dosadna, meni je prof. Debrecin bio dosta dobar. Ja sam polagao ovaj predmet dok je jo코 bio seminar, i to je bio lagani prolaz - samo dobro napravi seminar. Na kraju smo 캜ak i prezentirali na코 seminar kao jedan od boljih, iako je u njemu bilo dosta neto캜nih informacija (ne nu쬹o na코om krivicom, puno tog je krivo na netu, a malo je informacija). Prilikom izrada tog seminara sam dosta nau캜io.\n\n> Ne mogu re캖i da mi je predmet bio jako koristan, jer ono, ne koristim znanje tog predmeta za svoju korist trenutno, ali bar sad znam neke \"fun factove\" i dosta o nuklearnom otpadu (jer smo na tu temu radili seminar). Mislim da se iz ovog predmeta mo쬰 jako puno izvu캖 ako se razgovara s predava캜ima, jer oni su stvarno spremni objasniti ne코to. Zapravo je 캜udno da tako mrtav zavod ima tako 쬴ve predava캜e. Ve캖inu ljudi nije briga za te stvari, ali ljude koje je briga, koji iz toga mogu iscrpiti dobro znanje, njima 캖e ovaj predmet definitivno biti koristan.\n\nTe쬴na: **3 / 10**\n\nKorisnost: **? / 10** (koliko se potrudite za predmet, ali rekao bih od **3 / 10** do **6 / 10**)\n\nBih li preporu캜io predmet: **Da**, dobra alternativa In쬰njerskoj ekonomici\n\n----\n\n## Teorija informacije\n\n>! Ah yes, strah i trepet FERovaca kampanjaca. Na ovom predmetu studenti imaju priliku nau캜iti da se uvijek treba truditi oko me캠uispita a ne odga캠ati lov na bodove za zavr코ni. Ja sam ovaj predmet imao uz prethodno znanje Fouriera i Laplacea, ali je fora u tome 코to ga nisam imao prethodno znanje ViS-a, a Fouriera i Laplacea, iako sam volio, nisam ba코 ne코to znao primijeniti.\n\n> Ono 코to je meni fascinantno je koliko je ovaj predmet lagan, a koliko problema stvara ljudima. Ja nisam nikakav lumen, a pro코ao sam predmet bez ijednog rije코enog zadatka izvan ispita. Puno sam razmi코ljao o tome i na kraju do코ao do zaklju캜ka da se ljudi overhajpaju za ovaj predmet. Da, i mene je bilo trta da ne dobijem -50 na ispitu. Ali stvar je u ovome - zadaci na ispitu nisu nekarakteristi캜ni. Na ispit mo쬰 zalutati ne코to te쬰, ali to nije palo s Marsa. Ako je netko pro코ao kroz sve tipove zadataka ne bi trebao imati problema. VIS u ovom predmetu uop캖e nije ne코to te코ko. Entropija kao pojam je jedna jako logi캜na stvar. Linearna algebra je iznimno elementarna, a i SiS u ovom predmetu je dje캜ji. Ali da, ovaj predmet treba pro캖i na MI. Ili ono, usprkos tome 코to je 2. dio novo gradivo, ne srati da nema코 podlogu za to, nego ga nau캜iti. I normalno, treba se opustiti, ali to vrijedi za svaki predmet.\n\n> Ina캜e sam slu코ao predavanja kod Ba쬬nta i to je bio svojevrstan show, i mo쬯a bi ih opet i코ao slu코ati da imam vremena i da nisam upravo ono 코to profesor mrzi - mediokritet. Ali eto, produljio sam si godinu pa 캖u sljede캖e i preksljede캖e imati vremena malo urlati u zadnjim klupama.\n\n> 맚o se ti캜e korisnosti, ovaj predmet je ina캜e jako koristan, ali je to suptilno. Teorija informacije je zapravo klju캜na za bilo kakvu obradu podataka. Ona nije neizostavna, u smislu da bez nje stvari ne rade, ali na lijep na캜in obja코njava relativno apstraktne fenomene u prirodi. Ono, nije jako komplicirana, a dosta toga ti govori.\n\nTe쬴na: **4 / 10**\n\nKorisnost: **6 / 10**\n\n----\n\n## Vjerojatnost i statistika\n\n>! O ovom predmetu ne캖u previ코e pri캜ati jer je znatno izmijenjen otkad sam ga zadnji put polagao, ali jedna preporuka - iako su materijali za predmet prili캜no dobri, na internetu ima isto tako dobrih materijala koji mogu dosta pomo캖i ljudima koji znaju engleski.\n\n> Predmet je potreban i dalje na studiju, ali ne ba코 direktno, i obi캜no se potrebni pojmovi ponove na predmetu koji treba ne코to iz VIS-aa.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **7 / 10**",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124",
          "macaklin",
          "meta",
          "mijauexe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "46277": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "# Ljetni semestar\n\n## Baze podataka\n\n>! Ovo je najgadniji predmet na 4. semestru. Baze podataka kao gradivo nisu zapravo te코ke. Problem je 코to ZPR to sve zapapri. Da ne komentiram pristup koji mislim da je po meni glup, komentirat 캖u ono za코to je ovaj predmet glup. Prva stvar - 코trebanje SQL-a, totalno idiotski. Jezika za upravljanje bazama podataka ima mnogo, mi smo u캜ili (i trenutno se u캜i) upravljanje PostgreSQL-om. U stvarnosti, pgsql je samo jedan od mnogih alata. Snaga pgsql-a zapravo uop캖e nije u tradicionalnim relacijskim bazama kao 코to se u캜e na predmetu, ve캖 u tome 코to je to hibridan alat. No dobro.\n\n> Ovaj predmet se prolazi tako 코to se nakupe bodovi na MI i na labosima i onda se na zavr코no drka pimpa캜. Stvar je u ovome - 코trebanje SQL-a je daleko lak코e nego apsolutno savr코eno repliciranje postupka za neki ne-SQL zadatak. Najve캖i razlog za코to je ovaj predmet te쬬k je zato 코to su na ispitu bodovi jako binarni - obi캜no je slu캜aj da zadatak nosi recimo 8 bodova, a mogu캖e je dobiti 0, 1 ili 8. U puno zadataka uop캖e nema neke sredine, ili je jako te코ko dobiti srednji broj bodova. Ovo je po meni super glupo jer se kod puno zadataka dogode sitne gre코ke koje bi se u realnom slu캜aju jako lagano ispravile. 캛ini mi se kao da se na predmetu poti캜e bezumno 코trebanje sintakse i postupaka takvim bodovanjem. Najgore je 코to se dosta ljudi na캠e u situaciji da im fali pol bodova za prolaz, i onda do캖i na te uvide samo da ti ispravlja캜 ka쬰 \"A jbg tu si zaboravio jedan korak ima코 1/8\" i mora코 na rok zna dosta demotivirati ljude.\n\n> Isto tako, iako ne mislim da su rokovi ne코to stra코no te코ki, vjerojatno jesu malo te쬴. Kao 코to sam rekao, zada캖e, tj. labosi vam mogu dosta olak코ati prolaz. Na roku generalno nema vremena i onda vas jo코 mogu naguziti na usmenom koji iz razgovora s drugim kolegama i uz vlastito iskustvo (jer sam pao predmet kontinuirano) i nisu previ코e fer. Svaki profesor ima druge kriterije i bodovanje je po osje캖aju, ne po bodovima koje ste dobili rje코avaju캖i zadatke na papiru.\n\n> 맚o se ti캜e korisnosti, da, ovaj predmet je koristan. Ne bih rekao da je pretjerano koristan radi na캜ina na koji se obra캠uje (u praksi se ne rade monstruozni queryji nego se obi캜no povuku podaci pa se obrade u ekspresivnijim jezicima), ali sam koncept je koristan.\n\nTe쬴na: **6 / 10**\n\nKorisnost: **6 / 10**\n\n----\n\n## Komunikacijske mre쬰\n\n>! Dosta fora predmet na kojem je mogu캖e ni코ta ne nau캜iti. Iako su prezentacije okej i ve캖ina predava캜a je okej, tog ba코 nema za vrijeme corone hahaha. Kod ovog predmeta nema ba코 ne캜eg posebnog. Rije코ite labose i polaganje predmeta bi trebalo biti lagano. Predmet nije zahtjevan, jedino se pisanje priprema mo쬰 malo oduljiti.\n\n> Meni recimo i nije toliko koristan predmet - ne koristim to 코to se na predmetu u캜i, ali definitivno vidim za코to smo ovo imali. Najve캖u stvar koju sam shvatio na predmetu je da je internet govno ali da je i to govno najbolje 코to imamo.\n\nTe쬴na: **4 / 10**\n\nKorisnost: **5 / 10**\n\n----\n\n## Operacijski sustavi\n\n>! Meni osobno jedan od ljep코ih predmeta, ali ja sam pristran :)\n\n> Predmet kao i mnogi na ovoj godini nije koristan direktno - rade se koncepti na niskom nivou apstrakcije, ve캖ina modernih alata to zaobilazi. Me캠utim, na코ao sam se na poslu u situaciji gdje mi je predmet bio koristan. I nije kao da mi je bio koristan samo radi teorije - ne, automatski sam primijenio to znanje. Predmet **mo쬰** biti te쬬k, ali generalno nije. Mislim da dosta te쬴ne na ovom predmetu donose scenariji kad netko ne ide na predavanja ili ne pohvata sve na predavanju. Onda treba i캖i rije코avati zadatke u knjizi nakon kojih im opet mo쬯a nije sve jasno. Ono 코to najvi코e ko캜i ljude na ovom predmetu je katastrofalno poznavanje C-a. I ljudi umjesto da koriste neki jezik koji mo쬯a bolje poznaju, npr. Javu ili Python, nastave 코lampavo koristiti C, mo쬯a zato 코to im se ne da nau캜iti ne코to novo, mo쬯a zato 코to se boje da im ne bi bio priznat labos, i onda tro코e puno vremena na usvajanje gradiva s pokaziva캜ima. U stvarnosti, ovi labosi su taman - niti prelagani, niti prete코ki. Samo ono 코to se dogodi je da previ코e ljudi pro캠e Uvod u programiranje, a ne zavre캠uju to.\n\n> Bio sam na jednom Golubovom predavanju i Jelenkovi캖evom predavanju, iako cijenim profesora Goluba jer je stvarno sjajan, bila su mi bolja Jelenkovi캖eva predavanja. Nisam siguran za코to, ka쬰m, mo쬯a sam pristran :) , ali mislim da je zato 코to je prof. Jelenkovi캖 isto kvalitetan profesor, samo je kod njega uvijek bila ti코ina i on jako voli pokazivati stvari na koje bi trebale paziti umjesto nekakvog generalnog predavanja.\n\n> Kao 코to sam ve캖 spomenuo, predmet **je** koristan. Ali ne캖u mu dati tako visoku ocjenu korisnosti jer se u praksi stvarno jako rijetko programira paralelno, a i kad se to radi, obi캜no se uzimaju gotovi, superoptimizirani algoritmi.\n\n> E i da, navodno je rok grozan, pa to svakako izbjegnite.\n\nTe쬴na: **4 / 10** - **6 / 10** (ovisi o tome kako pratite i idete li na rok)\n\nKorisnost: **5 / 10**\n\n----\n\n## Upravljanje kakvo캖om\n\n>! Prvo 코to 캖u re캖i je da sam stvarno htio u쬴vati u ovom predmetu. Ne zato 코to sam cuckvo캖a cuck, nego zato 코to sam kroz cijeli faks jako pazio na to캜nosti i preciznosti, jako me fasciniralo sve to. Ali onda sam oti코ao na par predavanja i pao u jako veliku depresiju. Predavanja su ozbiljna, stvarno jesu. Drago mi je da postoji predmet na faksu koji bezbo쬹ike nau캜i da kilobajt nije 2^10 bajta, ve캖 10^3 bajta. Ali nije mi drago 코to se jako puno potencijala na predmetu prosulo.\n\n> Dosta kolega je 캜ak palo ovaj predmet, imalo ponovni upis. Predmet nije te쬬k, ali ga je stvarno lako past, zbog pragova.  Pro코lo je 2 godine otkad sam ga imao, ali i dan danas se sje캖am svojeg izraza lica kad mi je u menzi frend rekao da ne trebam 20 bodova (koliko mi je trebalo za prolaz), ve캖 da je prag 25. Sre캖om, imao sam taman 25, ali svi ostali prijatelji iz generacije, to캜no se sje캖am, svi smo bili u jednom stanu, su taj dan pali. I to su bile takve nijanse, prakti캜ki samo nisu pro캜itali ili zapamtili 1-2 pitanja koja sam ja pro캜itao i zapamtio.\n\n> Uglavnom, predava캜i su svi otprilike isti, nitko mi se nije previ코e svi캠ao jer je predmet sme캖e IMO, predmet se prolazi 코trebanjem sakupljenih pitanja, samo treba dolaziti na predavanja tu i tamo i to je to. Iskreno da sam imao izbor, ne bih upisao ovaj predmet.\n\n> Ono 코to sam nau캜io mi je bilo malo korisno, ali ne previ코e. Bilo bi mi jako drago da su nas R-ovce nau캜ili R-ovske stvari, a ne nam samo dali gotovo identi캜an predmet kao i E-ovcima, samo ECTS manje.\n\nTe쬴na: **3 / 10**\n\nKorisnost: **3 / 10**\n\nBih li preporu캜io/la predmet: **Ne**\n\n----\n\n## Uvod u teoriju ra캜unarstva\n\n>! Ovo je predmet koji prestra코i puno ljudi, ali zapravo je jedan od boljih predmeta ovaj semestar. Koja je kvaka? Paaaaaaaaaaa, ljudi koji intuitivno sku쬰 ovaj predmet imaju jako veliku prednost nad onima koji vide samo hijeroglife. Automati koji se u캜e na predmetu su stvarno jednostavni. Zadaci su 코ablonski, ma sve je to 코ablona. Postoji puno labosa na materijalima, ja bih rekao ni jedan dostojan da bude THE LABOS. Mo쬯a to popravim ovo ljeto, ako 캖e mi se dati, meni je to zgodna vje쬭ica. Ali ono 코to ho캖u re캖i time je da je stvarno lako raditi gre코ke na ovom predmetu, uglavnom ih ni ne sku쬴te. Ali jednom kad popravite sve te malo gre코kice, predmet je stvarno super lagan.\n\n> Ono 코to je sjebano su materijali. IMO ne vrijedi i캖i na predavanja, osim ako ste neki lumen pa lovite bodove kod 캟ereka, prezentacije su shit, knjiga je shit. Va코i prijatelji su auditorne (u쬴vo) i knjiga koju je Srblji캖 prepisao, 캜ini mi se da je [ovo](https://www.amazon.com/Introduction-Automata-Theory-Languages-Computation/dp/0321455363). Isto tako, vrijedi nabiti bodove na labosima i na MI. Labosi di쬿 ocjenu, nabijanje bodova na MI vam daje prostora za disanje na ZI. Isto tako, labose je mogu캖e rije코iti unaprijed, tako da ste dosta fleksibilni s vremenom.\n\n> Ovaj predmet, kao 코to sam rekao **nije** te쬬k. Ono 코to ga ote쬬va je nerazumijevanje gradiva na koje se drugo gradivo nastavlja, i zato je va쬹o razumjeti gradivo kontinuirano, bez rupa, i ako ba코 ne mo쬰te pohvatati sve, dajte barem pohvatajte DKA i mo쬯a PA, pa to izvje쬭ajte.\n\n> Je li predmet koristan? Ako 캖ete upisati PPJ, neizostavan je. Ako ne캖ete, a, opet je pitanje 캜ime se mislite baviti. Ja sam inicijalno mislio da 캖u postati bolji ra캜unarac - to se nije dogodilo. Ono 코to se je dogodilo, dodu코e, je da sam bolje nau캜io regularne izraze, one pro코irene, programske. Jako puno ljudi mrzi regularne izraze, ali meni su ba코 ugodni - tako da mo쬯a mi i nisu bili toliko korisni koliko su me promijenili.\n\nTe쬴na: **4 / 10**\n\nKorisnost: **6 / 10**",
      "votes": {
        "upvoters": [
          "Filemon",
          "Galke",
          "InCogNiTo124",
          "Jakic007",
          "Sans",
          "lup",
          "macaklin",
          "mijauexe"
        ],
        "downvoters": [
          "Sulejman"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "47574": {
      "poster": "gladiator",
      "content": "Ovo su moji osobni komentari i dojmovi o **zimskom semestru**\n\n**Diskretna matematika 1**\n>!Fora predmeti캖. Prvi se ciklus obra캠uju redovi malo detaljnije nego na Matan2 i rekurzije. Rekurzije se rje코avaju na sli캜an na캜in kao i diferencijalne jednad쬭e pa tu ne bi trebalo biti nikakvih problema. Drugi se ciklus obra캠uje teorija grafova i radi se o malo \"elegantnijoj\" matematici. Neki 캖e odmah vidjeti rje코enje, a nekima 캖e trebati vrijeme da to pohvataju. Sve u svemu, nije prete코ko. Slu코ajte Naki캖ku i 캜uvajte se Kilasse. Tu su zada캖e koje nose 5 free bodova, a tu su i labosi koji nose 15 bodova.\n\nU labosima treba nakucati neki algoritam na grafovima 코to zaista nije te코ko. Odabirete programski jezik i udri. Mo쬰 biti zanimljivo jer sami odabirete pristup zadatku.\n\nCilj je sakupiti 45 bodova prije zavr코nog koji nema prag tako da se mo쬰te posvetiti u캜enju drugih stvari.\n\nTe쬴na: 4/10\n\nKorisnost: 6/10\n\n**Arhitektura ra캜unala 1R**\n>!Na po캜etku je malo zbunjola, pogotovo prvi labos dok se ne ufurate u asembler. Nakon toga nije ni코ta posebno.\n\nPazite se labosa i nemojte si priju코titi 0 bodova, a pogotovo ne -2 boda. Mi smo radili u puppy atlasu 코to je bila katastrofa kao takva, ovaj noviji sparc je navodno puno bolji.\n\nPostoje blicevi i sve to 코to vas tjera da radite kontinuirano. Mo쬰 se skupiti vi코e od 50 bodova prije zavr코nog koji nema praga 코to vam opet omogu캖ava da vi코e vremena posvetite drugim predmetima.\n\nTe쬴na: 5/10\n\nKorisnost: 4/10\n\n**Algoritmi i strukture podataka**\n>!Redundantan predmet. Cijelo se ovo gradivo ve캖 obradilo i koristilo na OOP-u (osim implementacije sortiranja) ili na diskretnoj. Za labose dobijete tipa 15 zadataka od kojih jednog morate replicirati na samom labosu.\n\nZavr코ni 캜ini 50% kucanja koda i 50% nekakvog crtkaranja. ZPR i dalje ne odustaje od svojih pragova tako da postoji i prag na zavr코nom.\n\nTe쬴na: 3/10\n\nKorisnost 3/10\n\n**Vjerojatnost i statistika**\n>!E sad... tu kre캖u problemi. Na po캜etku ovog predmeta bacate nekakve kockice i izvla캜ite karte iz 코pila, ali nemojte da vas to prevari. Predmet preko no캖i postane jako hc i lako se pogubiti, pogotovo nakon me캠uispita. Pomo캖 캖ete tra쬴ti u Elezovi캖evoj knjizi, ali bez konteksta s predavanja ne캖ete daleko do캖i. Pratite nastavu kontinuirano i ako izgubite nit, poku코ajte se zbrojiti - kontinuirani prolaz predmeta je povoljniji od rokova. Tu je i netrivijalni KPZ iz statistike koji nosi 10 bodova i ti bodovi ostaju s vama do polaganja predmeta.\n\nStari ispiti nisu od prevelike koristi jer su ispiti kao takvi dobili facelift na FER3 programu.\n\nMe캠uispit nam je bio monster, ali to su nadoknadili lak코im zavr코nim\n\nTe쬴na: 9/10\n\nKorisnost: Nisam do코ao dovoljno daleko da znam/10\n\n**Teorija informacije**\n>!Glavna svrha ovog predmeta je poticanje kreativnosti kod izrade parodija i generiranja sadr쬬ja za najo캜ekivaniji film godine: \"Upisao si krivi faks vol 2\" i kasnije \"Upisao si krivi faks vol 3\" itd. Va코a 코ansa za prolaz se drasti캜no smanjuje ako se u generaciji zatekne osoba koja voli animirane filmove.\n\nAko se uhvatite u ko코tac s predmetom i odlu캜ite ga zaista nau캜iti, oduzeti 캖e vam poprili캜no puno vremena. Kad bacite prvi pogled na zadatke ne캖ete znati koji se jebeni kurac zbiva. No polako se sve to mo쬰 dekodirati i savladati.\n\nMoj savjet ako 쬰lite samo pro캖i predmet je dobro nau캜iti za MI i dobiti 25 ili 30 bodova tako da zavr코ni bude manje stresan.\n\nTu je i \"\"\"labos\"\"\" kao uvjet za prolaz koji se svodi na to da jedna osoba rje코ava, a ostali navijaju.\n\nIdite kod Ili캖a na predavanja. Lik bolesno dobro pi코e po plo캜i i s vremena na vrijeme okine neku foru da malo digne atmosferu. Nastava mu je dobro organizirana i gradivo koje on ispredaje bude kristalno jasno. Zadnji sat prije MI/ZI odr쬴 auditorne koje su _life saver_.\n\nNije 코ala, zaista se isplati i캖i na ocjenu ve캖u od 2. Kada rije코ite odre캠eni dio zadataka iz zbirke shvatit 캖ete da je zapravo jednostavno. To je jebeni eureka moment - probudite se jedno jutro nakon maratona rje코avanja tinf-a i shvatite da niti jedan zadatak, niti jedan problem nije nerje코iv... Kako na ovom predmetu, tako i na ViS-u s kojim 캖ete paralelno voditi rat.\n\nTe쬴na: 8/10\n\nKorisnost: 10/10",
      "votes": {
        "upvoters": [
          "1vq",
          "HARAmara (decko_sa_balkana)",
          "Kaladonter",
          "KingGeedorah (King Geedorah)",
          "McKovalski",
          "PikachuOnAcid (Kaneki kun)",
          "iNavy (mornar Ica)",
          "indythedog",
          "macaklin",
          "meta",
          "mijauexe",
          "steker",
          "turunturu (Cement)"
        ],
        "downvoters": [
          "sheriffHorsey"
        ]
      },
      "reactions": {
        "haha": [
          "Dome",
          "InCogNiTo124",
          "McKovalski",
          "Svarog (Veles)",
          "awi (캠usi)",
          "djeno",
          "ivicato",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "49702": {
      "poster": "Rene",
      "content": "Evo ukratko moj cjelokupni dojam o drugoj godini.\n## Zimski semestar\n## Algoritmi i strukture podataka\n>!Puno bi korisniji bio da je na prvoj godini, nakon polo쬰nog OOP za ve캖inu studenata je ovaj kolegij dosta jednostavan.\n\nNe캖u re캖i da je beskoristan s obzirom da se prvi put u okviru nekog predmeta \"slu쬭eno\" rade sortiranja, liste, hash i sli캜ne stvari, ali ve캖ina se s time ve캖 susretala i prije tako da je meni osobno bio poprili캜no dosadan predmet.\n\nNa preporuku nekog kolege s foruma sam i코ao na predavanja prof. Boti캜kog (opisao ih je kao \"jedna od najboljih\" na faksu ako se ne varam), ali mene se nije dojmio. Kao osoba izgleda jako pozitivan i ugodan, znao je napraviti quirky 코etnju po dvorani u pauzi i random popri캜ati sa studentima, ali jako sporo predaje i tro코i dosta vremena na crtanje po plo캜i (iako to nosi dosta bodova na ispitima, pa u jednu ruku mo쬰 biti i korisno). Jednom ga je zamjenio prof. Jagu코t i puno vi코e mi je odgovarao njegov stil predavanja pa bih ja osobno njega preporu캜io za predavanja.\n\nTe쬴na: **3 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: Nemate izbora, pa eto neka bude **Da**\n\n## Arhitektura ra캜unala 1R\n\n>!Iako me u na캜elu ne zanima tematika ovog kolegija, bio mi je sasvim ugodan i ne previ코e zahtjevan, a nije ni lo코e nau캜iti neke osnovne koncepte iz arhitekture ra캜unala.\n\nAsistenti i prof. Kova캜 su mi imali pozitivan vibe, i uglavnom sam i코ao na predavanja da ne moram sam prolazit kroz knjigu. Dobra je stvar 코to su predavanja skoro 1/1  preslika knjige tako da ako vam se neda na predavanja, mo쬰te komotno presko캜iti i sami u캜iti, knjiga je dosta razumljivo napisana. Svidilo mi se 코to su ispiti uglavnom rje코avanje zadataka i unato캜 tome 코to asembler nije ne코to 코to me zanima, bilo mi je *doz dobro* rje코avat te zadatke. Ako vam se da, pro캠ete zbirke zadataka i prakti캜ki znate svaki tip zadatka koji se mo쬰 pojaviti.\n\nTe쬴na: **4 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Diskretna matematika 1\n>!Jako volim matemati캜ke predmete i dobro mi idu pa mi je ovaj kolegij bio super, ako vas matematika ba코 i ne zanima mogao bi vam biti naporan. Na po캜etku se radi malo kombinatorike i rekurzije, ali ve캖ina kolegija se bavi teorijom grafova. Gradivo nije ba코 trivijalno, ali bar ove godine ispiti nisu bili te코ki i ako se ne varam prosjek generacije je bio dosta visok. Iskoristio bih ovu priliku da preporu캜im profesora Kova캜evi캖a kojeg koliko sam primjetio ljudi dosta izbjegavaju, i nakon pro캜itanih dojmova na fer2net kad sam ga dobio u drugom semestru na MATAN2 sam bio poprili캜no siguran da 캖u se morati prebaciti negdje drugo. Priznajem, treba se naviknuti na njegov stil predavanja i pa쬷jivije slu코ati jer dosta tiho predaje, ali meni je bio odli캜an i kao profesor i kao osoba (very wholesome) i nakon MATAN2 sam oti코ao na Diskretnu u njegovu grupu iako sam bio slu쬭eno kod prof. Naki캖 (kod nje je bila jako velika gu쭀a, a osobno mi je vi코e odgovarao Kova캜evi캖). Tako da savjetujem da ne slu코ate ba코 slijepo tu캠e dojmove nego i sami provjerite koji vam profesor odgovara, jer to 코to nije popularan ne zna캜i da nema znanja ni kvalitete.\n\nTe쬴na: **5/ 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Teorija informacije\n\n>!Tematika me opet nimalo ne zanima, bio sam dodijeljen u grupu prof. Pand쬴캜a. Predavanja su bila u 8 ujutro tako da sam od toga odmah odustao, pa sam nakon nekoliko tjedana zbog memea krenuo s kolegicom kod Ba쬬nta. Iskreno, njegovi rantovi postanu repetitivni i zna nekad bit dosadan, ali ipak je ikona FER-a i fora je do쬴vit takvog lika na faksu. 맚o se ti캜e njegovog predavanja, mogu re캖i da 캜ovjek zapravo dobro objasni to gradivo i bez problema sam pro코ao kontinuirano zbog toga. Tako캠er, zadaje zada캖e na predavanjima i svaka nosi 10 bodova (ne skalira se, doslovno 10 bodova) ali samo prvih nekoliko s originalnim rje코enjem dobije bodove - ne budu te코ke a nose stvarno puno bodova.Shva캖am da mo쬰 biti malo te쬰 pohvatati predmet ako ne ide코 na predavanja i ostavi코 za zadnji 캜as, ali 코to je tu je. Koncept ispita na zaokru쬴vanje gdje su jedine opcije -2/0/5 bodova mi je u쬬san, ali to je tako i nema smisla se previ코e 쬬liti nego ili sjest nau캜it ili se nadat da te potrefe zadatci. Sve u svemu, rekao bih puno ve캖i hype nego 코to zapravo je i kolegij bih opisao vi코e kao *캜udan* nego te쬬k.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **3 / 10**\n\nBih li preporu캜io/la predmet: Opet, nemate izbora, ali neka bude **Ne**\n\n## Vjerojatnost i statistika\n\n>!Na po캜etku vas gradivo mo쬰 zavarat, pogotovo ako znate ne코to kombinatorike izlgeda dosta lagano - bacanja kockica, izvla캜enja karata, ali brzo eskalira. Ako bih jedan predmet preporu캜io da se prati ba코 kontinuirano bez da vam se nagomila, onda je to sigurno VIS. Opet ka쬰m, osobno me zanima matematika pa mi je i ovaj kolegij bio dosta zanimljiv, ali shva캖am i da nekima ne캖e biti. Promjenio se tip ispita ove godine pa se dosta ljudi iznenadilo, zato je po쬰ljno shvatiti teoriju, a ne samo 코tancati zadatke. I코ao sam kod Vel캜i캖a na predavanja i bio mi je odli캜an (tako캠er wholesome lik, cili zbunjen), ali to je opet osobno mi코ljenje i znam da se dosta ljudi ne sla쬰 s time.\n\nTe쬴na: **7 / 10**\n\nKorisnost: **8 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Okoli코, odr쬴vi razvoj i ubla쬬vanje klimatskih promjena\n>!MIslio sam da bi mogao ne코to zanimljivo i nau캜iti iz ovoga, ali brzo sam shvatio da to nije slu캜aj. Imate Moodle test na kraju svakog ciklusa za 9 bodova i boduju se predavanja (ali ve캖ina ljudi do캠e, potpi코e se i ode tako da nije problem).\n\nOsobno sam prvih par predavanja poku코ao i pratiti, ali bilo mi je jako dosadno i odustao sam. Ispiti su dosta lagani, samo se nekad pojave pitanja koja tra쬰 neke broj캜ane podatke (brzina topljenja leda na Antarktici ili postotak pove캖anja CO2 u atmosferi u nekom periodu, takve gluposti) pa ako vam se da 코trebat to onda samo dajte, ako ne onda se easy do캠e do neke 4, pa 캜ak i 5. U svakom slu캜aju bolje od IN콯EKO koliko sam 캜uo.\n\nTe쬴na: **2 / 10**\n\nKorisnost: **2 / 10**\n\nBih li preporu캜io/la predmet: Ako se i dalje nadate ne코to nau캜iti iz dru코tvenih predmeta onda ne, ina캜e **Da**\n\n## Ljetni semestar\n## Baze podataka\n\n>! Meni su bile 캜ak zanimljiv kolegij, valjda je korisno znat neke osnove baratanja s bazama podataka neovisno 캜ime se 쬰ite kasnije baviti. Pati od vje캜ne dileme jel' bolje pisati ovakve ispite na papiru ili ra캜unalu, do sada su se ljudi 쬬lili na papir, ove godine je i Edgar silovao tako da bih rekao da nema optimalnog rje코enja i da se treba pomiriti sa situacijom kakva je. 맚o se ti캜e profesora na predmetu, od po캜etka sam imao dojam da imaju nekako defenzivan stav i da su u startu zaklju캜ili da 캖e ve캖ina studenata poku코ati iskoristiti online nastavu za varanje 코to mi se nimalo nije svidilo. Na kraju su dosta smanjili pragove pa eto +1 za njih, ali op캖enito mi ne캖e ostati (po pona코anju) u najboljem sje캖anju. Video predavanja mislim da su (neki profesori vi코e, neki manje) odradili kvalitetno i na to nemam zamjerki.\n\nTe쬴na: **6 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Komunikacijske mre쬰\n\n>! Dosta easy predmet, nema velike filozofije. Postoje 3 labosa za koja treba odraditi pripremu (dosta zadataka treba rje코iti, ali nisu te코ki) i onda se rje코avaju blicevi za bodove. Svaki labos trebate ostvariti >0 bodova kako bi mogli pristupiti ispitima, ali bude na kraju spasilabos za one koji to nisu uspjeli. Video predavanja, osim Jevti캖evog bisera, su bila ubita캜no dosadna i uglavnom sam u캜io iz ud쬭enika koji su nam dali u materijalima. 캛ak nau캜ite neke OK osnovne pojmove o internetu i protokolima, ali eto imao sam 5 a ne mislim da imam neko veliko znanje iz podru캜ja. Chill profesori, chill predmet, ni코ta posebno.\n\nTe쬴na: **3 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Operacijski sustavi\n\n>! Sve pohvale za OS gang, najbolje su se sna코li za vrijeme online nastave i stvarno maksimalno iza코li studentima u susret. To mo쬯a nije relevantno za budu캖e generacije, ali eto pokazali su razumijevanje i stvarno su super profesori.\n\n Neke stvari koje se rade su korisne, neke malo manje, sve u svemu ne pretjerano te쬬k predmet, a ne코to se i nau캜i.\n\n Labosi nisu te코ki i dobijete pseudokod koji prakti캜ki samo trebate prepisati u kod. Veliki plus su materijali (prvenstveno Jelenkovi캖eva skripta - knjigu nisam ni imao i bila mi je vi코e nego dovoljna).\n\nTe쬴na: **4/ 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Razvoj programske potpore  za web i pokretne ure캠aje\n\n>! Prvi put da se izvodi ovaj predmet, bio je clusterfuck, ali ne bih se slo쬴o s (valjda) velikom ve캖inom ljudi koji apsolutno hejtaju ovaj predmet. Nikad prije se nisam susreo s Javascriptom ni Androidom, HTML i CSS sam oskudno radio u srednjoj tako da ima nekih  korisnih stvari za vidit. Je li se mogao bolje isplanirati? **Da**, Je li moglo biti manje stvari ali da se bolje objasne? **Da** - ali eto i sami profesori su rekli da je ideja bila dati pregled svega toga a ne ba코 zalaziti u detalje. Labosi ne bih rekao da su prete코ki, ona ko코arica je bila kobna jer nisam kao dosta ljudi sku쬴o da ima zajedni캜ki zadatak pa nisam ni predao, Android ako znate Javu vam ne bi trebao biti prevelik problem, a najavili su i promjene na predmetu pa eto valjda 캖e biti bolje sljede캖ih godina.\n\nTe쬴na: **5/ 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Da** jer mislim da je korisno upoznat se s ovim stvarima, **Ne** jer izvedba stvarno nije bila najbolja.\n\n## Uvod u teoriju ra캜unarstva\n\n>! Osobno mi se svidio predmet, na po캜etku mi je doza formalizma pri opisivanju automata, gramatika i jezika bila malo 캜udna, ali kad se na to naviknete ne bude toliko stra코no. Gradivo je apstraktno, knjiga je u쬬sna, labosi su vi코e manje free bodovi (ako vam se da rje코avati naravno) ali meni je bio simpati캜an predmet. I profesori se 캜ine dosta chill, jedino bi auditorne mogle biti bolje (ali pretpostavljam da u쬴vo i jesu).\n\nTe쬴na: **5/ 10**\n\nKorisnost: Nisam siguran, ali po코to su ovo neke temeljne stvari iz ra캜unarstva valjda je korisno? **6? 7? / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Upravljanje rizikom\n\n>! Jako, jaako dosadan predmet, ali upisao sam ga na preporuku kolege koji je rekao da je jedan od lak코ih na faksu uop캖e i s time se moram slo쬴ti. Pogotovo 코to za vrijeme korone nije bilo ni predavanja ni me캠uispita, pa je 40 bodova i코lo na moodle testove i case studye 코to su bili (vi코e manje) free bodovi. Opet, zvu캜i kao da se mo쬯a ne코to korisno i da nau캜iti, spominjali su (prije korone) i neka gostuju캖a predavanja iz industrije, ali eto svelo se na objavljene (u쬬sne) prezentacije i moodle kvizove. Ne znam kakvi su ostali dru코tveni, ali pretpostavljam da je sve vi코e manje sli캜no. Na ispitima ima negativnih bodova.\n\nTe쬴na: **1 / 10**\n\nKorisnost: **1 / 10**\n\nBih li preporu캜io/la predmet: **Da** za lako캖u, **Ne** za korisnost.",
      "votes": {
        "upvoters": [
          "1vq",
          "iNavy (mornar Ica)",
          "indythedog",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "49856": {
      "poster": "Joskica",
      "content": "Dosta ljudi je vec napisalo svoje dojmove, necu se previse ponavljat, probat cu da bude prakticno\n\nMoji dojmovi o nekim profesorima o kojima nisu napisana misljenja\n\nProbat cu uzeti u obzir i ona prva 2 tjedna uzivo jer ce buduce generacije, nadam se, imati tako\n\n## Vjerojatnos i statistika\n\n>! Bila kod prof Elezovica, s vremenom pocne gubit volju za predavanjem, zna biti dosta monotono nekad, ali nekad i dobro objasni. Prati svoju knjigu, ako i propustite neko predavanje doslovno obraduje sve primjere kao u knjizi.\n\n Osobno sam izbjegavala Velcica jer sam ga imala na MATAN1 i tamo me totalno zagubio, ali mozda je na VIS-u bolji. \n \n >Recept za prolaz: samo naucite teoriju s razumjevanjem i probajte skontat zadatke, statistika su free bodovi zato nemojte ignorirat zadnje cjeline. Na ZI se pise KPZ iz statistike koji je dosta lagan, odite na one \"labose\" na kojima se to radi. Auditorne kod Zubrinica su TOP. Saznajte kad su njegove i idite kod njega, jako dobro objasnjava i ako vec ne idete na predavanja idite na njegove auditorne, 10/10. \n \n >Te쬴na: **7 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Diskretna matematika 1\n\n>! Meni zabavan i zanimljiv predmet. Ako vam \"klikne\" onda ce vam biti lagano inace za neke dosta apstraktan. Nemojte strebat, probajte shvatiti kako stvari funkcioniraju i mozete imat 4 lagano. Predavanja sam slusala kod prof Pavcevica, ima kratak fitilj, tako da morate biti pristojni i mirni na predavanjima, imao je par spada ove godine. Vidi se da voli matematiku i uvijek pokusava zainteresirati studente na predavanjima. Meni su njegova predavanja kao da prica nekakvu pricu, ima ugodan glas. Po meni jako dobro objasnjava i na dokazima cesto ide sporije i puno crta po ploci, crteze kojih nema u skripti, ali jako pomazu u vizalizaciji dokaza. Jako preporucam njegova predavanja. Labosi su free bodovi, meni je 2 puta bio on, a jednom Kilassa. Kod Pavcevica je samo bitno da vam kod radi, znaci kada ga prvi put pokrenete da izbaci tocan rezultat i to je to,Kilassa me pitao da mu objasnim kod. Free bodovi.\n \n >Recept za prolaz: idite na predavanja kod Pavcevica, rijesite labose za free bodove, zadace su takodjer free bodovi, uglavnom budu najjednostavniji primjeri iz skripte i treba vam max 15 minuta da ih rijesite. Naucite stabla i ona bojanja na kraju, dijkstra je takodjer lagan. Nemojte preskakat dokaze jer su cesto i oni dosta trivijalni. \n \n >Te쬴na: **5 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Arhitektura racunala 1R\n\n>! Isla sam na predavanja samo kad su bili blicevi, koje najave dan ranije. Otrpilike su blicevi svaka 2 tjedna, tako da znate kad cete ih imat. Nisam previse gledala knjigu, prosla sam prezentacije zbog teorije. Asistenti su dragi.\n \n >Recept za prolaz: Ucite za bliceve, labose rjesavajte SAMI. Oduzet ce vam malo vise vremena, ali cete toliko toga nauciti, blicevi na labosima ce vam biti smjesni ako ste sami rjesavali svoj labos. Prije ispita uzmite zbirku rjesenih zadataka i to prodjite. Ja sam prije ispita prosla sve zadatke iz te zbirke, citala sam ih i ono ako razumijete logiku rjesavanja ic ce vam jako brzo. Ljudima kojima teze sjeda i ne razumiju preporucam prepisivanje zadataka, da vam udje u ruku. Na ispitu probajte bar dio napisat. \n \n >Te쬴na: **4 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Algoritmi i strukture podataka\n\n>! Ove godine su uveli C++ i zbog toga koriste neke svoje klase na ispitima, sluzbeni primjeri kodova na fer webu imaju puno gresaka (neke ne mozete pokrenut) i jako jako su losi.\n \n >Recept za prolaz: idite na predavanja kod JAGUSTA. Jagust je top, meni jedan od najdrazih profesora na faksu. Jako dobro objasnjava, ima dobar tempo, a cesto nabaci neku salu. Pisite kodove na predavanjima s njim. I sam je rekao da su ovi na fer webu losi. Ja sam ucila iz njegovih. Trudi se objasnit vam logiku iza algoritama i pise jako jednostavno i razumljivo. Na ispitu morate koristiti one njihove klase, koje ce vam biti zadane, ali ni to nije problem. Opet naucite dijkstru i stabla, to su free bodovi na ispitima. Labosi dobijete 10 zadataka, sve ih rijesite sami. U terminu labosa dobijete 1 ili 2 zadatka i nekad vas pitaju da ih maaaalo izmjenite a nekada da ih objasnite. Uglavnom nako lagano i ne stresno.\n   \n\n >Te쬴na: **5 / 10**\n\nKorisnost: **7 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Teorija informacija\n\n>! Zloglasni TINF. Ja sam bila kod profesora Ilica u grupi. Bila sam na mozda 2 predavanja sveukupno. Ilic dobro predaje, ali su na predavanjima ogromne guzve i ako zelite ikakvo mjesto, dodjite ranije. Ljudi su sjedili na stepenicama. Inace nisam uopce isla na predavanja.\n \n >Recept za prolaz: ovaj predmet sam si zacrtala da MORAM proci kontinuirano. Jednostavno da sama sebi olaksam. Prije ispita doslovno dan-dva sam prosla sve primjere iz zbirke. Pisite sami svoje formule jer cete tako najbolje znati sto vam treba, prodjite sve primjere iz zbirke jer se znaju ponavljati ISTI zadaci na ispitima. Naravno pogledajte i stare ispite. To je to. Ne preporucam dan prije ispita prolazit zbirku prvi put jer je dosta stresno i vec ste izmoreni od ostalih ispita, ali za mene je funkcioniralo. Ako planirate ici na predavanja preporucam Ilica. Sveukupno sam na ovaj predmet potrosila 3 dana cijeli smestar.\n \n >Te쬴na: **4 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporu캜io/la predmet:  **a ne bi, al ono nemate izbora**\n\n## Baze podataka\n\n>! Imala sam iskustva s bazama i SQL-om od prije tako da mi je ovaj predmet bio dosta lagan. Na predavanja ona prva 2 tjedna sam bila kod Pintara. Pintar je i na video predavanjima, po meni, najbolj. \n \n >Recept za prolaz: ako mozete, idite kod Pintara. Ima malo brzi tempo, koji meni pase. Prodjite prezentacije s razumjevanjem. Stari ispiti su dosta dobra vjezba za izpite i dosta zadataka se ponavlja. Zadace su lagane i nemojte ih preskakat jer, tko zna, mozda ce vam bas ti bodovi faliti za prolaz ili ocjenu. Nemam nista previse za rec osim prolazite prezentacije i rjesavajte zadatke s ispita i to je to.\n \n >Te쬴na: **6 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Operacijski sustavi\n\n>! Svi profesori na ovom predmetu su jako dobri. Ja sam prva 2 tjedna bila kod prof Goluba. Covjek je izuzetno pristupacan i drag. Sve sto vam nije jasno, slobodno ga pitajte. Sve sto diktira ili crta na ploci zapisite u neku biljeznicu ili negdje. To ce vam doci na ispite i u bliceve. Prije bliceva ima ponavljanje gdje doslovno kaze sva moguca pitanja koja mogu doci na blicu i odgovori na njih. \n \n >Recept za prolaz: idite kod Goluba, ili ostanite kod svog profesora, svi predavaci su super. Morate ici u svoju grupu zbog bliceva. Labosi su lagani i dobijete peudokod za njih. Ispiti nisu preteski, pogledajte stare ispite i auditorne vjezbe. Prof jelenkovic ima sve snimljeno na yt. Na materijalima imate tutorijale za sve tipove zadatak iz auditornih, koji vam mogu doci u ispit. Ako to prodjete mozete imati 4-5. NEMOJTE prepisivati ni POSUDJIVATI labose drugima. Necete proci predmet.\n \n >Te쬴na: **5 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Komunikacijske mreze\n\n>! Po meni koristan predmet jer naucite kako funkcioniraju mreze. Ako nista drugo, znat cete si Internet podesit jednog dana kada budete zivjeli sami. Bila sam kod prof Matijasevic. Kod nje mozete dobit bodove za aktivnost ako se javite tijekom predavanja i odgovorite na njena pitanja. Pitanja su lagana i uglavnom je to nekakvo ponavljanje. Jedina dobra stvar od ovog online semestra je sto nisam morala biti aktivna na predavanjima da bi skupila tih 10 bodova. \n \n >Recept za prolaz: Prezentacije + udzbenik, iako udzbenik ne morate pre detaljno onda. Labosi nisu preteski ako pripremu napisete sami s razumjevanjem. Ispiti su sablone, jedino sto nemate tocna rjesenja starih ispita.\n \n >Te쬴na: **4 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Uvod u teoriju racunarstva\n\n>!Profesor Delac mi je bio uzivo i mogu reci da je jako drag i da jako dobro predaje. Ide sporo, al opet ne previse. Izgleda jako pristupacno. \n \n >Recept za prolaz: Online predavanja na duploj brzini, procitajte i udzbenik jer cesto stavljaju primjere iz udzbenika u teoriju. Naucite teoriju jer stvarno nije teska. Prve i druge auditorne su dobro objasnjene u pdf-ovima i u videima. Naucite te zadatke jer su vam to onda free bodovi na ispitima, a nisu preteski. Za Turingove strojeve i gramatike, pogledajte tutorial s materijala. Jako koristan. Labosi su isto free bodovi, ako vam rade svi test primjeri.\n \n >Te쬴na: **6 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Razvoj programske potpore za web i pokretne ure캠aje\n\n>! Prije ovog predmeta imala sam solidnog iskustva i s Androidom i s node-om, tako da mi ovaj predmet nije bio pretezak. Na prvom predavanju mi je bio Boticki, nisam izdrzala 3 sata. Nacin na koji objasnjava mi se nije svidio. Po meni nije potrebno ici na predavanja, pogotovo HTML, CSS, ali ako ne znate JS onda idite bar na ta. \n \n >Recept za prolaz: ako vec ne idete na predavanja, obavezno prodjite prezentacije jer su ispiti cancer. Pitaju vas dosta teorije koja je jako jako beskorisna i nikada u praksi necete to morat znati napamet. Za labose proucite sve primjere. Ne bi vam se trebalo pojaviti nista sto nije bilo u primjerima. Pripreme rjesavajte sami, ako zapnete mozete pitati kolege ofc, ali probajte razumjeti sto se dogadja zapravo. Nemojte samo kopirati W3Schools, uzmite kod od tamo, ali ga prilagodite. Zapravo preporucam proucavanje njihovih primjera i to je to. Opet ako mozete birati predavace, uzmite Jagusta.\n \n >Te쬴na: **5 / 10**\n\nKorisnost: **7 / 10**\n\nBih li preporu캜io/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "1vq",
          "Janus",
          "iNavy (mornar Ica)",
          "indythedog",
          "klukas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "49869": {
      "poster": "klukas",
      "content": "@Joskica#49856 U kojoj je grupi (mislim kao redni broj) profesor Pav캜evi캖 ove godine dr쬬o Diskretnu matematiku 1? Ako budemo u쬴vo, imam 쬰lju slu코ati to kod njega, a nekako o캜ekujem da ne캖e mixati predava캜e po grupama",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "49935": {
      "poster": "ikerkaferkass",
      "content": "@klukas#49869 P01 ali ti predavanja nisu obavezna tako da mozes ic kod bilo koga ili cak ne ic (veci dio semestra nisam isao na predavanja, ali sam radio kontinuirano po skripti i imao 5). Ne kazem da preporucam to ali Pavcevic jako prati skriptu pa eto",
      "votes": {
        "upvoters": [
          "klukas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "49940": {
      "poster": "Joskica",
      "content": "@klukas#49869 koliko se sjecam 1. grupa, utorak i cetvrtak 8 ujutro predavanja\n\njos jedna stvar, nemojte kasniti kod Pavcevica, to ga dosta ljuti",
      "votes": {
        "upvoters": [
          "indythedog",
          "klukas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "49949": {
      "poster": "klukas",
      "content": "@ikerkaferkass#49935 @Joskica#49940 Zahvaljujem na informacijama. Svjestan sam da mogu birati gdje 캖u, ali ako se samoinicijativno prebacujem onda riskiram koliziju s nekim labosima i sl, pa bih htio to izbje캖i ukoliko je mogu캖e. Zahvaljujem jo코 jednom!",
      "votes": {
        "upvoters": [
          "Joskica"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "50133": {
      "poster": "Sashat_Triceps (Sasha_Triceps)",
      "content": "맚o se ti캜e operacijskih sustava istinite su pri캜e o rokovima...Pojeo sam masnu kur캜inu kad sam pao kontinuirano pa toplo preporu캜am da to kolokvirate. Rokovi su sigurno 10 puta te쬴 od kontinuiranog jer vas ne pi코e toliko puno (vas par debila) pa imaju vi코e vremena za ispravljanje, 코to zna캜i jako papren ispit. Ekipa s OS rokova zna lamporta ko pjesmicu",
      "votes": {
        "upvoters": [
          "Bucc (Olive Oil)",
          "InCogNiTo124",
          "[deleted]",
          "boss15",
          "djeno",
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA D콯IN)",
          "mijauexe",
          "steker",
          "turunturu (Cement)",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "AK10 (endyyyy)",
          "AntonioB25 (Pleteni mi코)",
          "BalkanStar",
          "BigZ1",
          "Bucc (Olive Oil)",
          "Filemon",
          "InCogNiTo124",
          "PikachuOnAcid (Kaneki kun)",
          "Sans",
          "markoo321 (Grinch)",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
          "steker",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "57843": {
      "poster": "sivizid",
      "content": "Ima li tko ikakvih informacije sto se tice transverzalnog predmeta Umjetnost novih medija?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "57844": {
      "poster": "iNavy (mornar Ica)",
      "content": "@sivizid#57843 mislim da se na fer2 programu nije odr쬬vao, a pro코le godine se nije odr쬬vao iz nepoznatog razloga",
      "votes": {
        "upvoters": [
          "sivizid"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "63603": {
      "poster": "psiho",
      "content": "@djeno#45323 ja probo upisat dizajn na drugoj, nedaju mi jer prioritet imaju prvasi koji brzo popune kvotu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Jura (Spike433)",
          "djeno"
        ]
      }
    },
    "75261": {
      "poster": "noobcamper",
      "content": "Koje predmete samo proci, a za koje da se potrudim?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75263": {
      "poster": "Mikki",
      "content": "@noobcamper#75261  to ovisi o tvojim osobnim afinitetima, ali rekla bih da predmeti koje bi trebao kolokvirati i ne zezati se s ispitima su tinf, arh1, os, baze i utr. Od ostalih se potrudi ako ti je nesto zanimljivo i mislis da ce ti koristiti u buducnosti.",
      "votes": {
        "upvoters": [
          "JeleeII",
          "boss15",
          "meta",
          "noobcamper"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75307": {
      "poster": "MiqeloS",
      "content": "@noobcamper#75261 Vjerojatnost i StAtIsTiKa je must must za proci kontinuirano ako ne 쬰li코 pi코ati krv na rokovima",
      "votes": {
        "upvoters": [
          "noobcamper"
        ],
        "downvoters": [
          "iLabaviUmeDaZabavi (prvi do boga)",
          "in1",
          "jobi (azex)",
          "markoo321 (Grinch)",
          "sheriffHorsey"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75308": {
      "poster": "markoFer",
      "content": "Kako se izvode labosi i blicevi na arh1r ove godine ? Nemam pristup predmetnim materijalima jo코.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75310": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@MiqeloS#75307 Nekad bilo, sad su rokovi melem naspram onih iz 2018./2019., skoro pola ispita je teorija, 6 zadataka ukupno",
      "votes": {
        "upvoters": [
          "markoo321 (Grinch)",
          "noobcamper"
        ],
        "downvoters": [
          "AK10 (endyyyy)",
          "JBear",
          "MiqeloS",
          "Sulejman",
          "kix7 (Fish99)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75356": {
      "poster": "gladiator",
      "content": "@iLabaviUmeDaZabavi#75310 rokovi su bili mim zbog 랊nline nastave",
      "votes": {
        "upvoters": [
          "markoo321 (Grinch)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83929": {
      "poster": "ab173 (bbbbbbb)",
      "content": "Jel se sjeca itko kako je izgledao raspored ispita za zimski semestar? Npr jel bio prvo VIS pa ASP itd..",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83931": {
      "poster": "sheriffHorsey",
      "content": "@ab173#83929 \n\nme캠uispiti:\n1. tjedan: vis ponedeljak, arh srijeda\n2. tjedan:  asp ponedeljak, diskretna utorak, tinf 캜etvrtak, okoli코 petak\n\nZavr코ni su bili sli캜no raspore캠eni, osim 코to je asp bio u prvom tjednu",
      "votes": {
        "upvoters": [
          "ab173 (bbbbbbb)",
          "meta",
          "mijauexe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "83934": {
      "poster": "slip",
      "content": "@ab173#83929 Vidi Wolfmanov raspored ovdje (valjda je ispravan): https://docs.google.com/spreadsheets/d/1ciHeXIbGM9kYv--MFULkJdvMkH8C0-WtoUqa5tYXVNk",
      "votes": {
        "upvoters": [
          "Klembuksna",
          "ab173 (bbbbbbb)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141941": {
      "poster": "Fruit_kid",
      "content": "Ima li netko iskustva s predmetom Odabrana poglavlja matematike da mo쬰 podijelit neke korisne informacije?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141976": {
      "poster": "Red_Baron",
      "content": "@Fruit_kid#141941 Ove se godine izvodi prvi put, pa ti nitko osim nositelja ba코 ne mo쬰 pomo캖i.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149336": {
      "poster": "markoo321 (Grinch)",
      "content": "ima neko knjigu za UTR u online obliku?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149348": {
      "poster": "[deleted]",
      "content": "Jezicni procesori 1? Ako da, ja imam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149350": {
      "poster": "[deleted]",
      "content": "@markoo321#149336 \n\nhttps://drive.google.com/file/d/1XMpHmYwQsOrwlv0mPlgVQhmnxCsO52wN/view?usp=sharing",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "Valentino"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149374": {
      "poster": "markoo321 (Grinch)",
      "content": "@abcdefgh#149348 pa mslm nez ak je korisna?\n\nak je neko ucio po njoj pa ima vise saznanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149376": {
      "poster": "[deleted]",
      "content": "@markoo321#149374 \n\npa reci koju knjigu tocno zelis? Znam za ovu, nisam isao nesto po njoj pa ne mogu reci koliko je korisna.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149377": {
      "poster": "markoo321 (Grinch)",
      "content": "@abcdefgh#149376\n\n![](assets/2021-03-03/00025.png)\n\novu iz 2007.\n\nedit: mslm da su to dvije jednake knjige po sadrzaju samo je drukcije ime",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149381": {
      "poster": "markoo321 (Grinch)",
      "content": "@markoo321#149377 ali opet ako imas ovu iz 2007. ra캠e bi nju",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149383": {
      "poster": "SuperSjajan3",
      "content": "@markoo321#149374 To ti je knjiga za utr, preze i predavanja drito to prate",
      "votes": {
        "upvoters": [
          "Filemon",
          "markoo321 (Grinch)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149525": {
      "poster": "Red_Baron",
      "content": "@markoo321#149377 Knjige su identi캜ne, osim 코to su od 2002. do 2007. sku쬴li da je Sheila Greibach 쬰nsko, pa umjesto \"Greibachov normalni oblik\" u novijem izdanju pi코e \"Greibachin normalni oblik\".",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Bobicki",
          "BreadCat",
          "BrkMateaBeusana (Umarell)",
          "Emma63194",
          "Filemon",
          "PeroPerica",
          "Svarog (Veles)",
          "aperture",
          "jobi (azex)",
          "noobcamper"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bobicki",
          "BreadCat",
          "BrkMateaBeusana (Umarell)",
          "Kaladonter",
          "McKovalski",
          "Mikki",
          "PeroPerica",
          "Rene",
          "Svarog (Veles)",
          "Theanko (Mirko 콯mirko)",
          "Vishnjevac",
          "aperture",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "iv2 (bubbles)",
          "krumpirko",
          "mesojed (sofronijevicevPrst)",
          "slip",
          "snowman",
          "steker",
          "zvucnik"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "149690": {
      "poster": "skibr (?!?!)",
      "content": "kakav je prije otprilike bio raspored me캠uispita za 4. semestar?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149709": {
      "poster": "BigZ1",
      "content": "@skibr#149690 bila je korona. a ZI su bili 3 tjedna.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150030": {
      "poster": "noobcamper",
      "content": "Koji predmeti 4. semestra su bitniji za kasnije studiranje, koji za posao, a koje je te코ko pro캖i na roku?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150045": {
      "poster": "markoo321 (Grinch)",
      "content": "@noobcamper#150030 OS je cancer na roku, baze bi isto trebalo izbjeci da se ide na rok.\n\ni kolko vidim mre쬰 ce biti najlaksi predmet za proci.",
      "votes": {
        "upvoters": [
          "Filemon",
          "noobcamper",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150078": {
      "poster": "SuperSjajan3",
      "content": "@noobcamper#150030 Rekao bi da je razvoj dosta bitan i za studiranje i za posao iako je na캜in na koji je koncipiran cancer. Bar bio pro코le godine, sad su mijenjali neke stvari za ovaj semestar.",
      "votes": {
        "upvoters": [
          "Red_Baron",
          "noobcamper"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "151831": {
      "poster": "markoo321 (Grinch)",
      "content": "> @Rene#49702 Video predavanja\n\nimas mozda neki link na ta predavanja?\n\nedit: vidim da je ova povratna veza sjebana, pitam za predavanja iz baza",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "151838": {
      "poster": "Rene",
      "content": "@markoo321#151831 malo te코ko odgovorit kad citira코 samo dvije rije캜i a post je o svim predmetima hahah, ali pretpostavljam da misli코 na baze a to su maknuli playlistu",
      "votes": {
        "upvoters": [
          "markoo321 (Grinch)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "1vq"
        ]
      }
    },
    "197122": {
      "poster": "ab173 (bbbbbbb)",
      "content": "jel postoji spasi labos iz komunikacijskih mreza?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "197125": {
      "poster": "[deleted]",
      "content": "@ab173#197122 \n\nSto je to? Ako mislis na nadoknadu, da\n\nhttps://fer.studosi.net/d/4018-kommre-pitanja-i-odgovori/26",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "214182": {
      "poster": "regnum",
      "content": "## Arhitektura ra캜unala 1R\n\nNisam pratio od po캜etka jer su predavanja (snimljeni videi) bila u쬬sno dosadna i monotona i zbog toga sam poslije imao problema. **Probajte 코to vi코e bodova skupiti na me캠uispitu** i na labosima i trebali bi biti okej. \n\n맚o se ti캜e korisnosti, okej je, malo vidite kako to stvarno funkcionira u pozadini.\n\nTe쬴na: **8 / 10** (subjektivan sam)\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Algoritmi i strukture podataka\n\nPo meni, dosta lagan ali i koristan predmet. Nisam i코ao na predavanja (online dodu코e), radio sam sam uz youtube i pro코ao jako lagano preko mi i zi. Nisam napisao niti jedan jedini kod, ali sam i dalje pro코ao. Probajte stvarno shvatiti 코to se tu doga캠a i radi, ali nemojte se previ코e zezati s tim C++ i njihovim na캜inom pisanja. ZI mi je 캜ak bio lak코i od MI.\n\nTe쬴na: **5 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Diskretna matematika 1\n\nFora predmet u po캜etku, kasnije se dosta zakomplicira. Postoji jako puno vrsta zadataka i dokaza. Zeznuo sam bio MI, pa sam morao dosta skupiti na ZI, a vi probajte obrnuto 游땍 prvi ciklus je lak코i (kombinatorika i rekurzija), a poslje vas 캜ekaju grafovi (ne코to kao ASP ali iz matemati캜ke perspektive). **Jako lagan za pro캖i, 45 je za 2, labosi nose jako puno bodova tako da njih obavezno napi코ite, nau캜ite za MI solidno i i imate prolaz.**\n\nNe znam kako da procijenim te쬴nu, a mo쬰 biti koristan ovisno o smjeru koji odaberete poslije (vidjet cete na labosima malo sto se radi tocno u programiranju iz toga)\n\nTe쬴na: **5-6/ 10**\n\nKorisnost: **?/ 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Teorija informacije\n\nBlage veze nemam 코to se tu doga캠a i radi. Poslu코ao sam savjete od starijih studenata i pro코ao kontinuirano 캜ak dosta lagano. Nisam bio niti na jednom predavanju ve캖 tjedan-dva prije mi i zi prolazio kroz onu **njhovu skriptu sa zadacima i starim ispitima**. Prolaznost na ZI je bila 47% dok su ostali predmeti imali (osim VISa koji je isto imao 47%) 55-70%\n\nTe쬴na: **???/ 10**\n\nKorisnost: **0/ 10**\n\nBih li preporu캜io/la predmet: **Ne, ali nemate izbora**\n\n## Vjerojatnost i statistika\n\nPrva dva tjedna bacate kockice i brojite igra캜e karte, a poslije se sve zakomplicira i tu dosta studenata zezne jer odustane od predavanja i misli kako 캖e to lagano rje코iti. Predavanja mi je dr쬬o prof. Vel캜i캖 i bila su katastrofa tako da sam sam u캜io iz knjige (ne svi캠a mi se ba코, ali je bolja mi je bila od predavanja). \n\nAko se mo쬰te natjerati i캖i na predavanja preporu캜io bih vam da to i radite. Pro캠ite kontinuirano s tim da dosta bodova probajte skupiti na MI. \n\nMeni je bio jako zanimljiv i dosta lagan tako da sam ga rje코io bez problema.\n\nNeki recept za prolaz: pratite kontinuirano, obavezno gledajte auditorne i rje코avajte stare ispite. Knjiga je vi코e zbog teorije, zadatke ve캖inom vade iz auditornih i onih zadataka za svaki tjedan.\n\nProlaznost na zi je bila 47% \n\nTe쬴na: **5/ 10** ali uz dosta rada\n\nKorisnost: **8-10/ 10** ovisi 코to 캖ete poslije raditi\n\nBih li preporu캜io/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": [
          "MiqeloS",
          "Sulejman",
          "Vishnjevac"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "214183": {
      "poster": "regnum",
      "content": "@regnum#214182 \n\nJo코 sam ovo zaboravio.\n## In쬴njerska ekonomika 1\n**Ne upisujte.**\n\nTe쬴na: **10 / 10**\n\nKorisnost: **0 / 10**\n\nBih li preporu캜io/la predmet: **Ne**",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "Sulejman",
          "Vedo",
          "Vishnjevac",
          "meta",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bepo",
          "Filemon",
          "Grdobina2000 (Grdobina)",
          "Janus",
          "McKovalski",
          "Vedo",
          "macaklin",
          "meta",
          "sheriffHorsey",
          "wutangfan (HugoStiglitz)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "214187": {
      "poster": "regnum",
      "content": "## Baze podataka\n\nNajva쬹ije je dobro rje코iti labose, MI se tako캠er da dobro napisati jer ima dosta upita koji se daju izvje쬭ati, a onda na ZI preostaje samo prag od 8 bodova. Dio gradiva za ZI je meni bio jako dosadan i izrazito duga캜ak i to mi se stvarno nije dalo pratiti, lak코i su mi bili upiti nego taj teorijski dio (kojeg stvarno ima jako puno). \n\nDobra stvar kod ovog predmeta je 코to na ispitima stalno vrte iste zadatke koji se stvarno daju nau캜iti. Sve u svemu, treba dosta vremena za to pohvatati jer ima puno teorije, ali da se nau캜iti ako se dobro krene. Tako캠er ima dosta materijala na internetu, pa i to olak코ava stvar.\n\nRecept za prolaz: radite kontinuirano jer stvarno ima dosta gradiva, a kada vam se nakupi ne캖e vam se dati, probajte ba코 dobro rje코iti labose i mi, a onda si ostavit samo osam bodova za zavr코ni\n\nTe쬴na: **6-7 / 10**\n\nKorisnost: **8/ 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## Komunikacijske mre쬰\n\nDosta lagan predmet za pro캖i, oba ispita su bila online, 10 bodova nose zada캖e, 15 za aktivnost na nastavi i 15 bodova labosi. Na labosima morate svaki (tri su labosa) imati > 0 bodova ina캜e padate.\n\nPredavanja su bila \"obavezna\" zbog aktivnosti, ali eto, barem dobijete 10-15 besplatnih bodova. Labosi su najgori dio predmeta, jako dosadni i nepotrebno duga캜ki, ali da se eto. Probajte dobiti sve bodove iz dz i aktivnosti, labose barem 10 i onda skupite ne코to na mi i zi jer je lak코e tako nego ba코 u캜it za mi i zi (sve 캖e vam biti jasno kada vidite koliko knjiga ima stranica i koliko ima slajdova u prezentacijama)\n\nTe쬴na: **3 / 10**\n\nKorisnost: **3 / 10** (ako 캖ete na mre쬰, onda vjerojatno 10/10)\n\nBih li preporu캜io/la predmet: **Da**\n\n## Operacijski sustavi\n\nJako lagan predmet za pro캖i jer nema nikakvih pragova, a labosi nose 32 boda. Stvarno se potrudite za labose, rje코ite ih sami (gledaju plagijate) i dobijte ta 32 boda i doslovno ste rje코ili predmet. Mislim da je vi코e od pola generacije sa labos + mi ve캖 polo쬴lo predmet. Rok je dosta zeznut (tako sam barem 캜uo). Nisam pogledao niti jedno predavanje (osim kad se rje코avaju zadaci), stari ispiti + labosi -> prolaz\n\nFora predmet ina캜e, malo vidite kako funkcionira OS i koje su mu zada캖e, labosi tako캠er jako dobri, radite ih sami i morate predati do odre캠enog roka i onda to prezentirati na nekom terminu.\n\nTe쬴na: **3 / 10**\n\nKorisnost: **8 / 10** \n\nBih li preporu캜io/la predmet: **Da**\n\n## Razvoj programske potpore za web\n\nPredavanja su koma, doslovno samo linkaju na neke vanjske resurse da u캜ite sami, ka쬿 vam da ovaj predmet nema smisla bez googlea i onda se ispit pi코e na papiru (smijete imati kao neki 코alabahter na 4 stranice) gdje se doslovno radi web stranica...na papiru + neke teoretske gluposti koje se provjere jednim google searchom.\n\nLabosi su jedina svijetla to캜ka, nose 32 boda, ali se stvarno mora ulo쬴ti dosta vremena u to jer su predavanja koma. Mi smo radili web shop. Krene se od htmla i cssa, onda html, css + js, pa se polako ide prema izradi servera u NODE.js\n\nTako캠er, ZI ima prag od 40%. Ukratko, jako lo코e organiziran predmet, ali zanimljivo i korisno gradivo ako u캜i코 sam.\n\nNeki recept za prolaz: probajte skupiti 코to vi코e bodova na labosima i stvarno razumijeti to gradivo jer vas to 캜eka u ZI gjde postoji prag od 40%. Nema nekih zadataka za vje쬭u niti starih ispita, pa eto, jedino mi to pada na pamet.\n\nIsto tako je jako va쬹o napraviti dobar 코alabahter, 코to je tragikomi캜no.\n\nNovi je predmet, mo쬯a vama promijene.\n\nTe쬴na: **8-10 / 10** zbog neorganiziranosti\n\nKorisnost: **8 / 10** \n\nBih li preporu캜io/la predmet: **Da**\n\n## Uvod u teoriju ra캜unarstva\nMeni dosta lagan bio za pro캖i, ali gradivo i nije ba코 lagano. Sve je puno 캜udnih simbola i prepuno formalizama i to mo쬰 stvarno ljude odbiti od u캜enja. Ne znam kakva su predavanja, nisam pogledao niti jedno osim uvodnog i odmah sam odustao. Labosi nose 30 bodova (prag je 15 bodova) i ono, nisu te코ki, ali zahtijevaju dosta vremena. Prva dva nose manje bodova, a puuno su te쬴 od zadnja dva (ne znam za코to, ali eto).  **Krenite ih raditi na vrijeme jer su vremenski zahtjevni, objave ih mjesec dana prije roka, radite ih sami od doma i predajtete na SPRUT i nemojte prepisivati jer imaju stvarno dobru detekciju plagijata.**\n\nIspiti imaju 3 problemska i ostatak je toerija na zaokru쬴vanje (barem je nama tako) i nema ba코 starih ispita, ali postoje neki materijali ovdje na studo코ima. Prag je da MI + ZI >= 35, odnosno MI + ZI = 50% od ukupnog broja bodova s ispita tako da je i to dosta zeznuto.\n\nTe쬴na: **8 / 10**\n\nKorisnost: **5-6 / 10** \n\nBih li preporu캜io/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Filemon",
          "Vishnjevac",
          "[deleted]",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218056": {
      "poster": "aux",
      "content": "## ZIMSKI SEMESTAR\n\n## Diskretna matematika\n\nMalo random predmet tbh. Prvo se krene malo sa spicy kombinatorikom, pa linearne rekurzivne relacije (vrlo sli캜no diferencijalnim jednad쬭ama u neku ruku, ali puno lak코e), i onda tek graph theory. Grafovi su ba코 onak ful teorija. 캛ovjek bi o캜ekivo da 캖e se tu nau캜it neki algoritmi na grafovima, ali nau캜iti 캖ete onak... Dijsktru. And that's about it.\n\nSve u svemu, lagan predmet. Imate matan style skripte, pro캜itate to jednom-dvaput sve, rije코ite par zadataka, i dobri ste. \n\nBudu i neki labosi, 코to je po meni najzanimljiviji dio predmeta. Labosi ve캖inom budu da napi코ete program (kod ku캖e, samo imate rok do kad morate) koji 캖e ra캜unati ne코to nad zadanim grafom. Sre캖om, ne morate mo캖i smisliti efikasan algoritam uop캖e, inputi su jako mali, ali neki nadobudni studenti vole smi코ljat 코to efikasnija rje코enja.\n\n## Vjerojatnost i statistika\n\nOvo vam je matan1/matan2 3. semestra. Heavy matematika, puno razmi코ljanja, fun zadaci. \n\nVIS preporu캜am da ba코 radite kontinuirano, u smislu da u캜ite redovito. Imate linearna algebra style skripte, samo bolje. 캛itajte to i rje코avajte zadatke iz Elezovi캖a ili \"zada캖a\" na Moodleu. U pravilu je prvi ciklus lak코i 코to se gradiva ti캖e, ali drugi ciklus se isplati isto potruditi jer budu jako 코ablonski zadaci.\n\nAlso tu budu neki random bodovi za \"labose\". Labose nemate nikakve, ve캖 samo prije ZIja dobijete par sati predavanja o programskom jeziku R (za statistiku), i onda neposredno prije ZIja pi코ete KPZ vezano za taj R. Ni코ta te코ko, ali morate razumjet gradivo drugog ciklusa da znate i코ta na KPZu.\n\n## Algoritmi i strukture podataka\n\nE, ovdje nau캜ite neke algoritme na grafovima. Ali i dalje ne ba코 puno, samo BFS, DFS i (opet) Dijsktru. \n\nNa ASPu radite u C++u, bude mali C++ uvod ali op캖enito nije uop캖e fokus na jeziku. Ve캖ina ve캖 manje-vi코e zna dosta stvari na predmetu, pogotovo BFS i DFS, ali bude i korisnih stvari, recimo konkretne implementacije npr linked listi, queuea, stoga, hasha, etc. \n\nBude jako lagano though, ako 쬰lite ba코 nau캜it neki leetcode, preporu캜am da upi코ete Natpro vje코tinu. \n\n## Arhitektura ra캜unala\n\nOvaj predmet je meni bio jako zanimljiv. Nekako prirodni nasljednik digitalne logike, tamo ste recimo u캜ili kako rade bistabili, a sada zapravo radite ne코to s tim registrima. Zvu캜at 캖e mo쬯a malo glupo - ali prvi ciklus radite na \"izmi코ljenom\" procesoru, tj. oni su vam smislisli jako jednostavan prototip procesora, i na temelju njega u캜ite kako stvari rade. Ima smisla though, puno lak코e se nau캜i na tom jednostavnom izmi코ljenom primjeru. Drugi ciklus onda radite pojednostavljenu ARM arhitekturu, basically samo primijenjujete znanje iz prvog ciklusa sada na druga캜iji procesor (kao da u캜ite drugi programski jezik - samo malo razlike u sintaksi recimo).\n\nIma jako puno gradiva te isto preporu캜am da ovo radite kontinuirano. Samo derite po prezentacijama, plus eventualno malo primjeri iz ogromne zbirke. Malo je te쬴 predmet, ima dosta stvari i za pamtit, a treba i znat razmi코ljat u asembleru.\n\nPostoje i labosi - tu vam daju neki linux VM sa preloaded alatima u kojima pi코ete asembler kod i onda simulirate procesor. Iskreno, tu se najvi코e i nau캜i, tako da pi코ite ih sami.\n\n## Teorija informacije\n\nFamozni tinf, vjerojatno ste ve캖 캜uli pri캜e. \n\nQuick tip, prvo odradite 2.-3. tjedna VISa, i onda krenite s TINFom, jer basic knowledge VISa je potreban za razumijevanje TINFa. Prvi ciklus je relativno lagan po meni, i tu treba skupit bodove. Drugi ciklus je Fourier, kojeg mi po FER3 vi코e ne radimo, pa je taj dio *jako* zbunjuju캖. Ako 쬰lite (donekle) shvatit stvari i imati dobru ocjenu, gledajte na yt video o Fourieru. Mnogima ZI onda samo ispadne ganjanje praga od 5/50, a 캜ak i to mo쬰 bit te코ko.\n\nSre캖om, iz TINFa ima jako dobra zbirku s jako puno zadataka, definitivno pro캠ite sve te zadatke jer znaju se doslovno pojavit identi캜ni na ispitu. Tako캠er, na studo코i gitu imate jako puno prija코njih ispita, pa vrijedi i po tom vje쬭at nakon 코to pro캠ete zbirku. I ti zadaci se ponavljaju. I jako useful stvar - smijete si napisat svoj 코alabahter. Pomogne dosta.",
      "votes": {
        "upvoters": [
          "1vq",
          "Filemon",
          "InCogNiTo124",
          "Janus",
          "Jeff",
          "iNavy (mornar Ica)",
          "zvucnik"
        ],
        "downvoters": [
          "macaklin"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218059": {
      "poster": "aux",
      "content": "## LJETNI SEMESTAR\n\nOvaj semestar je po meni jako lagano gradivo, ali jako puno labosa i posla izvan ispita. Nema nijedne te코ke matematike koju treba grindat konstantno, nema te코kih predmeta, samo puno posla.\n\n## Operacijski sustavi\n\nPo meni najbolje organiziran predmet. \n\nGradivo je prirodan nastavak na arh1. Zna캜i na arhitekturi ra캜unala ste nau캜ili kako izgleda procesor, i sada u캜ite kako OS koristi taj procesor. Nije nu쬹o da sad znate arh, ali je dobro bar imat basic intuition 코ta se u arhu doga캠alo. Samo po sebi, gradivo je pretty simple.\n\nOvo je jedini predmet koji je nama odr쬬o i opcionalna predavanja u쬴vo, i definitivno preporu캜ujem da idete na njih. 캛uo sam pozitivne reviewove za sve profesore, a meni se svidio 캟ura코evi캖.\n\nLabosi ovdje su da do nekog roka iskodirate neki mali program캜i캖 u C-u, i onda ga demonstrirate asistentu putem Teamsa, i on vas pita par pitanja. Free 22 bodova, a i nau캜i se nesto.\n\n## Baze podataka\n\nOOP style predmet. \n\nU po캜etku ba코 u캜ite SQL sintaksu, i onda vas hittaju s prvim labosom na edgaru gdje dobijete 3 monster SQL upita za napisat u 30 min. Ja sam ga 캜ak i uspio clutchat i rije코it sva tri, ali ljudi su tu masovno gubili bodove. Nakon toga postane lak코e kad se prebacite na \"teoriju\" i na to kako sustav za baze podataka funkcionira, i tu je ve캖 malo i 코ablona.\n\nIako je taj prvi labos bio katastrofa, ostatak predmeta je bilo vrlo pravedan po meni (ljudi su se 쬬lili na to 코to nije bilo vra캖anja na MIu, ali pisao se online tako da... ne코to smo morali izgubit, a vremena je bilo taman dovoljno). Na kraju su 캜ak i organizirali ZI u쬴vo, i to da smijemo koristit sve materijale. Vrlo nice. 캛ak su i masivno snizili pragove, 80 za 5.\n\nHot tip, stisnite ovo odmah na po캜etku, 코to prije vam sjednu SQL upiti, to bolje.\n\n## Web \n\nMalo weird predmet, tek se dvije godine izvodi pa ne znaju ba코 jo코 kako i 코ta na predmetu. Prezentacije i predavanja su prili캜no lo코a - moj opinion je da je to i do gradiva tbh. Najvi코e se nau캜i na labosima, njih radite sami i potrudite se shvatit 코to bolje, nakon toga je lagano.\n\nU biti yeah radi se HTML CSS i JS prvi ciklus, a drugi ciklus je HTTP i backend u node.js. Prvi ciklus ima dost gradiva, ono treba to sve pro캖. A drugi ciklus... nekako jako prazan, brzo se nau캜i kroz ta dva labosa.\n\n## Komunikacijske mre쬰\n\nJedini predmet koji je imao obavezna predavanja i 15 bodova iz aktivnosti, nije mi se to uop캖e svidjelo. Ali dobro, sve u svemu stvari su vrlo lagane, te aktivnosti, zada캖e i labosi te natjeraju da ga u캜i코.\n\n## Uvod u teoriju ra캜unarstva\n\nUf, jako jako gadno gradivo iskreno. Ne znam ba코 코to bih rekao o predmetu. Pogleda코 predavanja, hopefully samo od toga shvati코 stvari, rije코i코 tih par zadataka koje uspije코 prona캖i, i hope for the best. Mislim, u jednu ruku je i cool, ali samo kad krene코 shva캖at stvari.",
      "votes": {
        "upvoters": [
          "1vq",
          "Filemon",
          "InCogNiTo124",
          "Janus",
          "iNavy (mornar Ica)",
          "zvucnik"
        ],
        "downvoters": [
          "macaklin"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218120": {
      "poster": "InCogNiTo124",
      "content": "@aux#218059 Uz rizik da bogohulim, utr i njegov prirodni nastavak ppj se ne uce iz srbljiceve biblije vec druge knjige\n\nCesta preporuka na internetima je Michael Sipser: Introduction to the Theory of Computation (3rd ed 2012, cengage) ili alternativno Automata and Computability (1997, Springer) ili 캜ak https://cglab.ca/~michiel/TheoryOfComputation\n\nZa ppj je no brainer uzet Cooper/Torzcon: Engineering a compiler, a ostale preporuke nalaze se [ovdje](https://gcc.gnu.org/wiki/ListOfCompilerBooks), [ovdje](https://stackoverflow.com/a/1672) i [ovdje](https://github.com/EbookFoundation/free-programming-books/blob/master/books/free-programming-books.md#compiler-design). Primjetite kako nigdje nema Jezicnih procesora \\:))\n\nI za kraj, ove knjige su cesto preopsirne i morat cete si pruneat gradivo, s druge strane fkt nije lose naucit malo vise",
      "votes": {
        "upvoters": [
          "Filemon",
          "Mikki",
          "Svarog (Veles)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "macaklin",
          "nnn (dinoo)",
          "zvucnik"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "243962": {
      "poster": "SaboteurSean",
      "content": "## Arhitektura ra캜unala\n\nIdeja ovog predmeta je da uzmete one stvari koje ste naucili na digitalnoj logici (ALU jedinice, bistabili, memorija i ostale gluposti) i spojite ih u primitivni komp koji ima procesor, ram i ulazno-izlazne sprave (na ovom predmetu ce se cesto na po캜etku bacati pojam \"von Neumannova arhitektura\").\n\nNaucit ce vas malo o arhitekturi te cete (na labosima) u virtualnoj masini pisati i izvoditi programe na tom zamisljenom procesoru.\n\nDakle, vise manje cete pisati kod u assembleru. Ovo je vrlo low level programiranje stoga je vrlo lagano za nauciti.\n\nGlavni \"problem\" su na ispitima meni bila teorija (koja je isto jednostavna, nista tesko za skuzit, ali ne zanimljiva) i to sto se trebas pozurit ako mislis stic napisat sve zadatke u assembleru na papiru. Prekide se treba dobro znat.\n\nSve u svemu nis pretesko, labosi znaju bit frustrirajuci jer ti ponekad virtualna masina ne radi, pa ti ne zeli kod izvesti jer kad si save-ao file nisi odabrao LF iz dropdown menu-a nego RF ili imas jedan razmak previse ili premalo. \n\nZapravo, jedino me to zivciralo kod predmeta, taj jebeni ATLAS, vise lupas tipkovnicu jer nemres uopce izvest \n\nprogram, a ne zato kaj je zadatak tezak. Cudno da nisu mogli napravit neki ljepsi program za simuliranje tog procesora (msm da nemres ni scrollat s misem u ATLAS-u), puno bi se lakse i brze naucilo.\n\nVrlo mi se svidjelo znanje koje sam pokupio na ovom predmetu.\n\n## Algoritmi i strukture podataka\n\nPao sam ZI jer nisam dovoljno ucio i nisam prag ispunio , dobio 4 na roku.\n\nNa predmetu se radi u C++, ali ja nisam nista o C++-u naucio niti ga se treba naucit.\n\nNemogu reci da je ista iz ovog predmeta tesko, meni je vjv najteze bilo one 3 razlicite slozenosti naucit.\n\nUce vas o listama, stogovima, heapovima, stablima i grafovima te o hashiranju (ovo je forica meni bilo, dost kul i jednostavan koncept kojeg nisam prije znao), sortiranju, neka 2 algoritma za pretrazivanje substringova u stringu i  algoritmi za prolazenje kroz grafove (DFS, BFS i dijkstrin).\n\nSve u svemu, nije tesko, ali je zajeb na ispitima na papiru sto dosta bodova znaju uzet ako kod bas nije vrlo slican onim iz preza, iako nisu ni prestrogi.\n\nKoliko sam ja vidio, na ispitima dolaze samo shell i quick sort tako da njih definitivno dobro naucite, zajedno sa stablima (tj. algoritmima za prolazenje stabla) i dijkstrom.\n\nSvidjelo mi se znanje koje sam naucio na ovom predmetu.\n\n## Diskretna matematika 1\n\nOvo mi je jedini predmet gdje mi je prvi ciklus bio tezi od drugog. U prvom ciklusu se radi kombinatorika preko funkcija izvodnica i nisam to skuzio bas, zatim se rade rekurzivne relacije(koje sam skuzio malo bolje od funckija izvodnica, ali ni to mi nije prejasno) koje se lako da naucit sablona za rijesavat i onda se krece na grafove jos u prvom ciklusu koji se nastavljaju do kraja drugog vise manje.\n\n Ovdje vas moram upozorit da ne budete debili ko ja i naucite to o grafovima za MI, ja sam isao kampanjski na to i nisam naucio osnovne stvari, a zadnji zadatak je iz grafova i vrlo je jebeno lagan, samo kaj ja nisam znao osnovne pojmove, tako da sam imao manje od pola na MI.\n\n Za ZI sam jedan put procitao skriptu to kaj se trazi i dobio sam oko 75%, tako da je meni bio taj dio fakat lagan.\n\nPredmet ima i labose koji su otprilike 6/10 po tezini.\n\nZnanje koje sam ovdje pokupio mi je onak, eh, iako je bilo relativno zanimljivo ucit o tom (drugi ciklus, ne prvi).\n\n## Teorija informacija\n\nCuli ste za TINF, reci cu vam isto ko i svi ostali, naucite gradivo za MI jer je pickin dim u odnosu na drugi ciklus. Ja sam bio glup pa nisam skupio puno bodova, pa sam pao ZI (jebem ti paritetnu matricu) i onda isao na rok. Imo sam 4, al mi je onda skinuo gospodin (znate o kom pricam) ocjenu na 3 (na rokovima gleda osobno zadatke, na ZI ne kolko sam skuzio). \n\nPredavanja sam gledao online kod Marina Vukovi캖a. Nit smrdi nit mirisi.\n\nUglavnom, naucite gradivo za MI, rijesite par zadataka i ustedite si zivce na ZI. \n\nSablonski predmet, nemorate opce nikad shvatit koji je kurac transinformacija i ostale gluposti (o spektru gustoce vala necu ni pricat jer nez opce kae to), nemoj te se ni zamarat.\n\nJedina dobra stvar je kaj cete vjerojatno dobiti neki Ba쬬ntov ispad u obavijestima, to uvijek bude fora.\n\n## Vjerojatnost i statistika\n\nVelika pusa mom ispravljacu na zimskom roku, ocito je bio na drogama hihi :*\n\n## Okoli코, odr쬴vi razvoj i ubla쬬vanje klimatskih promjena\n\nPolagao sam ga online, tako da sam ulozio onoliko vremena koliko treba da napises MI i ZI, ne sijecam se opce jel bilo zadace il neceg osim MI i ZI.\n\n## Baze podataka\n\nHere we go.\n\nSQL upiti - SQL je vrlo lagan jezik za razumijeti i nauciti - to me sjebalo jer ga nisam izvjezbao, samo sam ga \"znao\" i \"ma snaci cu se ja na ispitu\".\n\n Za MI sam prolistao kroz prezu za SQL i ucio vise druge stvari. Ocekuje se od vas da poserete 3 SQL upita ko iz picke, a ako\n\nniste ulozili barem 2 sata (ako si genijalac, realnije je 6-10 sati) vjezbanja nakon sto ste prosli prezentaciju, necete to uspjet, ili cete se predugo zadrzat ko ja. Iako to mozda vama nece bit problem jer pisete na papiru, neznam.\n\nJedino sto znam je da sam isao na rok. Rok ima pismeni dio, koji ako dobite prag od 50%, mozete pristupiti usmenom ispitu. Zbilja vam preporucam da ne zavrsite na roku.\n\nSamo gradivo predmeta je dosta lagano i jednostavno za razumjet, ali sama kolicina vremena koja treba da se sve rijesi i napise na roku je ogromna. Od nas 69 koji smo pristupili, 13 nas je imalo vise od 50% (10 nas je imalo tocno 50%, 3 je dobilo vise). Usmeni je lagan, postoji baza pitanja koja se cesto ponavljaju.\n\nUglavnom, za SQL, naucite dobro razlicite joinove (left/right, outer, inner, ne sijecam se vise),if/cases, kako baratat sa stringovima (concating), kako raditi sa datumima/vremenom, te ove stvari: group by, having(msm da kad imas group by da moras imat i having), distinct, order by, agregatne funkcije.\n\nOni vas u 3 zadatka (zapravo jedan zadatak sa 3 podzadatka) pokusavaju ispitati svo gradivo SQL-a, stoga ih sastavljaju tako da sve trebas iskoristit kaj si naucio.\n\nTako캠er **DOBRO PAZITE** da skupite 50% bodova iz zadace i labosa (ne mozete uopce na jebeni rok izac, **AUTOMATSKI PAD**, vidimo se iduce godine). 1. labos nisam bio, 2. labos je relativno lagan (ER model)\n\n i vrlo je slican zadaci kojoj ce vam dati prethodno, tako da se na tom 2. labosu da skupit puno bodova lagano, 3. labos je tezi i mislim da se teorijska pitanja i par linija koda, mozda postoji i 4. labos nisam zih vise.\n\nZI je problematican jer ima puno gradiva, ali ce doc otprilike po jedna (glavna) stvar iz svake prezentacije, rokajte po ispitima proslih godina, i shvatit cete sablonu (pogotovo za ER model) i sto treba naucit.\n\nSve u svemu, predmet me izjebao u mozak, ali krivica je uglavnom na meni jer sam podcijenjivao predmet, iako jebem i ja njima mater.\n\nDosta su strogi pri ispravljanju i mala greska moze prouzrocit puno izgubljenih bodova.\n\nZnanje koje cete dobit na ovom predmetu (SQL, ostalo je vise manje nebitno) je vrlo bitno. \n\n## Komunikacijske mre쬰\n\nPredmet vas uci kako funkcionira internet. Postoje zadace i labosi, u virtualnoj masini se rade labosi, analizira se mrezni promet izmedu racunala i unutar mreza. Labosi i zadace nisu teski, samo treba vremena za napisat ih. Daju vam pdf sa pitanjima i imate tjedan il nez kolko vec da predate pdf sa odgovorima. Ovdje cu vam reci da sam ja dosta sturo i kratko\n\nodgovarao na pitanja i nisu me kaznjavali previse za to (mislim da sam imo 90% bodova), tako da je definitivno plus kaj ne jebu previse s tim. \n\nMI i ZI su mi bili lagani, cijeli me predmet zanimao tako da mi nije bilo problem ucit, ali to je subjektivno.\n\nZnanje koje sam pokupio na predmetu mi se svidalo.\n\n## Operacijski sustavi\n\nHihihi hohoho.\n\nNisam predao 1. labos, tj. nisam ga zakljucao na ferku do nekog datuma, iako sam pred asistentom pokazao da radi i odgovorio na njegova pitanja i dobio vecinu bodova. Zbog toga nisam imao 4 na ovom predmetu, nego 2 (dobio sam -15 il -20 kao da sam jedan od onih prljavih plagijata :( ) iako se valjda ne bih trebao zaliti jer je preduvjet za prolazak predmeta i uopce za izlaz na ZI zakljucati labose na ferku(moze i prazna fajla biti, ali zaboga nemojte da vam se ovo desi, morat cete ga iducu godinu polagat).\n\nMI ima dosta sablonskih zadataka koji su lagani za naucit.\n\n75% ZI je sablona, ostalih 25% je gradivo sa MI. Pogledajte stare ispite, pogledajte sta dolazi i to naucite - imao 37/40 na ZI, u jednom danu se da to naucit.\n4. labos je najlaksi, ostali su me malo izjebali jer uvijek neki kurac ne radi pa se treba poslat mail asistentu il pitat kolege na discordu. Imam ptsp od djeda bozicnjaka i sobova i patuljaka. Provjeravaju plagijate.\n\nZnanje sa ovog predmeta je bilo zanimljivo meni.\n\n## Razvoj programske potpore za web\n\nNa ovom cete predmetu nauciti HTML, CSS, JavaScript neke osnove, HTTP zahtjeve te kako napraviti web stranicu (o onom serveru u javi je bolje i ne pricat). Web stranica se\n\nradi sa node.js. Ima 4 labosa: 1. je HTML + CSS 2. je JavaScript al se ne sijecam tocno kaj, 3. je u node.js i 4. isto. Za svaki se dobije priprema koja se treba samostalno rijesit\n\n i meni je osobno dugo trebalo za svaku tu pripremu (barem 6 sati? iako sam i to malo rekao), provjeravaju plagijate i mislim da je 50% bodova prag na labosima.\n\nNa 1. labosu nisam bio, 2. me zbog toga izmucio jer trebas znat to gradivo 1. labosa da ga rijesis, 3. sam sjebo nisam uspio ni pripremu napravit, a 4. sam sve tocno napravio (u ovom se koristi znanje iz baza podataka).\n\nSve u svemu, sad kad sam prosao, svidaju mi se labosi jer su me naucili napravit web stranicu, sad se osjecam ko da cijeli web dev znam i ko da mi nista nebi bio problem.\n\nIspiti su na papiru, na MI smijes imat 1 A4 salabahter (dvostrano), na ZI 2 A4 salabahtera (isto dvostrano), vrlo korisno. Nemogu rec da su ispiti nes previse teski, jedino je \n\ntesko kaj se na predmetu dosta uci i pitaju dosta stvari koje neces ucit napamet nego ces Googlat u pravom zivotu, i ak ne napravis dobar salabahter si se sjebo.\n\nKao sto rekoh, vrlo mi se svida znanje koje sam pokupio na ovom predmetu.\n\n## Uvod u teoriju ra캜unarstva\n\n4 labosa (7+7+8+8), prag 50%, provjeravaju plagijate nemojte se sjebat na tom. Nau캜io sam predmet kroz predavanja na YouTube-u. Nije to lo코a ideja ako stavi코 na 1.5, iako\n\nsu i tada malo prespora. Za MI se rade deterministicki i nedetereministicki konacni automati, mealy-ev i moore-ov automat (na diglog se isto to radi) i minimizacija, potisni automat,\n\nregularni izrazi (regex), gramatika, parsiranje i Chomskyjev normalni oblik. To je sve lagano. Jedino je na MI teze Greibachin normalni oblik i svojstvo napuhavanja koje nikad nisam potpuno zapamtio/shvatio.\n\nU drugom ciklusu se gradivo otezava - prvo ide turingov stroj, gramatika neogranicenih produkcija i kontekstno ovisni jezici, linearno ogranicen automat, izracunljivost i odlucivost i kontekstno ovisna gramatika. To\n\nje sve vise manje lagano. Onda idu neki DSPACE, DTIME, NSPACE, NTIME koji su te코ki i nebih znao o njima mnogo. Dakle, ima puno teorije i algoritama za naucit i zapamtit.\n\nSada malo o labosima - trebate proci prvih 2-3 sata teorije na YT i odmah se mogu rijesiti prva 2 labosa, tako da vam preporucujem da to napravite, iako nije hitno ni nis, samo ce vam bit lakse da se mozete fokusirat na druge stvari.\n\nLabosi su lagani za dobit >50%, ali teski za dobit svih 100%.\n\nShvacam zasto nas uce ove stvari (zapravo i ne bas, ali kazu da je korisno), ali mi se nije svidijelo ucit gradivo. (Automati su lagani tho)\n\n## MENTORSTVO\n\nKada upisujete 3. godinu/5. semestar, morate odabrati mentora. Ako ga ne odaberete, tj. ako se ne dogovorite prethodno za nekog specificnog mentora, bit ce vam dodijeljen neki random. Ljudi su poceli traziti mentore pocetkom 4. semestra, ja sam to napravio par dana prije upisa u 5. semestar. Prekasno sam saznao za to pa jebiga. Uglavnom, nije smak svijeta ako trazite u zadnju sekundu, ali imajte na umu da sto prije pocnete moci cete si osigurat nekog u podrucju koje vas zanima.\n\nKada im saljete mail, spomenite im vas prosjek studija (mozete na studomatu vidjet) i imajte na umu da vas mogu traziti da upisete neki predmet koji oni traze.",
      "votes": {
        "upvoters": [
          "Mars (mars_)",
          "gladiator",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "283450": {
      "poster": "[deleted]",
      "content": "Pozdrav i dobrodo코li u jo코 jednu moju kroniku review semestra koji je iza mene.\n\nda ne duljim\n\n## ViS\n\nBit 캖u iskren i predmet mi je bio te쬬k, to jest da budem precizan bio mi je te쬬k dok nisam prigrlio apstrakciju i par puta pro코ao Elezovi캖evu knjigu, treba dosta raditi ako 쬰li코 da ti ba코 sve sjedne kako spada, a nakon toga je predmet kamilica. Zna캜i moj savjet je dobrih 40% u캜enja posvetiti samo ovome predmetu. Rade se 3 labosa koji su vi코e kao seminari o tome kako radi R. Iz R-a se pi코e kpz koji nosi 10 bodova i njegova te쬴na je izme캠u 4/10 i 9/10 ovisi koja pitanja vas potrefe. Za prolaz standardnih 45, pa ako vam ide kombinatorika (ve캖ina prvog ciklusa je klasi캜na vjerojatnost *캜itaj* kombinatorika) imate defacto free prolaz. Uzmite ovo s dozom soli jer sam ja tryhardao premdet za ocjenu pa mo쬯a ni ne treba tolko vremena rokat ako vam je samo do prolaza. Je li predmet koristan? Jest, ako ni zbog 캜ega onda zbog op캖e kulture kad vas neko pita trebate li promjeniti vrata u nagradnoj igri.\n\nZa predavanja preporu캜am lenku, ako 쬰lite prolaz i Vel캜i캖a ako ustvari 쬰lite ne코to i nau캜it.\n\nTe쬴na: **7 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## ARH1\n\nLagani assembler i osnove (al stvarno osnove) dizajna procesora i ra캜unalnih sustava. Meni je predmet bio ful zanimljiv (meni ve캖ina jest pa vam to ne zna캜i puno). Nema neke razlike u ciklusima (glede te쬴ne). Sve se *defacto* svodi na pisanje programa doma i vje쬭anja. Odvojite tjedno 3 sata da malo pro캠ete preze i napi코ete par program캜i캖a i o캜ekujte 3/4 bez puno muke. Labosi su relativno lagani ako pratite ovu 코prancu s malo vje쬭anja kroz tjedan. Predavanja su svi profesori izvrsni po meni, al ja sam slu코ao Kova캜a i Hoffa i iskreno ne znam kojeg bi vi코e nahvalio. Predmet je op캖a in쬰njerska kultura (u daljnjem tekstu oik).\n\nTe쬴na: **4 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## DISMAT 1\n\nRadi se malo naprednija kombinatorika, rekurzivne relacije (캜itaj fibonnaci, i dinami캜no programiranje na matemati캜ki na캜in) i 코e캖er na kraju grafovi. Dobra (po meni lo코a) stvar je 코to se prvi ciklus svede na 코ablonu, nau캜ite algoritme kako rije코iti zadatke i deri po zadatcima iz skripte (a ima ih) i mogu se skupiti lagani bodovi. Teorija grafova je ne코to ko integriranje u vi코e dimenzija, ako ima코 unutarnji osje캖aj za to vizualizirat si i predo캜it bit 캖e ti najlak코e gradivo koje se radi u prva 3 semestra. Ako nema코? he onda si  semi fucked, sjedi i pro캠i tu skriptu dok ti stvari ne po캜nu imat koliko toliko smisla i bit 캖e okej. Ja sam slu코ao Osvina najvi코e i bio je dobar, simpati캜an i 코a코av. Predmet ima 3 labosa gdje treba implementirati neki NP alogritam. Meni su sva 3 pro코la s nekim rudimentarnim backtrackingom. Koristio sam C iako nema restrikcije na jezik, ako vam ide arh oku코ajte se u assembleru :). Korisnost? OIK.\n\nTe쬴na: **2 / 10 ili 3-8 / 10**\n\nKorisnost: **3? / 10**\n\nBih li preporu캜io/la predmet: **Da**\n\n## ASP\n\nmem캜uga. Free prolaz. FER je uspio napraviti 코ablonu iz predmeta koji se zove algoritmi, ne znam 코to vi코e re캖i o tome. Ispit se sastoji od crtanja sortova i pisanja rekurzija, ako niste nikad ozbiljno gledalu algoritme ovo je entry level tutorial i ne캖ete imat problema, ako jeste ovo vam je free pass i hranjenje ega. Korisnost? OIK.\n\nTe쬴na: **2 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporu캜io/la predmet: **NE**\n\n## OOKRUP\n\nneradnik 코krlec odlucio prestat bit neradnik u europarlamentu i odlu캜io bit neradnik na feru. Predmet katastrofalan i beskoristan. Pragovi na svemu al nije prete코ko. Korist? nula, zero, nichts, NULL.\n\nTe쬴na: **3 / 10**\n\nKorisnost: **-besk. / 10**\n\nBih li preporu캜io/la predmet: **Ne**\n\n## NATPRO\n\nVje코tina i to izvrsna vje코tina, super zada캖e, super zadatci, super predava캜i (kolege studenti) i super materijali, za svaku pohvalu i najbolji predmet semestra. Lagano je pro캖i ako radite, meni je ovo prvi susret s \"hc\" algoritmima i bilo je fakat ugodno i zanimljivo, preporu캜ujem! Korisnost? Ako ste nabrijani na code intervjue hehe. Reko bi Boti캜ki ovo je predmet za intelektualnu razonodu. Ne mora uvijek sve bit korisno kaj ne?\n\nTe쬴na: **6 / 10**\n\nKorisnost: **? / 10**\n\nBih li preporu캜io/la predmet: **DAA!**",
      "votes": {
        "upvoters": [
          "Ksai8",
          "[deleted]",
          "indythedog"
        ],
        "downvoters": [
          "HARAmara (decko_sa_balkana)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}