{
  "title": "[IIKT] Predmeti 1. godine diplomskog studija",
  "creator": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
  "slug": "iikt-predmeti-1-godine-diplomskog-studija",
  "tags": [
    "FER",
    "Op캖enito",
    "Informacije o predmetima"
  ],
  "posts": {
    "44429": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "Ovdje mo쬰te podijeliti iskustva, preporuke i/ili pitati u vezi predmeta **1. godine diplomskog studija [u]informacijske i komunikacijske tehnologije[/u]**.\n\nUkoliko 쬰lite podijeliti mi코ljenje(a) o predmetu, mo쬰te koristiti sljede캖i predlo쬬k:\n\n```markdown\n## Ime predmeta\n\nne코to o predmetu\n\nTe쬴na: **? / 10**\nKorisnost: **? / 10**\nBih li preporu캜io/la predmet: **Da / Ne**\n```\n\n코to 캖e rezultirati:\n\n>## Ime predmeta\n\n>ne코to o predmetu\n\n>Te쬴na: **? / 10**\n\n>Korisnost: **? / 10**\n\n>Bih li preporu캜io/la predmet: **Da / Ne**\n\nNije imperativ da koristite ovakav predlo쬬k (ili bilo koji drugi), ali ovo izgleda sa쬰to i vjerujem da uz najmanji trud i najmanje tipkanja mo쬰te ponuditi lijepo formatirane informacije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52552": {
      "poster": "Majmanko",
      "content": "Ima netko neki savjet kaj upisat? Dojmovi predmeta?",
      "votes": {
        "upvoters": [
          "SinanSuckich (Yelena)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52559": {
      "poster": "RS7",
      "content": "Netko Sigurnost u Internetu?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52664": {
      "poster": "Wilshere10",
      "content": "## Digitalna obrada govora \n\nDOG je jedan od 코est predmeta specijalizacije profila koji se mo쬰 izabrati u prvom semestru. Predavanja dr쬴 prof. Davor Petrinovi캖, no kako predmet upi코e 15-ak studenata godi코nje bio sam sam s profesorom na predavanjima. Iako profesor jako dobro predaje gradivo i potrudi se zainteresirati studente, nakraju sam drugi ciklus i ja odustao. Ako tra쬴te neki lagan predmet, a da je uz to i relativno zanimljiv DOG je idealan. U semestru postoje samo dvije laboratorijske vje쬭e na kojima se ne코to casual pr캖ka po ra캜unalu sat i pol. Nosi ukupno 10 bodova. 20 bodova nose dvije doma캖e zada캖e kojima je rok za predaju krajem prvom mjeseca (mogu se predati bilo kad ranije). Na stranici predmeta postoji dokument s uputama, student na vje쬭i snimi svoj glas koji onda kod ku캖e po uputama provla캜i kroz neki pripremljen kod i zapisuje opa쬬nja. Da bi se to napravilo sigurno treba par dana posla, no izvje코taji se kako sam rekao predaju krajem prvog mjeseca pa imate 3 mjeseca za to napraviti.\n\nMI i ZI nose svaki po 30 bodova, postoji ukupni prag 30/60 bodova. Na ispitu do캠e 5-10 esejskih pitanja, na stranici predmeta postoji popis pitanja koja mogu do캖i, u prosjeku ih treba nau캜iti 50-ak za MI i isto toliko za ZI. Na laptopu imam i word s odgovorenim pitanjima pa 캖u i to staviti. Ispiti nisu te코ki i mislim da se daju spremiti jako brzo 캜ak i da niste posje캖ivali predavanja ili radili kontinuirano. Tako캠er, postoji i usmeni ispit koji nosi preostalih 10 bodova, no nije obavezan.\n\nSadr쬬j predmeta: na po캜etku se u캜i o glasovima, procesu nastajanju govora, model vokalnog trakta. U to se poslije ukomponira pri캜a o spektrima i digitalnoj obradi, modelira i analizira se matemati캜ki. Sve u svemu ni코ta preslo쬰no, a opet zanimljivo 캜ak i ako se ne mislite ozbiljnije baviti time. Preporu캜ujem.\n\n\n\nTe쬴na: **3 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporu캜io/la predmet: **Da **",
      "votes": {
        "upvoters": [
          "Bisenberg (DonaldPump)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53063": {
      "poster": "Bisenberg (DonaldPump)",
      "content": "Ne znam gdje bih drugo postavio ovo pitanje, koliko sam sku쬴o ovaj smjer op캖enito nije najpopularniji te ga upisuje 20ak studenata godi코nje. Iz tog razloga nemam previ코e povratnih informacija kao 코to su 코to se uop캖e tu radi, kakvi su opisi potencijalnih poslova, koliko ima prostora za vi코e istra쬴va캜ki rad, op캖enito ho캖e li mi 쬴votno financijsko blagostanje podnijeti veliki udar ako se vi코e opredijelim za ovakvo zanimanje....\n\nRazmi코ljam se o be쬴캜nim komunikacijskim tehnologijama, gledao sam ponu캠ene predmete i 캜ini mi se jako zanimljivo, ali kao 코to rekoh, jako je te코ko do캖i do dojmova.\n\nPostoji li neki HC 캜ovjek za to podru캜je da napravi mali esej o temi ??\n\nPomoz'te 캜ov'ku :)",
      "votes": {
        "upvoters": [
          "Mylorad",
          "rhythm_controll"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53285": {
      "poster": "logitech",
      "content": "Preporuka predmeta iz skupine preporu캜enih izbornih predmeta koji je najlak코e za pro캖i 游뱁?",
      "votes": {
        "upvoters": [
          "ates"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53810": {
      "poster": "Wilshere10",
      "content": "@logitech#53285 Pretpostavit 캖u da misli코 na predmete matematike, fizike i prirodoslovlja.\n\nOno 코to je mene poslu쬴lo jako dobro je 코to sam upisao predmete koje je dr쬬la prof. Sanda Plesli캖, jako kul i chill profesorica. U 1. sem je to bio predmet _Osnove fizike plazme_, a u drugom _Osnove nuklearne fizike_, zvu캜i jako higl level na prvu (i u teoriji je), ali 코to se ti캜e samog prolaska predmeta su vi코e nego korektni. Ukratko, 25 bodova je nosio seminar, a 5 bodova prisutnost na predavanjima (gdje je trebalo pojaviti se na 5 od 13 predavanja), 코to je ve캖 30 bodova. Ostalih 70 bodova su MI + ZI (pola bodova T/N zadatci + 5 ra캜unskih uvrsti u formulu) s time da je profesorica na predavanju koje je tjedan prije ispita rekla kojih 5 zadataka dolazi i rije코ila ih i pokazala T/N zadatke na prezentacijama i objasnila. Identi캜an koncept je i Osnove nuklearne fizike.",
      "votes": {
        "upvoters": [
          "Ksai8",
          "Lusy (MGJ)",
          "logitech"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53813": {
      "poster": "logitech",
      "content": "@Wilshere10#53810 \n\nMislio sam na predmete iz skupine preporu캜enih izbornih predmeta iz tre캖eg semestra, ali hvala i za ovaj info 游.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53815": {
      "poster": "Wilshere10",
      "content": "Iz skupine humanisti캜kih predmeta redom sam slu코ao Biblijska telogija 1 (1.sem), Biblijska teologija 2 (2.sem) i Organizacijska teologija (3.sem). Za biblijsku teologiju 1 i 2 su se profesor i asistentica Tanja Laki캖 potrudili da nitko ne pada njihove izborne predmete. Organizacijska psihologija je vjerojatno jedini lak코i predmet iz te skupine i puno studenata prvo upi코e to, no onda u 2.semestru ne znaju 코to bi upisali jer je Biblijska teologija 2 predmet s preduvjetom i moraju upisat neki random predmet koji mo쬰 ispast i kompliciran. Zato bih ti preporu캜io to캜no ovaj redoslijed.\n\n맚o se samog predmeta ti캜e, biblijske telogije imaju povremene moodle zada캖e (ni코ta te코ko), a ispit ima코 pitanja koja mo쬰코 nau캜it. Ako ne nau캜i코 odgovore napamet ne brini, ispit se pi코e 3h i na ispitu je dozvoljeno imati Bibliju. Pitanja budu koncipirana na na캜in \"U knjizi toj, u poglavlju tom, u retcima tim i tim, Bog se obra캖a kome...\" i kad na캠e코 taj redak pi코e ti tipa \"I re캜e Bog Jahveu...\" i zaokru쬴코 Jahve. Cilj samog predmeta je da se studente zainteresira za prou캜avanje bilijskih tekstova i takva forma ispita slu쬴 캜isto da natjera studenta da pro캠e kroz neke od tih tekstova. Preporu캜ujem.\n\nOrganizacijska psihologija je definitivno najlak코i predmet. Mislim da ispiti nose nekih 40-ak bodova, ali imaju pitanja koja se uvijek ponavaljuju. Ostatak bodova su 캜ini mi se predavanja i neki seminari, ali nisam se bak캖ao s time pa ne znam detaljnije.",
      "votes": {
        "upvoters": [
          "logitech"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53818": {
      "poster": "SinanSuckich (Yelena)",
      "content": "Kakve su preporuke za TKI, sta uzet, sta ne uzet?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53819": {
      "poster": "Wilshere10",
      "content": "Za preporu캜ene izborne predmete ne znam, upisivao sam one koji zvu캜e medicinski (prof. Mario Cifrek) i bili su 캜isto okej. Za ostale ne znam, ali rekao bih da je 80% predmeta s tog popisa formalno i ni코ta te코ko.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53952": {
      "poster": "nickname",
      "content": "DOS i NMDOS? Tipi캜an SIS ili vi코e od toga? lol",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "55981": {
      "poster": "podatko",
      "content": "@SinanSuckich#53818 \n\n**Teorijski predmeti profila**: Fotoni캜ke + KomPro. Fotoni캜ke meni osobno bile dosadne, srednje zahtjevne za polo쬴ti. KomPro ne코to zanimljiviji, tako캠er ne prete쬬k, ali mogli bi malo modernizirati labose... RasSus nisam imao, ali na glasu je kao najte쬴 od ta tri teorijska.\n\n**Obvezni predmeti**: Informacijske mre쬰 - Ili캖ev predmet, moja topla preporuka i캖i na predavanja, Ili캖u je to dosta bitno i puno je lak코e pro캖i kontinuirano.\n\n**Laboratorij telekomunikacija i informatike 1**: obuhva캖a labose teorijskih predmeta profila + labosi iz informacijskih mre쬬, ni코ta prestra코no, kao 코to sam ve캖 rekao, mogli bi se labosi malo modernizirati, ali 코to je, tu je.\n\n**Predmeti specijalizacije profila**: Satelitske kom. tehnologije, ispiti se ponavljaju, te코ko je imati manje od 4.\n\n**Predmeti matematike, fizike i prirodoslovlja**: Ekstremalna kombinatorika - lak코a od matematika s preddiplomskog studija, ali ne ba코 prejednostavna, ako tra쬴코 najlak코i predmet, vjerojatno postoje bolji izbori.\n\n**Humanisti캜ki ili dru코tveni predmeti**: Biblijska teologija 1 - sve preporuke za upis ovog predmeta (i za njegov nastavak u ljetnom semestru), jako lagano, profesor i asistentica super ljudi",
      "votes": {
        "upvoters": [
          "Majmanko",
          "Wilshere10",
          "menace_master",
          "username"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "57327": {
      "poster": "logitech",
      "content": "@podatko#55981 \n\nMo쬰 info za tre캖i semestar?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61846": {
      "poster": "a2g0",
      "content": "1. semestar Teorijski predmeti profila preporuke (sto lakse i bezbolnije)?\n\nkoji bi modul preporucili iz skupine Informacijska i komunikacijska tehnologija(sto lakse i bezbolnije)?\n\ni jel treba ak smo kod ilica uzet neke njegove predmete?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61859": {
      "poster": "a2g0",
      "content": "i ljetni semestar koje sve predmete da upisem pod istim uvjetima?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "62878": {
      "poster": "Mose",
      "content": "Mo쬰 info za Planiranje mobilnih sustava, koliko je korisno i te코ko za pro캖?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "131005": {
      "poster": "deus_vult",
      "content": "Jel tehnologija umre쬬vanje skroz novi predmet il modulacija nekog postoje캖eg i kojeg ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "131089": {
      "poster": "SinanSuckich (Yelena)",
      "content": "코ta planirate za ljetni semestar, moze netko stariji preporuke?",
      "votes": {
        "upvoters": [
          "Dado95",
          "whatTheHel"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138089": {
      "poster": "Majmanko",
      "content": "@podatko#55981 Mo쬰 pls za ljetni semestar? :)",
      "votes": {
        "upvoters": [
          "RS7"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139236": {
      "poster": "nickname",
      "content": "Odabir predmeta za ljetni semestar je kriti캜an",
      "votes": {
        "upvoters": [
          "Hunet",
          "Majmanko"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "142096": {
      "poster": "Nemo",
      "content": "Molio bih za bilo kakvu pomo캖 u odabiru izme캠u 'Formalne metode u oblikovanju sustava' i 'Pouzdanost telekomunikacijske mre쬰'",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "145732": {
      "poster": "Mylorad",
      "content": "**Videokomunikacijske tehnologije**\n\nSonja Grgic, kraljica.\n\nNa predavanjima se rje코avaju zadaci koji 캖e bit za zada캖u, zadaci iz zada캖e su zadaci na ispitu.\n\nPro코ao prije zavr코nog.\n\nKORISNOST: 5/10\n\nTE콯INA: 2/10\n\nPREPORUKA: DA\n\n****",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "145756": {
      "poster": "Mylorad",
      "content": "**Videokomunikacijske tehnologije** \n\nSonja Grgi캖, kraljica.\n\nNa predavanjima se rje코avaju zadaci koji 캖e bit za zada캖u, zadaci iz zada캖e su zadaci na ispitu.\n\nPro코ao prije zavr코nog.\n\nKORISNOST: 5/10\n\nTE콯INA: 2/10\n\nPREPORUKA: DA\n\n**Opti캜ki komunikacijski sustavi**\n\nZoran 말pu코, du코a.\n\nNa predavanjima zna biti malo dosadno, ali je predmet zanimljiv.\n\nNa MI su se ponovili neki zadaci s pro코lih godina + teorija na zaokru쬴vanje.\n\nZI je projektiranje linkauz ispunjavanje tablice, po meni lak코e od MI.\n\nUsmeni je po pitanjima s Gita i stvarno te \"vodi za ruku\" i daje koliko god mo쬰코 dobit, ali mora코 barem ne코to znat.\n\nKORISNOST: 7/10\n\nTE콯INA: 4/10\n\nPREPORUKA: DA\n\n**Mobilni internet**\n\nMislav Grgi캖, biv코i nam dekan, je predavao ove godine. Odr쬬o je 2 predavanja, ostala su bila gostuju캖a. Gosti su ljudi iz struke (OIV, A1, Tcom) i njihova predavanja su jako korisna kako bi studenti dobili uvid u njihov budu캖i posao.\n\nDobivaju se bodovi za prisutnost a predavanjima(8 svako).\n\nUsmeni je u vrijeme MI i pita te osnove mre쬰 i 5G. Nema pismenog. Gotovo.\n\nIdealni kolegiji don't exi.. \n\nKORISNOST: 8/10\n\nTE콯INA: 1/10 (Mislim da su skoro svi imali 5)\n\nPREPORUKA: DA\n\n**Kvantna ra캜unala**\n\nSa코a Iliji캖, genije ispred svog vremena.\n\nPrepi코ite ve캖 rije코ene zadatke, nau캜ite one koja rije코i u zadnja dva predavanja prije ispita, done.\n\nPro코ao na 2. zada캖i, odnosno prije ZI.\n\nKORISNOST: 3/10\n\nTE콯INA: 1/10\n\nPREPORUKA: DA\n\n**Biblijska teologija**\n\nOnline Isus.\n\nIspiti online na zaokru쬴vanje, 80% pitanja na Gitu.\n\nKORISNOST: 1/10\n\nTE콯INA: 0/10\n\nPREPORUKA: DA\n\n**Mikrovalna elektronika**\n\nDavor Bonefa캜i캖, 캜ovjek koji misli da ljudi ne코to nau캜e na faksu. Ozbiljno sad, kao profesor je jako dobar, uvijek spreman pomo캖i, ali ja bih stvarno volio da me i코ta u 쬴votu zanima koliko njega zanima elektronika. Respektam predanost.\n\nOVO JE ELEKTRONIKA u mikrovalnom podru캜ju. Zna캜i ako niste s elektronike, ne upisujte, bit 캖ete kao ribe na suhom.\n\nSAVING GRACE je da se zadaci ponavljaju, ali to ne zna캜i da su svi ve캖 rije코eni i da ih je imalo lako zapamtit.\n\nUsmeni je bio moodle zaokru쬴vanje, uploadam zadatke kasnije.\n\nOvaj kolegij ne pripada na modul BKT, a sljede캖e godine se spaja s visokofrekvencijskom elektronikom, nek vam je Bog na pomo캖i.\n\nNe znam koliko su alternative te코ke, ali ostale kolegije u semestru sam pro코ao prije zavr코nog, ovo sam i코ao na rok.\n\nNakon ovog ranta, htio bih samo napomenuti da na ovom kolegiju rade jako sposobni i dragi ljudi i da preuzimam odgovornost za gre코ku upisa ovog kolegija.\n\nKORISNOST: 2/10 (na ovom smjeru, ina캜e 7/10)\n\nTE콯INA: 7/10 (online usmeni me spasio, ina캜e bih ostao na ovome do kraja studija)\n\nPREPORUKA: NE\n\n**Review semestra**\n\nPrvi semestar diplomskog je bio drasti캜no lak코i od svih dosada코njih semestara na preddiplomskom. Uspio sam raditi 50 do 100 sati mjese캜no uz faks. Semestar bi bio te쬴 da nije bilo korone. Labosi su sprdnja i trebalo bi ih maknut, nemaju veze sa \"stvarnim poslom\", pls fix.",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "fk2020 (crocs)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "145800": {
      "poster": "Mylorad",
      "content": "@Mylorad#145756 \n\nZvonimir 말pu코*\n\nIsprike, obolio sam na mozak malo, write is hard",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231746": {
      "poster": "pcharlie",
      "content": "Ima li ovdje mozda netko s automatike da napise dojam o predmetu \"Racunalno upravljanje sustavima\"? \n\nNauci li studente stogod taj predmet? Takoder, koliko je opterecujuc za polozit?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231798": {
      "poster": "GileTheGreat",
      "content": "@pcharlie#231746 \n\nMi smo ga ina캜e imali na preddiplomskom kao obavezan predmet, predavanja obavlja Marija Seder a vje쬭e ispravljaju Luka i Borna, vje쬭e su se ponavljale kao i zadaci s ispita (ima skripta na stranici predmeta i na slicnu/isu shemu dodju zadaci na ispitu). Sto se samog predmeta tice, kao sto prva recenica u opisu predmeta kaze: \"Automatsko upravljanje sustavima podr쬬no ra캜unalom\", imas nesto slicno kao automatsko upravljanje, uz dodatke poput Ziegler-Nichols metode, Strejc, Kupfmuller itd.. Labosi su ja mislim unaprijed pripremljen kod + samostalna dopuna studenta (malo funkcionalnog koda + funkcije za plot). Popuni se izvje코캖e i predas i to je to (mislim da se ni ne ide na labos vec se samo preda ko DZ).",
      "votes": {
        "upvoters": [
          "pcharlie"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231846": {
      "poster": "pcharlie",
      "content": "@GileTheGreat#231798 \n\nHvala ti :)\n\nZvuci kao nastavak automatskog upravljanja",
      "votes": {
        "upvoters": [
          "GileTheGreat"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231853": {
      "poster": "Fast-and-Fourierous",
      "content": "Ima li netko iskustva s ovim predmetima: **Biomedicinska informatika**, **Biomedicinski signali i sustavi**, **Obrambeni sustavi i tehnologije**? Ima li puno posla? Vidim da svi imaju neki seminar/projekt. To su izborni predmeti u 3. semestru.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231921": {
      "poster": "GileTheGreat",
      "content": "@Fast-and-Fourierous#231853 \n\nImao sam Obrambene sustave. A to je recimo vise kao teorijski predmet sa labosima, a na labosima (2 ih je) zapravo im slu쬴코 kao tester njihovog projekta koji ispituje rezilijentnost na stres. Prikopcan si na elektrode za ekg i emg, te imaju kameru koja prati sirenje/skupljanje zjenice. Rje코ava코 neke testove prvo (pam캖enja) a nakon toga ti pustaju 30min neke zvukove raznih frekvencija i onda se mjeri puls, sirina zjenice itd. Za ispite postoje neka pitanja na stranici i nesto od toga do캠e + preznetacija + labos (tipa sto se mjeri upitnicima na labosu).. Predavanja su tragikomedija, predaje general Cosic ..skupljaju se neki bodovi ako si na predavanju (ove akademske godine na teamsu) ali i bez toga mozes imat 5. Usmenog nema, samo MI i ZI za koje ces imat pitanja koja treba proc, pa ce se nesto od toga pojaviti. Zapravo je i zanimljiv predmet ako te zanima vojska, sustavi obrane i na코 raketni sustav iz 1991.",
      "votes": {
        "upvoters": [
          "Amon",
          "Fast-and-Fourierous",
          "Filemon",
          "Mioch",
          "[deleted]",
          "a_ko_si_ti"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231924": {
      "poster": "Fast-and-Fourierous",
      "content": "@GileTheGreat#231921 To 캜ak dobro zvu캜i. A 코to je sa seminarom? Vidim na ferwebu pi코e da seminar nosi 50% bodova (0% prag). Mo쬯a su to zapravo ti labosi po코to ne vidim da su oni navedeni u tablici...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231925": {
      "poster": "GileTheGreat",
      "content": "@Fast-and-Fourierous#231924 \n\nda, seminar je zapravo taj izvjestaj s labosa. Za prvi labos je seminar skroz lagan, al za drugi je malo tezi jer moras citat njihove clanke na engleskom i predavanja i opisiva캜ki odgovarati na pitanja (mislim da je bio limit da odgovor mora imati 3-5 SREDNJE DUGIH recenica). ali imas dosta vremena za to (2.labos bude zadnji tjedan prije bozicnih praznika) i onda imas do tjedna kad je ZI vremena za predati. Svi su dobili dosta bodova, jer za sve mozes nac odg sto na netu, sto na prezama.",
      "votes": {
        "upvoters": [
          "Fast-and-Fourierous"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Fast-and-Fourierous"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "231926": {
      "poster": "Fast-and-Fourierous",
      "content": "@GileTheGreat#231925 Ok, hvala na odgovoru",
      "votes": {
        "upvoters": [
          "GileTheGreat"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "232328": {
      "poster": "Mylorad",
      "content": "**Antene i Propagacija**\n\nZvonimir 말pu코, du코a.\n\nNa predavanjima zna biti malo dosadno, ali je kolegij zanimljiv.\n\nBilo nas je troje ovaj semestar, ja sam imao najni쬿 ocjenu, a to je bila 4.\n\nIako su bile super ocjene, definitivno sam ovo najvi코e radio.\n\nMI i ZI su svaki po tri zadatka, ima코 sve 코to 쬰li코 i sna캠i se.\n\nAlternative su puno gore, upi코ite ovo, svjedo캜ite ljubavi koju Zoki ima prema antenama, mo쬯a i vas motivira kao i mene!\n\nKORISNOST: 7/10 (Definitvno obavezan na BKTu)\n\nTE콯INA: 5/10\n\nPREPORUKA: DA\n\n**Biblijska teologija**\n\nJedino 코to 쬬lim je 코to nisam imao 100% nego 99% bar jednom u 쬴votu.\n\nKORISNOST: 10/10(Kolegiji koji pune ECTSe i ne tra쬰 vremena su na tragu svetosti)\n\nTE콯INA: 0/10\n\nPREPORUKA: DA\n\n**Digitalni radiodifuzijski sustavi**\n\nSonji spomenik, hitno!\n\nPuno zada캖a, ali se dobro boduju, ideal onoga 코to je Bolonja htjela biti, ali neuspje코no.\n\nSonja je kategorija sama za sebe, uvijek spremna pomo캖i i stvarno joj je stalo. Rijetkost na ovom faksu.\n\nKORISNOST: 10/10(Ni코ta manje za Sonju)\n\nTE콯INA: 2/10\n\nPREPORUKA: DA\n\n**Fizika lasera**\n\nOvo sam upisao molbom kako bih izbjegao OBS i VFE. Svaka preporuka svakome kome to uspije.\n\nMo쬰 se pro캖i samo na DZ, seminar i labose(koje vodi Matijevi캖, it is what it is), tako da ako upi코ete ovaj kolegij imajte 코to vi코e bodova iz ovoga, a i MI i ZI 코to ulovite, ulovite, ponovi se pokoji zadatak i skupi se za 4 dosta lako.\n\nKORISNOST: 2/10(ZPF je meme)\n\nTE콯INA: 2/10\n\nPREPORUKA: DA\n\n**Osnove nuklearne fizike**\n\nSeminar je 30 bodova, napravi ga. Skupi ostalih 20 bodova na MI odmah i onda zaboravi na ovo i na ZI do캠i po vi코u ocjenu ili nemoj.\n\nKORISNOST: 1/10(Kako ZPF jo코 uvijek postoji?)\n\nTE콯INA: 2/10\n\nPREPORUKA: DA\n\n**Radijske pristupne mre쬰**\n\nRijetko koristan kolegij, u캜i osnove o vrstama be쬴캜nih mre쬬, labos je konfa Mikrotik routera(napokon zaista koristan labos). Pismeni nisu te코ki, usmeni je ugodan razgovor.\n\nAko planirate biti mre쬹i in쬰njer, ovo je obavezan upis.\n\nMo쬯a malo previ코e podataka, ali ispituju se principi i osnove, tako da nemam zamjerki.\n\nKORISNOST: 10/10(Ovo su osnove korisnog dijela IKTa)\n\nTE콯INA: 1/10\n\nPREPORUKA: DA\n\nZaklju캜ak: Vrlo ugodan semestar, dosta kolegija, pola kolegija online pola na faksu, ali najlak코i do sad. Uspio sam radit uz faks bez problema. Ovaj popis kolegija smatram najlak코im mogu캖im i preporu캜am ga svakome.",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "Mose",
          "weedovnjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235997": {
      "poster": "Fast-and-Fourierous",
      "content": "Koji je najlak코i od ovih predmeta?\n\n![](assets/2021-09-11/00003.png)",
      "votes": {
        "upvoters": [
          "AntonioB25 (Pleteni mi코)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236000": {
      "poster": "keykey",
      "content": "@Fast-and-Fourierous#235997 engleski",
      "votes": {
        "upvoters": [
          "Fast-and-Fourierous",
          "a_ko_si_ti"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273532": {
      "poster": "ljama_glama",
      "content": "Najlaksi od ovih?\n\n![](assets/2022-01-25/00019.png)",
      "votes": {
        "upvoters": [
          "Erpeg",
          "lucylu"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273540": {
      "poster": "ljama_glama",
      "content": "Najlaksa 2?\n\n![](assets/2022-01-25/00020.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277335": {
      "poster": "Daho_Cro",
      "content": "Zra캜na robotika i Pomorska robotika? Ako je netko slu코ao ne코to od ova dva predmeta i volio bi podijeliti svoje iskustvo bio bih zahvalan!\n\nTako캠er koji su najlak코i slobodni izborni predmeti za upisati u ljetnom semestru osim Osnova nuklearne fizike?",
      "votes": {
        "upvoters": [
          "FERonja",
          "Maja (promaja)",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277428": {
      "poster": "Kuhar",
      "content": "![](assets/2022-02-05/00010.png)\n\nkaj je tu najbezbolnije?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277431": {
      "poster": "Daeyarn",
      "content": "@\"Kuhar\"#p277428 imo upravljanje rizikom, zadace su prosle godine bile jednake ko prethodnih godina, meduispit i zavrsni se isto pitanja ponavljaju od proslih godina ali nisu uvijek identicna, ima i 2 ili 3 study casea gdje treba napisati nesto malo o necemu i predati prek moodlea(ali nije obavezno)\n\nugl, dalo se lako skupiti bodove, cak su i ove study caseove davali sve bodove dok god je bilo nest napisano, sjecam se da je bio kolega koji je imao 101/100 bodova, msm da to dovoljno govori",
      "votes": {
        "upvoters": [
          "Kuhar"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "278795": {
      "poster": "Data_ta_ta_ta",
      "content": "Ima li netko iskustva ili informacije o Bioinformatici 1?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}