{
  "title": "[ELE1] Ljetni rok - 2019/2020",
  "creator": "alp (monte)",
  "slug": "ele1-ljetni-rok-20192020",
  "tags": [
    "FER",
    "Elektronika 1",
    "Ispiti"
  ],
  "posts": {
    "45004": {
      "poster": "alp (monte)",
      "content": "Ima li netko tko namjerava izaci sad na ljeto? Kako ovo uciti i nakon koliko otprilike bude usmeni?",
      "votes": {
        "upvoters": [
          "Maksi20 (GetToTheChoppa)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45099": {
      "poster": "ssbb",
      "content": "ja sam prosle godine imao. Probao sam uciti po skripti ali sam odustao nakon 100tinjak stranica.\n\nIskreno, jedino prvo poglavlje bi prosao opet po skripti. Nakon toga imas briljantne masovne instrukcije koje su studenti napravili prije par godina: https://www.youtube.com/watch?v=hSvT5ApZYnw&list=PLIoiQPax7zrId9Upw8kY_h0KBZyu2egxG . \n\n\nNakon toga rokaj po starim ispitima za pismeni. Sto se usmenog tice, ima negdje nekakav pdf sa karakteristicnim pitanjima za svakog profesora, pa to prodji. Meni je na usmenom prof. dosao i svima dao 2, za visu ocjenu su odgovarali koji su htjeli, ali cini mi se da tu kurtoaziju znaju napraviti samo za nas jadnike sa R smjera.\n\nSve u svemu, za pismeni ostavi si cca 4 dana za proc ove masovne, nakon toga 1-2 dana rjesavaj zadatke za vjezbu i stare ispite. Za usmeni si ostavi dan-dva: na usmenom je dosta pitanja vezano uz sheme koje ces ionako naucit za pismeni. Uz to prodji pitanja za svog profesora. Sretno!",
      "votes": {
        "upvoters": [
          "Danac",
          "Maksi20 (GetToTheChoppa)",
          "Mulder",
          "[deleted]",
          "alp (monte)",
          "benac (caneb)",
          "tintintintin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51161": {
      "poster": "Maksi20 (GetToTheChoppa)",
      "content": "Zna li netto kad bi mogao bit usmeni?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51165": {
      "poster": "jobi (azex)",
      "content": "Moze li neko zapisat okvirno pitanja iz pismenog koja su bila?",
      "votes": {
        "upvoters": [
          "Mike (Klaud Konzultanta)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51390": {
      "poster": "EstebanVihaio",
      "content": "@jobi#51165 moje iskustvo sa zimskog roka. Ispitiva캜: prof.Vladimir 캛eperi캖. \n\nPrvo je gledao kakvi smo svi s bodovima s ispita i labosa pa nam je po tome dijelio pitanja. Tko je ciljao na vi코u ocjenu, logi캜no, dobio je zahtjevnija pitanja. Postavi ti tri pitanja koja pi코e코 na papir i onda odlazi코 kod njega da ti provjeri uradak.\n\nMoja pitanja su bila: pn-dioda (pi코i sve 코to zna코), shema manjinskih nosioca u bipolarnom tranzistoru (crte, kratke teze i onda me usmeno jo코 propitao da to sve fino upakiram u rje캜ito obja코njenje) i zadao mi je zadatak unipolarnog tranzistora u spoju zajedni캜ke upravlja캜e elektrode (stati캜ka i dinami캜ka analiza + to캜na shema; to mu je posebno bilo va쬹o - da je shema dobra i to캜no odre캠eni svi tra쬰ni parametri).\n\nSve u svemu, profesor je skroz chill ispitiva캜, nema sekiranja i treme, ne stvara ti onaj osje캖aj nelagode da 캖e te ismijat pred ostalim kolegama i onda oboriti; mogu se samo nadati da 캖e mi sad do캖i na roku iz ele2.\n\nSretno na usmenom!\n\nedit: pogre코no pro캜itah tvoje pitanje...  \n\nAko se dobro sje캖am, bio je zadatak sli캜an 1. zadatku sa ZIRa 2016. (energetski dijagram), jedan unipolarni tranzistor, zadnji je bio bipolarni u SZC (ako se ne varam). Ostalog se ba코 i ne sje캖am najbolje 游땟 \n\nU svakom slu캜aju, nije bilo previ코e zahtjevno, ispit je bio skroz prihvatljiv; klju캜na stvar kod tranzistora ti je da pohvata코 kako se crtaju sheme za dinami캜ku analizu i od toga ti sve ide kao po loju.  ZZV su spas na ele1 pa toplo preporu캜ujem da ih pro캠e코",
      "votes": {
        "upvoters": [
          "Mioch",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51609": {
      "poster": "tintintintin",
      "content": "@jobi#51165 \n\nza R smjer je bilo dosta tipicno, kao i u zzv-ovima \n\n1.  imas hrpu toga zadano i treba izracunat hrpu toga, s tim da je dioda u stanju ravnote쬰 (napon na pn spoju je U=0 V)\n2. zadan graf izlazne karakteristike i zadana vecina stvari opet tipican zadatak iz zzv\n3. spoj zajednickog sourcea, av avg rul riz\n4. spoj zajednickog emitera, av avg rul riz\n5. se ne sjecam bas",
      "votes": {
        "upvoters": [
          "[deleted]",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51783": {
      "poster": "koode7",
      "content": "Jel ima netko da je prepisao ispit ili zapamtio pitanja s LJIR-a (R smjer)? More i na pm.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52007": {
      "poster": "Multimedija",
      "content": "@EstebanVihaio#51390 \n\nI코ao si na ZIR 2020? Ako da, zna코 li tko sve mo쬰 biti ispitiva캜? Ako se dobro sje캖am trebali bi biti samo profesori koji su nam  predavali.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52168": {
      "poster": "EstebanVihaio",
      "content": "@Multimedija#52007 mojoj grupi i u grupi u terminu nakon moje je bio prof. 캛eperi캖, sad ne znam je li to bilo do toga 코to nam je on predavao u drugom ciklusu ele1, ali ako su tako zamislili usmene ispite, ne vidim razloga za코to bi se sada i코ta mijenjalo",
      "votes": {
        "upvoters": [
          "Multimedija"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53147": {
      "poster": "Abcdef",
      "content": "Koliko znanja ocekuju profesori na usmenom za R smjer",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "54547": {
      "poster": "Mulder",
      "content": "kakva su bila pitanja na usmenom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "54624": {
      "poster": "tintintintin",
      "content": "@Mulder#54547 \n\nR smjer, Poljak - papiric, 4 pitanja, 2 cijela ili sva 4 po malo za prolaz (njegove rijeci)\n\n1. CR mreza nacrtat, odziv na pravokutni napon i jos nes\n2. Energetski dijagram pn-spoja u ravnotezi\n3. MOSFET - SZU nacrtat, nadomjesnu shemu isto, Av\n4. Neinvertirajuce pojacalo nacrtat, Av i Rul",
      "votes": {
        "upvoters": [
          "Cls2211",
          "Mulder",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59683": {
      "poster": "dinosaur (Ruasonid)",
      "content": "E smjer - koga ste imali na usmenom sad na ljir-u? (jer imali smo vise profesora kroz sem)",
      "votes": {
        "upvoters": [
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}