{
  "title": "3 godine ili 5 godina?",
  "creator": "benac (caneb)",
  "slug": "3-godine-ili-5-godina",
  "tags": [
    "FER",
    "Općenito"
  ],
  "posts": {
    "46481": {
      "poster": "benac (caneb)",
      "content": "Pošto sam si već dvaput produžio školovanje i preddiplomski će mi trajat 5, žongliram s idejom da riješim preddipl i odletim s faksa i počnem radit. Zanima me vaše mišljenje o tome, koji bi bili pros and cons završavanja diplomskog vs samo preddiplomskog? Npr koje su mogućnosti zapošljavanja u Hrv i inozemstvu kao bacc? Priznaje li se naš bacc u EU a i dalje(npr UK,SAD,NZ, Australija) ?",
      "votes": {
        "upvoters": [
          "Krisle",
          "__builtin_popcount (std::popcount)",
          "iv2 (bubbles)",
          "pitroid"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "46483": {
      "poster": "benac (caneb)",
      "content": "@benac#46481 zaboravih napomenut da sam RZ",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "46484": {
      "poster": "Mike (Klaud Konzultanta)",
      "content": "Naš se bacc priznaje i dalje, ali ima mnogo pozicija koje nisu čisti software dev (npr. RZ-ovske stvari) za koje se traže magistri i diploma je uvjet. I prije će te prihvatit za vizu i slične imigracijske gluposti ako imaš višu akademsku titulu.\n\nNisi ništa napisao koje te područje zanima. Za područja koja se dosta oslanjaju na teoriju poslodavcima ta diploma znači da si ako ništa drugo bar upoznat sa teorijom i da si prošao kroz to. Faks davanjem te diplome jamči da si to gradivo koliko-toliko usvojio, a FER ima dosta dobru reputaciju.\n\nDiploma magistra zna vani biti dosta skupa i kad si već spomenuo SAD, tamo je puno rjeđa jer ljudi ionako moraju dizat ogromne studentske zajmove da uopće doguraju do titule bakalara. Tako da bi ti to mogao biti popriličan diferencijski faktor.\n\nŠteta je ne iskoristiti priliku kada možeš dogurati do magistra skoro besplatno, a uvijek možeš naći studentski posao sa strane. \n\nSad vidim tvoju dopunu, definitivno ćeš imati hendikep u odnosu na ostale RZ-ovce koji imaju magistra. Ne samo po statusu nego i po znanju jer se dosta bitnih stvari za RZ odrađuje tek na diplomskom.",
      "votes": {
        "upvoters": [
          "ALovelace",
          "Amali (Amajli)",
          "Anonimity (BoJack)",
          "Bobicki",
          "Feelcool",
          "Fortius",
          "M-16",
          "Ma97",
          "McKovalski",
          "Miki",
          "Red_Baron",
          "Sans",
          "Stark",
          "Svarog (Veles)",
          "Zvjerinjak",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "benac (caneb)",
          "gatsby",
          "indythedog",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}