{
  "title": "Produljenje studija od godinu dana",
  "creator": "Yeltneb",
  "slug": "produljenje-studija-od-godinu-dana",
  "tags": [
    "FER",
    "Općenito"
  ],
  "posts": {
    "53347": {
      "poster": "Yeltneb",
      "content": "Planiram raditi uz faks tijekom diplomskog studija i zanima me kako da to odradim na najbezbolniji način.\n\nMislio sam diplomski studij razvući u tri godine na način da svake godine položim otprilike 40 ECTS.\n\nZanima me ako je to uopće moguće moguće i kako da minimiziram broj ECTS koji ću trebati platiti.\n\nAko netko ima tips and tricks vezanih uz ovu problematiku bio bih zahvalan 😄",
      "votes": {
        "upvoters": [
          "Franksta",
          "Stark",
          "cajaznun",
          "markoo321 (Grinch)",
          "netbitan11 (netbitan)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53378": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Nije to baš tako proizvoljno, da si ti odrediš da ćeš položiti 40 ECTS-a.\n\n## Tabula rasa\nNajlakši način je ne upisati ili pasti 1 predmet iz zimskog semestra 1. godine i pasti seminar. Na taj način na 2. godini imaš 8 ekstra ECTS-a koji ti popunjavaju Projekt kojeg nećeš moći upisati jer nisi položio Seminar, a opet imat ćeš 30 ECTS-a u godini i ne [s]gubiš studentska prava[/s] plaćaš godinu.\n\n## Prošao 1. godinu osim seminara\nAko si već prošao sve na 1. godini, a pao si seminar, onda si malo fucked jer ćeš imati 25 ECTS-a u 2. godini i [s]gubiš studentska prava[/s] plaćaš godinu. Morao bi upisati nešto u strukturi studija, ali nisam siguran jel to možeš samo tako jednostavno da npr. ako si na RZ-u na kojem moraš odabrati 3 od 4 teorijska predmeta upišeš onaj 4. Ako je, onda jebiga morat ćeš malo više raditi ali je manageable.\n\n## Prošao sve s 1. godine\nAko si prošao Seminar onda se stvari još više kompliciraju - ako padneš projekt, onda ćeš imati 22 ili 27 ECTS-a, [s]gubiš studentska prava[/s] plaćaš cijelu godinu. Dakle projekt moraš proći ako si prošao sve s 1. godine i nećeš moći popuniti tih 8 ECTS-a koji bi ti falili. No ako prođeš projekt, onda možeš upisati diplomski. E sad, nisam 100% upućen u to jer se nisam softlockao na taj način, ali morao bi pasti neki od predmeta, ili pasti diplomski. Ako padneš diplomski plaćaš 4200 kn LOL, no opet bolje od plaćanja cijele godine. Ako padneš neki od drugih predmeta, [s]nisam siguran jel možeš upisati diplomski tad - gubiš studentska prava[/s] plaćaš cijelu godinu jer imaš manje od 30 ECTS-a te godine. [s]U svakom slučaju jednom kad prođeš projekt ćeš diplomski upisivati u zimskom semestru.[/s]\n\n## Backtracking na ljetni semestar 1. godine\nZnači preostaje ti ili ne upisati ili pasti nešto iz ljetnog semestra 1. godine, tako da možeš pasti projekt, a tih 8 ECTS-a popuniti u ljetnom semestru 2. godine. Ne plaćaš ništa ako ne upišeš predmete. Alternativno, možeš ti i upisati projekt, ali onda bi morao ne upisati ili pasti bar 2 predmeta iz ljetnog semestra 1. godine - na taj način si se zablokirao da ne možeš sve riješiti u ljetnom semestru 2. godine jer možeš upisati samo jedan predmet uz diplomski, ali sad nisam siguran hoćeš li ti upisati na 2. godini diplomski + 1 predmet, pa taj zadnji riješavati za godinu dana, ili ćeš 1 riješiti na ljeto 2. godine, pa upisati diplomski na zimu 3. godine i imati samo taj jedan predmet na ljeto 3. godine, ili taj jedan preostali predmet + diplomski riješavati na ljeto 3. godine. Za to bi se trebao dalje informirati al to su već napredne taktike. Ne preporučam stuslu jer oni ti ne bi smjeli davati takve savjete, vjv ti mentor može pomoći kod toga.\n\n## Zaključak\nSve u svemu, iako nisam previše upućen u ove softlock scenarije, najbolje ti je ne upisati ili pasti 1 predmet od 5 ECTS-a iz zimskog semestra 1. godine i pasti seminar. Ako jednostavno ne upišeš taj jedan predmet, možeš produljiti diplomski bez da išta platiš, a u suprotnom ćeš plaćati. Ako si se softlockao možda je najbolje pokušati zamrznuti godinu, ali to onda nije apsolventska godina.",
      "votes": {
        "upvoters": [
          "Yeltneb",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53480": {
      "poster": "[deleted]",
      "content": "@micho#53378 Za početak ne gubi studentska prava ako ima manje od 30 ECTS-a, to samo znači da će sljedeće godine morati platiti punu školarinu.  \n\nDrugo pojam studentska prava je kolokvijalni krovni termin za niz prava koja redovni studenti imaju (pravo na studentski rad, subvenciju prehrane, studentksi dom, zdravstveno osiguranje, itd.), a svako od njih je definirano zasebnim pravilnicima (i/ili zakonima). \n\nTako npr. za menzu (subvenciju prehrane) moraš imati, ako se dobro sjećam 18 ECTS-a u prošloj godini i 36 ECTS-a ukupno u prošle dvije godine. S tim da ti ono npr. ne vrijedi ako treći put upisuješ istu razinu studija (dakle mijenjao si fakultet dva puta), i vrijedi samo za vrijeme trajanja studija plus jedna godina (dakle 2+1 za diplomski studij). Za studentski dom imaš poseban pravilinik o uvjetima potrebim za ostvarivanje i način bodovanja za rang listu. Za rad preko student servisa moraš imati 1ECTS u prošloj godini, itd.\n\nDakle sintagma gubitak studentskih prava nema apsolutno nikakvog smisla,",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Jimothy",
          "Stark",
          "Svarog (Veles)",
          "Yeltneb",
          "[deleted]",
          "ink",
          "luba",
          "markoo321 (Grinch)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53482": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Delpins#53480 Imaš pravo, prošao sam kroz pravilnik i napravit ću izmjenu uz stvari za koje nisam bio siguran.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53493": {
      "poster": "Yeltneb",
      "content": "@micho#53378 Sad sam gledao malo taj pravilnik i pise da zadrzavam studentska prava ukoliko imam 25 i više ECTS po semestru.\n\n\"Prema pravilniku Sveučilišta u svakom semestru student s aktivnim studentskim statusom\n\ntreba upisati najmanje 25 ECTS-bodova. Ukoliko student nema niti jedan predmet koji može odabrati,\n\nili ako do završetka studija treba upisati manje od 25 ECTS-bodova, tada može odabrati i manje od 25\n\nECTS-bodova. Prema istom Pravilniku, student koji u dvije uzastopne aktivne akademske godine ne\n\nostvari barem 35 ECTS bodova neće ostvariti pravo za nastavak studija.\"\n\nZnaci ako upisem 25 ECTS i položim 20 od toga, na kraju godine moram platiti samo 5 ECTS-a po semestru ili moram platiti do 30 ECTS-a (10 ECTS-a razlike)?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53497": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Yeltneb#53493 Koliko ja znam, plaćaš ono što ponovno upisuješ, tako da ako si pao 5 ECTS-a, nećeš plaćati 10 - e sad, ne mogu naći točno pravilnik o tom plaćanju, pa ti ne mogu reći jel plaćaš nepoloženo ako imaš manje od 55 ECTS-a u godini, ili ako ponovno upisuješ više od 5 ECTS-a.\n\nRazlika je što u drugom slučaju nije bitno koliko toga upisao - smiješ pasti 5 ECTS-a bez plaćanja. Ak netko nađe pravilnik s time nek me ispravi/nadopuni/potvrdi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53501": {
      "poster": "[deleted]",
      "content": "@Yeltneb#53493 To što si citirao nema veze s onim što pitaš tj. plaćanjem studija. Plaćanje studija je pokriveno posebnim pravilnicma i odlukama, a na FER-u (na repozitoriju na _Obavijesti studentima_) trebaš gledati odluku fakultetskog vijeća vezanu za plaćanje studija.\n\nKonkretno, ako imaš manje od 30 ECTS-a u prošloj godini, onda moraš plaćati punu školarinu, dakle svih 8400kn. \n\nMislim, na tvoj mjestu bih napravio ono što je kolega gore  napisao, dakle pao diplomski seminar i još jedan predmet na prvoj godini. To znači da bi sljedeće godine na upisu morao platiti (5+3)*140kn, ali ne bi mogao upisati projekt pa onda ni diplomski te godine. Onda sljedeće godine bi imao za položiti 22+5+3=30, dakle mogao bi skupiti 30 ECTSa, i na zadnjoj godini bi ti onda ostao diplomski projekt i diplomski rad i ne bi ništa morao plaćati.\n\nMislim, na prvom mjestu bih probao ne upisati uopće u drugom semestru (jednostavno ne odabrati u aplikaciji te predmete) jedan predmet i diplomski seminar, pa ako prođe prođe (kao ne bi smjelo po ovom što si citirao, ali mislim da je moguće) jer onda ne moraš plaćati sljedeće godine ništa. A ako budeš morao upisati, onda samo namjerno padni.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Trolololica",
          "Yeltneb"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53554": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@Delpins#53480 Inace, ako upisujete i drugi put gubite prava na menzu. Ja sam zavrsio prediplomski na drugome fakultetu, upisao na FER-u i nemam prehrane (vec 3 godine). Ni sam ni jednu godinu (so far) ponavljao. Odnosno tehnicki ponavljam svaku godinu tek drugi put.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "InCogNiTo124",
          "JayOhAit",
          "Svarog (Veles)",
          "france_is_bacon",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ]
      }
    },
    "53830": {
      "poster": "maPre",
      "content": "Najbolje ti je isplanirat si ectse po godini tako da imas min 30 i neces placati nista. Ovo sto pise u aplikaciji da trebas min 25 ectsa po semestru upisat mozes zanemarit, znam iz pouzdanih izvora, a ako zelis biti siguran mozes pitati studentsku sluzbu, reci ce ti isto. \n\nJedino sto za dom cini mi se ima neki minimum od 40 ectsa po godini ili tako nesto, ako si u domu onda i na to moras paziti, ali to mozes srediti tako da upises dodatne predmete.\n\nUgl ako tek sad upisujes diplomski mozes ga bez beda produzit za godinu dana, bez placanja.",
      "votes": {
        "upvoters": [
          "MsBrightside"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56738": {
      "poster": "[deleted]",
      "content": "Jel itko zna te sheme kako što bezbolnije produljiti samo za jedan semestar, i.e. da u zimskom semestru ak. godine 2021./2022. upišem diplomski rad samo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56741": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@tolecnal#56738 Ako si sve do sad prošao bez plaćanja godine mislim da ne možeš. Jedino što mi padne napamet je da padneš više od 10 ECTSa u zimskom semestru da ne možeš upisati diplomski, pa ih sve položiš na ljetnom/jesenskom/dekanskom roku.\n\nNakon 1. godine preddipl., ak sve prođeš si se praktički softlockao, nisam siguran jel bi ovo što sam rekao profunkalo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56742": {
      "poster": "[deleted]",
      "content": "@micho#56741 Znam, no nisam sve prošao. Saznao sam 2 načina (potvrđeno od strane pouzdanog izvora): \n\n1. U ljetnom semestru 1. godine diplomskog padneš 12 ectsa, ali onda moraš platiti tih 12 ectsa pri ponovnom upisu.\n2. (Bolji način) U zimskom semestru 2. godine diplomskog padneš 12 ects i položiš na ljeto/jesen i ggwp. Niš ne plaćaš. Ako padneš tih 12 ectsa u zimskom semestru onda ti se neće upisati diplomski na ljeto.",
      "votes": {
        "upvoters": [
          "Bobicki",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56746": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@tolecnal#56742 E ovo drugo sam se sjetio, ali od 1. bi ti bolja taktika bila pasti ili ne upisati 2 predmeta (ECTSi nebitni) u ljetnom semestru 1. godine, i onda nećeš moći upisati diplomski, a nećeš imati frku s ECTSima. Moja preporuka za te predmete bi bila humanistički i matematički predmet, ali očito je tu već prošla baba s kolačima.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56900": {
      "poster": "SergeantPepper (Chet)",
      "content": "Zna li itko treba li se išta plaćati ako na 2. godini diplomskog u zimskom semestru položim sve (uključujući diplomski projekt, a u ljetnom semestru moram upisati jedan matematički i jedan društveni predmet? \n\nKoliko znam, diplomski rad ne mogu uopće upisati zato što se samo jedan predmet može upisati uz njega. \n\nMeđutim, predstavlja li problem što bih u tom slučaju u ljetnom semestru imao samo 6 ECTS-a upisanih?\n\nZnam da postoji ona granica od min. 25 ECTS-a u semestru, ali volio bih biti siguran.\n\nHvala!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56911": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@SergeantPepper#56900 Nije ti to problem jer tih 25 ECTSa ne vrijedi ako ne možeš upisati 25 ECTSa. Morat ćeš platiti samo te predmete koje ponovno upisuješ.\n\nImaš ljudi na na FER2 koji studiraju 5 godina preddipl. bez ijedne kune plaćene isključivo zato što zbog preduvjeta nisu mogli upisati predmete.",
      "votes": {
        "upvoters": [
          "Filemon",
          "SergeantPepper (Chet)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56964": {
      "poster": "SergeantPepper (Chet)",
      "content": "@micho#56911 možda glupo pitanje, ali taj uvjet od 25 ECTS-a se odnosi isključivo na predmete iz strukture studija?\n\nteoretski mogu upisati 25 ECTS-a u ljetnom semestru ako npr. upišem preostale predmete iz predmetne skupine za koju sam već ispunio min. broj ECTS bodova (npr. predmete iz specijalizacije profila)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56966": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@SergeantPepper#56964 Pitaj stuslu, u pravilniku nije eksplicitno definirano\n\nMislim, ovo što piše da ne trebaš upisati 25 ECTS-a ako ti ne treba za završetak studija sugerira da onda nećeš biti prisiljen upisati predmete za koje si zadovoljio strukturu studija, a i logično je, ali ne znam točno u kojoj si situaciji. Općenito sva ovakva pitanja bi trebala ići stuslu a ne na forum.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56967": {
      "poster": "[deleted]",
      "content": "@micho#56966 Kako nije eksplictino definirano, imaš npr. stavak (5) članka 28.\n > Iznimno od odredbe iz stavka 4. ovog clanka student moze upisati predmete u ukupnom opterecenju i manjem od 25 ECTS bodova ako nije stekao preduvjete za upis dovoljnog broja predmeta iIi ako do zavrsetka studija treba upisati predmete kojima stjece manje od 25 ECTS bodova.\n\nA i valjda je svakome jasno da te nitko neće tjerati da upisuješ višak predmeta, ako imaš dovoljno ECTS-a. \n\nMislim, na FER-u ionako sam 99% uvjeren da nitko ne pazi na tih 25 ECTS-a i da ti sasvim normalno možeš na aplikaciji odabrati upis manje od 25 iako možeš više upisati iz svog programa,  i da ti nitko neće ništa.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Mrcina (Yoso)",
          "miss_anthropocene (neunist.iva)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56969": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Delpins#56967 Pa to nije eksplicitno - implicitno slijedi iz toga da s obzirom na to da si prošao predmete pa da ti ti ekstra ECTS-i ne trebaju za završetak studija jer je studij tako složen ne trebaš upisati, ali opet, ne znam stanje kolege i zato kažem da bi trebao kontaktirati stuslu koja ZNA stanje.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "Kiflica"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56971": {
      "poster": "[deleted]",
      "content": "@micho#56969 Pa ne možeš samo gramatički čitati pravilnike i zakone, to je najniži oblik razumijevanja toga, moraš čitati u kontekstu i konkrentnim slučajevima. Jel ti stvarno misliš da bi stuslu tjerala nekoga upiše više ECTS-a iz grupe koju je već položio samo da bi zadovoljio taj uvjet od 25 ECTS-a? Ja msilim da oni uopće ne paze na to ionako, a kamoli i u ovakvim slučajevima.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Emma63194",
          "miss_anthropocene (neunist.iva)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56973": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Delpins#56971 Jel ti stvarno misliš da bi stuslu tjerala nekoga upiše više ECTS-a iz grupe koju je već položio samo da bi zadovoljio taj uvjet od 25 ECTS-a? Ja msilim da oni uopće ne paze na to ionako, a kamoli i u ovakvim slučajevima.\n\nJa sam samo rekao da u pravilniku ne piše eksplicitno što se radi u njegovom slučaju, primarno jer mi ni njegov slučaj nije 100% poznat.\n\nDa se pravilnici, zakoni i sl. mogu tako jednostavno čitati i tumačiti, lustracija birokrata, pravnika i sudaca bi već bila opravdana. Uzmimo u obzir i to da je u tijeku promjena studija na FER3, uz ovoliko nepoznanica je najbolji postupak pitati stuslu i biti siguran, a ne oslanjati se na voljnost fakulteta na poštovanje pravila, čak i vlastitih - imali smo primjere ove godine gdje smo vidjeli da su pravila na fakultetu proizvoljna. To što provođenje pravilnika ide dvosmjerno nije argument da ne može krenuti u smjeru nepovoljnom za studenta, bolje je biti siguran.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61490": {
      "poster": "Trinity",
      "content": "Što ako imam na 2. godini diplomskog položeno 30 ectsa, ali zbog uvjeta nepoloženog predmeta ne mogu položiti ni diplomski,  trebam li platiti ponovni upis diplomskog?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61507": {
      "poster": "Bobicki",
      "content": "@Trinity#61490 Nećeš platiti ponovni upis diplomskog kad ga ovu godinu nisi uopće ni upisao zbog neostvarenih uvjeta. Ili sam te krivo shvatio?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61509": {
      "poster": "Trinity",
      "content": "@Bobicki#61507 Krivo, diplomski je upisan (imala sam nepoložena dva predmeta od prošle godine, zato imam već 30 ectsa)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ]
      }
    },
    "61512": {
      "poster": "Bobicki",
      "content": "@Trinity#61509 Onda mislim da ponovno upisuješ diplomski i plaćaš za tih 30 ECTS. To mi je jedino logično ako se ne može položiti diplomski pa onda ostatak predmeta nagodinu, kao što se moglo sa završnim.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61586": {
      "poster": "[deleted]",
      "content": "jel produljio netko i preddiplomski na slicnu shemu? jel se moze isto za besplatno i bez ikakvih posljedica?",
      "votes": {
        "upvoters": [
          "Bisolvon",
          "DazedAndConfused",
          "NekocBraca"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61592": {
      "poster": "Filemon",
      "content": "@Itachi#61586 na FER2 je to bilo relativno jednostavno zbog preduvjeta, na 2. g padneš neki predmet koji veže Projekt i godine_studija++\n\nTakođer, dovoljno je i pasti bilo koji predmet s [imath]\\le 5[/imath] ECTS na 3. godini, ne možeš završiti studij dok ne položiš predmete iz strukture, položio si 55+ ECTS pa ne plaćaš ništa, a pravilo o manje od 30 ECTS se koliko znam ne primjenjuje ako nije moguće upisati toliko ECTS. Ne znam napamet kako se to odražava na dom i iksicu, jer su redovno uvjeti više od 18 ECTS u PAG",
      "votes": {
        "upvoters": [
          "NekocBraca",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61594": {
      "poster": "[deleted]",
      "content": "> @Filemon#61592 pravilo o manje od 30 ECTS se koliko znam ne primjenjuje ako nije moguće upisati toliko ECTS\n\novo me najvise zanima, znas neki izvor u kojem bi mogo potrazit? i ono da moras imat polozeno barem 18 ECTS u prosloj godini, na diplomskom se to ne vrijedi za proslu (4. preddiplomskog) godinu?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61596": {
      "poster": "[deleted]",
      "content": "![](assets/2020-08-19/00011.png)\n\nu aplikaciji za upis pise ovo, 6 godina se odnosi samo na preddiplomski ili preddiplomski+diplomski?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61597": {
      "poster": "Filemon",
      "content": "@Itachi#61596 prvo. preddiplomski i diplomski su odvojeni studiji.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61598": {
      "poster": "[deleted]",
      "content": "> @Filemon#61592 Također, dovoljno je i pasti bilo koji predmet s [imath]\\le 5[/imath] ECTS na 3. godini, ne možeš završiti studij dok ne položiš predmete iz strukture, položio si 55+ ECTS pa ne plaćaš ništa,\n\nKad se radi o produzivanju godine to ne vrijedi (na FER-u!), svejedno placas tih [imath]\\leq 5[/imath] ECTS-a iako si polozio 55+. Imas odluku fakultetskog vijeca negdje u repozitoriju na Obavijesti studentima. Tad ne ostvarujes pravo na subvenciju ministarstva pa odluku o tome koliko placas donosi fakultet.\n\n> @Filemon#61592 pravilo o manje od 30 ECTS se koliko znam ne primjenjuje ako nije moguće upisati toliko ECTS\n\nNe znam sto mislis, ali ako polozi tih 5 ECTS-a onda zavrsava studij i upisuje diplomski na kojem se placanje gleda \"ispocetka\" i zato ne mora nista platiti. Ako padne tih 5 ECTS-a i produzi jos jednu godinu onda placa punu skolarinu od 8400kn jer je imao manje od 30 u godini prije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Filemon"
        ],
        "tuga": []
      }
    },
    "61599": {
      "poster": "[deleted]",
      "content": "> @Delpins#61598 Ako padne tih 5 ECTS-a i produzi jos jednu godinu onda placa punu skolarinu od 8400kn jer je imao manje od 30 u godini prije.\n\nako sam te dobro shvatio ti govoris o scenariju padanja na 4. godini preddiplomskog s tim jednim predmetom? tj. potrebnog 3. upisa predmeta, u tom slucaju bi se trebalo platit 8.4k",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61600": {
      "poster": "[deleted]",
      "content": "@Itachi#61599 da",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61604": {
      "poster": "Filemon",
      "content": "> @Delpins#61598 Tad ne ostvarujes pravo na subvenciju ministarstva pa odluku o tome koliko placas donosi fakultet.\n\nAko pričaš o [ovom](https://www.fer.unizg.hr/_download/repository/Odluka_FV-a_skolarina_2015-2018.pdf), to je bilo vezano za privremenu odluku Sveučilišta jer je kasnila odluka Vlade o sufinanciranju za 2015.-2018. ako se ne varam. Ako si redovan i preddipl završiš u 3 g, mislim da te se participacije oslobađa dvaput, jer se ona ne obračunava pri prvom upisu neke razine studija, a i u ovoj odluci stoji i da se ta tri oslobođenja mogu dogoditi u prve 4 godine studija, preko toga si dužan. \n\nAko bi se ovo ipak primjenjivalo na ovaj scenarij (a mislim da ne bi trebalo), onda bi bio dužan tih par ECTS koje ponovno upisuješ.\n\n~~Sada to reguliraju programski ugovori, zar ne?~~ Programski ugovor vrijedi od 2013./14. do 2021./22.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61605": {
      "poster": "[deleted]",
      "content": "> @Delpins#61598 Kad se radi o produzivanju godine to ne vrijedi (na FER-u!), svejedno placas tih \n\n>                     [imath]\\leq 5[/imath]\n\n>                  ECTS-a iako si polozio 55+. Imas odluku fakultetskog vijeca negdje u repozitoriju na Obavijesti studentima. Tad ne ostvarujes pravo na subvenciju ministarstva pa odluku o tome koliko placas donosi fakultet.\n\n![](assets/2020-08-19/00012.png)\n\nmislis na ovo? to znaci da ako si zavrsio neku godinu s manje od 55 ECTS (tj. placao si nesto bar jednu godinu) jos uvijek mozes produzit jednu za besplatno(naravno uz uvjet da si polozio 55)",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61610": {
      "poster": "[deleted]",
      "content": "@Filemon#61604 ne mogu pristupiti linku jer nemam pristup ferwebu vise. Ali o tome sam cuo na starom fer3 pretprosle godine kad je jedan kolega bio produzio godinu zbog IRG-a (ostalo je islo redovno) i onda je morao platiti tih 5 ECTS-a.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61615": {
      "poster": "Bisolvon",
      "content": "Samo da provjerim ako sam dobro shvatio. Zavrsavam 3 godinu preddiplomskog i dosada nisam nista ponovno upisivao ali mi je ostao jedan predmet sad za jesen. Ako njega padnem moram platit ECTS-e za taj predmet(4 u mom slucaju) i onda cijelu sljedecu godinu imam samo taj predmet uz puna prava sto se tice iksice i rada preko studentskog?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61621": {
      "poster": "[deleted]",
      "content": "> @Filemon#61604 Programski ugovor vrijedi od 2013./14. do 2021./22.\n\nProgranski ugovor samo kaze koje ce studente ministarstvo subvencionirati, a onda fakultet donosi odluku sto ce s onim studentima koje ministarstvo ne subvencionira.\n\nNpr. Upis drugog studija na istoj razini, nemas pravo na subvenciju ministarstva. Na FER-u moras placati punu skolarinu cijelo vrijeme, na pmfu moras platiti prvu godinu, a dalje po uspjehu kao kod nas.\n\nI u ugovoru ti je npr. Definirano da subvenciju imaju samo oni studenti koji skupe 55 ECTS-a. I sad npr. na Sveucilistu u Splitu su imali propisano do ove godine na razini svecuilista da punu participaciju placaju svi koji skupe manje od 42. Tek su se zbog korone malo smilovali pa spustili na 30 koliko je kod nas.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61624": {
      "poster": "[deleted]",
      "content": "@Bisolvon#61615 Za placanje nisam siguran, mislio sam da ces morati, ali moguce da sam u krivu i da sam mozda zaboravio neki detalj vezano za ovog kolegu koji je placao IRG. Imad gore u @Itachi screenshot toga propisa pa vidi kako to najbolje tumaciti.\n\nXicu i pravo na student servis ces imati na ton produzenoj godini, no problem je godina iza kad upises diplomski. S studentskim servisom neces tada imati problema, ali sa xicom vjerojatno hoces.\n\nNaime imao sam frendicu koja je zbog par predmeta produzila preddiplomski i onda na prvoj godini diplomskog nije imala subvencije na xici jer godinu prije na preddiplomskom ostvarila manje od 18 ECTS-a. Po pravilniku mi se cini da to tako ne bi trebalo biti: https://sredisnjikatalogrh.gov.hr//cadial/searchdoc.php?action=search&lang=hr&query=%22Pravilnik+o+uvjetima+i+na%C4%8Dinu+ostvarivanja+prava+na+pokri%C4%87e+tro%C5%A1kova+prehrane+studenata+%28NN+120%2F2013%29%22&searchTitle=on&resultdetails=basic&displayOptions=on&filteracttype=all&filterfields=35334&filtereuchapter=all&resultlimitnum=10&bid=jlu8mtu6G%2f26%2bKdghguxdw%3d%3d&annotate=on\n\nAli moguce da fer ima neke svoje ideje.",
      "votes": {
        "upvoters": [
          "Bisolvon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61625": {
      "poster": "Filemon",
      "content": "@Delpins#61621 uglavnom po [algoritmu](https://wiki.srce.hr/download/attachments/1671222/PPU-PostupakIzracuna_v2.pdf?api=v2) i parametrima ugovora se da izvrtit i vidjet kolika bi trebala biti participacija ako postoji. \n\nIzgleda da broj subvencioniranih godina isto stoji u Studomatu. Ako nisi ništa plaćao, on je jednak [godina studija koju upisuješ] - 1, dakle produljenje preddiplomskog jednim IRG-om bi trebao biti 3. Nije subvencioniran za g dulje od trajanja studija (10. korak) i ako je položio sve ostalo, trebao bi zadovoljiti prvi kriterij za subvenciju, jer ima položenih 56 ECTS. \n\nA onda je iduće godine na nuli jer upisuje prvi put prvu godinu druge razine studija.",
      "votes": {
        "upvoters": [
          "Bisolvon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61635": {
      "poster": "[deleted]",
      "content": "@Filemon#61625 a da ja sam vjerojatno krivo zapamtio i zeznuo, vjerojatno je taj kolega vec bio studirao 4 godine pa onda produzio jos jednu. Ispricavam se.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61655": {
      "poster": "Ziher",
      "content": "Recimo da ja padnem 2 predmeta, svaki po 4 ects, jedan sa zimskog i jedan s ljetnog na 3. godini. Plaćam li samo tih 8 ects-a ili jos nesto?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61716": {
      "poster": "[deleted]",
      "content": "ako zadnju godinu preddiplomskog studija upišem samo jedan predmet hoću li pri upisu diplomskog studija morat platiti punu školarinu?",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "atp0lar (‮ 🏳️‍⚧️‍⃠ 🏳️‍🌈⃠ 🇮🇱⃠at⁭p⁩⁫0⁮lar)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61741": {
      "poster": "Bobicki",
      "content": "@III#61716 Ne, to su dva odvojena studija.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61742": {
      "poster": "Bobicki",
      "content": "@Ziher#61655 Plaćaš samo predmete koje ponovno upisuješ, osim ako si ostvario < 30 ECTS u prethodnoj godini, onda plaćaš puni upis godine.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61798": {
      "poster": "DazedAndConfused",
      "content": "Upisujem sad 3. godinu preddiplomskog i imat cu nekakvih zaostataka sa 2. godine. Mislio sam u 5. semestru ne upisati projekt, u 6. ne upisati zavrsni i izostaviti jos par predmeta. Mogu li onda sljedece godine normalno upisati samo projekt, zavrsni i te predmete koji ce mi faliti i ako da, hocu li to morati placati?",
      "votes": {
        "upvoters": [
          "Jaster111"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61800": {
      "poster": "Filemon",
      "content": "@DazedAndConfused#61798 Možeš. Plaćanje ovisno o tome koliko si sad položio i koliko ćeš položit u novoj godini. Ako budeš preko 30 ECTS i ništa ne padneš, ne bi trebao platiti ni kune.",
      "votes": {
        "upvoters": [
          "DazedAndConfused",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "65328": {
      "poster": "SinanSuckich (Yelena)",
      "content": "sta je onda najlakse ne upisat? Predmete matematike, fizike i prirodoslovlja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67058": {
      "poster": "[deleted]",
      "content": "@SinanSuckich#65328 zar nije najbolje past 1 transverzalni predmet ljetnog semestra",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67068": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@SinanSuckich#65328 Padneš seminar i to je to, nema lakšega\n\nSve za seminar napraviš te godine, sljedeće samo predaš rad ili dovršiš ako nisi",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67072": {
      "poster": "SergeantPepper (Chet)",
      "content": "@micho#67068 Zar nije da se mora pasti Seminar + još jedan predmet od 5 ECTS-a  tako da se\n\nnaredne godine seminarom i tim predmetom nadopuni 8 ECTS-a izgubljenih neupisivanjem diplomskog projekta (govorim za FER2 program)? Ako se samo padne seminar, iduće godine će se položiti 25 ECTS od strukture studija, šta ne?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67082": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@SergeantPepper#67072 Da, pretpostavljam da kolega priča o padu transverzalnog ili matematičkog uz još neki predmet, jer pad/ne upisivanje jednog predmeta ti neće produljiti godinu (možeš ga upisati paralelno s projektom/diplomskim, a i možeš upisati diplomski u zimskom).\n\nBolje je od kombinacije ne upisivanja predmeta pasti seminar i ne upisati neki od 5 ECTS-a - u tom slučaju garantirano produljiš studij a ne plaćaš ništa. Alternativno, vjerojatno se može samo ne upisati seminar pa pasti predmet (ili bar ostaviti da je pali predmet slučajna varijabla, pa koji ti neće ići), pa bi se u tom slučaju mogao cijeli predmet riješiti u pogledu labosa, a onda bi se Seminar radio kad se upiše godinu nakon.\n\nAli nisam toliko informiran o namjernom neupisivanju predmeta pa generalno govorim o padovima. A i IMO, ijedan mentor koji valja će ti za seminar dati nešto što je teže od labosa ijednog predmeta na diplomskom, pa zato bih pao seminar, a ne taj od 5 ECTS.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67225": {
      "poster": "SinanSuckich (Yelena)",
      "content": "Mislio sam uz pad seminara, ja sam sad samo ne upiso jedan predmet u zimskom",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67228": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@SinanSuckich#67225 Ako ti taj predmet ima 5 ECTS-a onda ne trebaš ništa više pasti. Ako si pao 4 ili manje ECTSa, da, padni neki transverzalni. IMO transverzalni na diplomskom su drastično laganiji od matematičkih i prirodoslovnih. Moja preporuka: engleski u inženjerskoj, ne vjerujem da je taj predmet moguće pasti ako si imao 3 ili više iz engleskog u srednjoj.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67918": {
      "poster": "jure_putak_balutak",
      "content": "@Johnny_Bravo#53554 Ne bih se složio :) također došao s drugog fakulteta, tj. sveučilišta i dobio iksicu i evo +5kg teži",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "67923": {
      "poster": "SergeantPepper (Chet)",
      "content": "Što se dogodi ako se padne diplomski rad u zimskom semestru? Može li se normalno upisati i u ljetnom semestru ili?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "68565": {
      "poster": "Bisenberg (DonaldPump)",
      "content": "Pitanje za ekipu koja živi u domu, čitao sam ovdje prošle postove i nisam našao odgovor, pa da me možda netko prosvijetli.\n\nDosta ekipe je pitalo što ako ostane samo jedan predmet sa 3. godine preddiplomskog studija, ne može se završiti studij te se mora produžiti godina.\n\nZanima me zna li slučajno netko koja je situacija s domom na prvoj godini diplomskog studija, jer su očito u tom slučaju u tekućoj akademskoj godini upisana samo 4 ECTS-a, a ne onih potrebnih 18.\n\nZa ovo pravilo postoje nekakve iznimke gdje je moguće ostvariti sva prava za dom iako nema tih 18 ECTS-a, npr. ako je ostao nepoložen Završni rad, ali to meni konkretno nije slučaj.\n\nJe li itko imao takvih iskustava?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "68945": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@jure_putak_balutak#67918 onda su ocito samo mene zajebali. Jos sam isao pitati u stuslu i rekli su mi da tako to ide",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "jure_putak_balutak"
        ]
      }
    },
    "75270": {
      "poster": "Mony",
      "content": "Da napišem svoje iskustvo, ako ste se kao ja sjetili na drugoj godini diplomskog da bi produžili studiranje, pa ste već položili Seminar, ipak se može u potpunosti bez plaćanja.\n\nJa sam redovno završila prvu godinu, i onda u drugoj nisam upisala Projekt (uz dogovor s mentorom). Studentska mi je naravno automatski upisala Projekt i onda sam ih molila da mi ga ispišu jer sam se tako dogovorila s mentorom. Znači u zimskom semestru sam imala 22 ECTS-a, i onda sam u ljetnom upisala par predmeta da pređem 30 ECTS-a (na kraju sam imala 33 u cijeloj godini).\n\nIako su mi ti predmeti u ljetnom semestru bili dodatni i nisam ih trebala upisat unutar redovne strukture studija, ipak su ušli u zbroj ECTS-a koji se gledaju za plaćanje (oko tog nisam bila sigurna), tako da nisam platila ništa, pa ove godine imam samo Projekt i Diplomski rad, a diplomirat ću na ljeto jer je Projekt preduvjet za Diplomski rad😀",
      "votes": {
        "upvoters": [
          "SinanSuckich (Yelena)",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "adrian7000",
          "alfajastog",
          "jitser",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75400": {
      "poster": "SergeantPepper (Chet)",
      "content": "@Mony#75270 može objašnjenje kako se ects-i od predmeta izvan strukture studija računaju za školarinu? Zanima me jer sam čuo da to ne prolazi (bar u slučaju nekoliko poznanika)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75835": {
      "poster": "Mony",
      "content": "@SergeantPepper#75400 Iskreno, ja sam očekivala da ću morati platiti 8400 kn. U Studomatu mi piše da sam u PAG položila 33 i da je izračun rađen po formuli da ako imaš >= 30 ECTS onda plaćaš samo nepoložene. A ja nisam ništa pala, pa ne moram ništa platiti.\n\nI ja sam čula od više ljudi da se za plaćanje računaju samo ECTS-i unutar strukture studija, tako da stvarno ne znam kako su oni to u ovom slučaju gledali",
      "votes": {
        "upvoters": [
          "alfajastog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "100381": {
      "poster": "jitser",
      "content": "u nekom threadu sam pročitao (ovdje nisam pronašao) da je moguće i produljiti studij pomoću slanja molbe za odgodu diplomskog rada na sljedeći semestar? konkretno, zanima me kako ta molba treba izgledati (ima neki obrazac?), kada se šalje (nakon završetka semestra koji prethodi upisivanju diplomskog?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "100472": {
      "poster": "johndoe12 (enaiks)",
      "content": "@jitser#100381 mozes i upisati diplomski, pasti ga ove godine i ponovit sljedece godine",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "100480": {
      "poster": "jitser",
      "content": "@johndoe12#100472 ali u tom slucaju moram platit padnute ectse?",
      "votes": {
        "upvoters": [
          "adrian7000",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "109649": {
      "poster": "basketbaler (Burek sa sirom)",
      "content": "Savjeti kako najbezbolnije produljiti studij za godinu dana?\n\nTrenutno sam 1. semestar diplomskog na PIIS-u\n\nNe upisati seminar iduci semestar i pasti neki predmet iz ovoga ili?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "109656": {
      "poster": "maPre",
      "content": "@basketbaler#109649 po meni najbolje ti je proci sve ovaj semestar kad si vec upisao sve i tak ces odma zadovoljiti kvotu od 30 ectsa po godini. Sljedeci semestar upises neku sicu ectsa tek toliko da ti nije dosadno haha\n\nI onda sljedece dvije godine kombiniras predmete kak ti pase, s tim da pazis da imas 30 ectsa po godini.\n\nTak sam ja napravio prije dvije godine, nista nisam morao placati i nikakvih problema nije bilo.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "109664": {
      "poster": "basketbaler (Burek sa sirom)",
      "content": "@maPre#109656 Postoji li kakva opcija da ove godine ostvarim 55 ectsa i iduce 40ak tako da mogu i dalje ostvariti dom sljedeće dvije godine?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "109871": {
      "poster": "XiJinping (JusufBideni )",
      "content": "(Upozorite me ako je ova situacija već odgovorena, scrollao sam prvih 10ak objava i nitko nije imao slicnu situaciju.)\n\nTrenutno sam 2. godina, zimski semestar. U prvoj godini diplomskog imam sve predmete položene. U trenutnom semestru imam upisan diplomski projekt. Želim si produžiti studij još godinu dana uz minimalna plaćanja i želim imati pravo na studentski dom. Koliko sam shvatio, najbolja metoda je položiti sada manje od 20 ECTS-a da ne mogu upisati diplomski rad i položiti te predmete na jesen. Voljan sam upisati ako je potrebno (radi doma da ne bih slučajno izvisio zbog premalo bodova) i puni semestar od 30 ECTS-a sa random predmetima, ali ako može i manje. Sada, se tih 30 ECTSa predmeta računaju u  sve one uvjete za dom i za plaćanje škkolarine (tipa uvjet da se ispod 54 ECTSa skida 10% ukupnih bodova za dom i uvjet o plaćanju školarine)?\n\nTipa, tih 10+ ECTS-a iz zimskog položim na roku i + imam 30 ECTS-a u ljetnom semestru te onda time imam tehnički 60 ECTS-a bez položenog diplomskog rada i čist sam?",
      "votes": {
        "upvoters": [
          "Jurica"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "110049": {
      "poster": "Jurica",
      "content": "@XiJinping#109871 slična situacija je kod mene. Slao sam upit na stuslu pa su me nazvali i objasnili. Diplomski rad se najnormalnije upiše u ljetnom semestru, no kasnije šalješ molbu koja ide prodekanu da ti se ispiše i prebaci za iduću godinu, naravno uz neki bolji argument. Možeš najnormalnije položit 30 ectsa ovaj semestar. Za plaćanje su mi isto rekli da ovisi o predekanu, al ne vidim zašto bi plaćao ako imam polozenih 30ectsa u godini od upisanih 30. Za dom ne znam kako funkcionira, to ces se morat malo bolje raspitat. Nek me netko ispravi, ako sam nešto krivo skužio",
      "votes": {
        "upvoters": [
          "XiJinping (JusufBideni )"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "116221": {
      "poster": "Amali (Amajli)",
      "content": "Jel mi moze netko rec di da nadjem sve te pravilnike o pravima i participacijama jer ih nikad ne znam locirati? Jel ima negdje neki ugodan tldr il sve na jednom mjestu (sumnjam, but damn I have to hope)?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "InCogNiTo124"
        ]
      }
    },
    "116230": {
      "poster": "Amali (Amajli)",
      "content": "@Amali#116221 https://www.fer.unizg.hr/intranet/studenti/obavijesti#!p_rep_10267!_ jebem im organizaciju stranice, al valjda tu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117085": {
      "poster": "BigTuna",
      "content": "Ak na 3. Godini u zimskom padnes izborni predmet, jel moguce u ljetnom upisati jedan izborni vise i zavrsit preddiplomski na ljeto?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117088": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@BigTuna#117085 Mislim da ne",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117099": {
      "poster": "Bobicki",
      "content": "@BigTuna#117085 ne, jer su to dvije različite skupine predmeta. Barem je tako bilo na FER2.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117104": {
      "poster": "Emma63194",
      "content": "@Bobicki#117099 Kako su to dvije različite skupine? Oboje izborni predmeti.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117107": {
      "poster": "Bobicki",
      "content": "@Emma63194#117104 jedna skupina su izborni zimskog, a druga su izborni ljetnog semestra. \n\nNpr. na fer2 diplomskom u prva dva semestra postoje iste skupine predmeta (obavezni, društveni, itd.) s različitim predmetima u tim skupinama, i ja sam gotovo siguran da ne mogu npr. položiti dva društvena predmeta u 1. semestru, a u 2. semestru onda nijedan (umjesto jedan u 1. semestru i jedan u 2. semestru kako je zamišljeno). Osim ako na fer3 nije nešto novo uvedeno, onda sam u krivu.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117244": {
      "poster": "NekocBraca",
      "content": "@Bobicki#117107 \n\nOtkud ti ovo? Ja sam gotovo siguran da to mozes napraviti. Postoje skupine predmeta (teorijski, specijalizacijski, izborni, matematike i prirodoslovlja) i propisan je broj ECTS-a koje treba ostvariti za svaku skupinu. Ja ne vidim nista sto te sprjecava da ti rjesis dvije matematike u zimskom semestru i onda niti jednu u ljetnom.\n\nKad ides na Erasmus isto se gleda samo kojoj skupini predmeta pripadaju predmeti koje upisujes na stranom sveucilistu, u kojem semestru se sta predaje se nigdje ne spominje. \n\nEdit: isto pisem sve za fer2 program",
      "votes": {
        "upvoters": [
          "Emma63194",
          "boss15"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117247": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@NekocBraca#117244 ne postoji koncept izborni predmet, predmet specijalizacije, već izborni predmet x semestra, predmet specijalizacije x semestra itd.\n\nU suprotnom bi mogao preskakati neželjene obavezne predmete",
      "votes": {
        "upvoters": [
          "Emma63194",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117249": {
      "poster": "Bobicki",
      "content": "@NekocBraca#117244 @micho#117247 \n\nJa i dalje mislim da je ovo što Mićo kaže, ali to je moja pretpostavka samo. Rekao sam @Emma63194 -i da pošalje mail u stuslu pa ćemo znati sigurno kakva su pravila.",
      "votes": {
        "upvoters": [
          "Emma63194"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117250": {
      "poster": "Emma63194",
      "content": "@NekocBraca#117244 Ja sam isto mislila, kao i ti, da je svejedno u kojem semestru položiš koji predmet, dokle god imaš x ECTS-a unutar skupine teorijskih predmeta, predmeta specijalizacije profila, itd.\n\nPoslala sam mail studentskoj s tim pitanjem pa napišem ovdje što su mi odgovorili kad odgovore.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117252": {
      "poster": "Amon",
      "content": "> @Emma63194#117250 kad odgovore\n\nMy sweet summer child...",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": [
          "Emma63194"
        ]
      }
    },
    "117253": {
      "poster": "NekocBraca",
      "content": "@micho#117247 \n\nJa ne vidim da se ovdje spominje iti jedan semestar https://www.fer.unizg.hr/studiji/diplomski_studiji/rac/racunarska_znanost\n\nSto se tice preskakanja obaveznih predmeta (i teorijskih) to ne mozes niti u \"mojem\" tumacenju. Jer je strukturom studija propisano da moras poloziti N ECTS-a obaveznih predmeta, a tebi se sve skupa u  svim semestrima nudi tocno N ECTS-a obaveznih predmeta tako da moras tocno njih odslusati (to mozes jedino zaobici uz pisanje molbe da ti se neki drugi predmet prizna kao obavezni/teorijski, to npr radi dosta automaticara kad upisu strojno umjesto nekog svojeg teorijskog predmeta).\n\nS druge strane, izbornih predmeta trebas poloziti M ECTS-a, a kroz sve semestre se nudi ~ 3M ECTs-a izbornih predmeta. Na tebi je da odaberes koje izborne ces odslusati. Ne vidim niti razlog zasto bi izborni predmet iz jednog semestra bio vrijedniji od nekog iz drugog, svi vrijede isto i ti ih trebas poloziti M ECTS-a.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117255": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@NekocBraca#117253 Jesi li ikad otvorio aplikaciju za upis? Mislim mora da jesi, sjeti se samo kako tamo stvari izgledaju.\n\nIsto tako miješaš stvari. Nitko nije rekao da moraš upisati predmete svojih modula. Nitko nije rekao da ne možeš unaprijed riješavati neke predmete (jer su često predmeti za 1. i 3. semestar isti, što se tiče specijalizacije profila npr.). Jednostavno smo rekli da mislimo da ne možeš zamijeniti predmete npr. 1. ili 2. semestra s predmetima 2. ili 1. semestra, jer ti bez obzira na sve to neće ni aplikacija dopustiti jer se radi o različitoj skupini predmeta.\n\nSad, jel bi to referada dopustila - ovisi, ja mislim da to u puno slučajeva nije ni njihova nadležnost potpuno, kao što je slučaj kad upisuješ predmete s drugih modula. Te stvari su izvan cijele forme studijskih programa jer nisu izričito definirane, ali mi ukazujemo na to da postoje snažne indikacije da se ne može. S druge strane na FERu je štošta moguće na crno upisati, ali sve te ekstra stvari su u dogovoru s nastavnicima koji emuliraju ispravne upise.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117256": {
      "poster": "NekocBraca",
      "content": "@micho#117255 \n\nTamo mora biti tako iz organizacijskih razloga jer se mora biti nedvojbeno kada se sto predaje i kada tko sto upisuje.\n\nEvo ovdje procitaj ulomke _Pravila studiranja_ i _Struktura studija_ https://www.fer.unizg.hr/studiji/diplomski_studiji\n\nMislim da je tu sve jasno napisano.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117257": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@NekocBraca#117256 Ne vidim da je igdje napisano kako se konkretno trebaju položiti ti ECTSi. Nešto nešto dovoljni i nužni uvjeti, nedefinirano nije ni točno ni netočno i takve spike.\n\nInače da razjasnim zašto je takvo moje mišljenje.\n\nZnači, ovo što si rekao stoji, i to piše jasno u pravilniku, za te bodove koke trebaš. Tu nema ništa kontroverznog.\n\nMeđutim, imaš one scenarije kad imaš recimo 4 predmeta u skupini, moraš odabrati 3. I onda padneš jedan, ali položiš drugi, i na osnovu toga tražiš da te se oslobodi od polaganja tog prvog predmeta. To ti prođe jer si \"zadovoljio strukturu\". Ali, ako si zadovoljio strukturu, to bi sugeriralo da se na skupinu predmeta gleda semestralno, jer u suprotnom nisi zadovoljio nikakvu strukturu radi kasnijih semestara. Svaki drugi zaključak bi bio u kontradikciji s pravilom da jednom upisani predmet za tebe postaje obavezan. Dakle, dovodimo se u situaciju gdje vrijedi bar jedno od sljedećeg:\n\n- fakultet provodi nekonzistentne odluke\n- pravilo da svaki predmet upisom postaje obavezan ne vrijedi (tj. vrijedi samo u posebnim slučajevima)\n- kategorije predmeta se (barem under the hood) gledaju semestralno",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117258": {
      "poster": "NekocBraca",
      "content": "@micho#117257 \n\nDa bi ti bio zadovoljen, trebalo bi negdje pisati: _Predmeti se smiju polagati u kojem god semestru studenti zele_?\n\nPo meni je ovdje implicitno jasno. Propisan je broj ECTS-a po vrsti predmeta, i definirano je da kad imas >=120 ECTS-a ukupno i dovoljno iz svake skupine predmeta da si gotov s faksom.\n\nDa postoji neko dodatno pravilo, onda bi ga napisali. Ili bi jos \"stroze\" podjelili predmete u skupine tako da naprave ovo sto ti opisujes.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117261": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@NekocBraca#117258 E pogledaj edit koji sam napisao jer sam razjasnio mišljenje.\n\nTe implicitne stvari o kojima pričaš ti se formalno zovu rupe u zakonu, pravilnicima itd. mislim da si svjestan koliko su te stvari legitimne, i da zadnju riječ ima sudija, u ovom slučaju FER, i to može biti jako fleksibilno mišljenje, fleksibilnije što je manje fiksirano pravilnikom. Mogu reći da, mogu reći ne, ali opet, kažem, postoji indikacije da će reći ne radi toga kak su izvedeni upisi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117263": {
      "poster": "NekocBraca",
      "content": "@micho#117257 \n> moraš odabrati 3. I onda padneš jedan, ali položiš drugi, i na osnovu toga tražiš da te se oslobodi od polaganja tog prvog predmeta\n\nKolko ja znam, oslobodjenje predmeta mozes dobit tek kada i jesi zadovoljio strukturu studija. Odnosno, jos nisam cuo  za scenarij u kojem je netko oslobodjen polaganja predmeta, a jos nije polozio dovoljan broj ects-a iz te skupine.\n\nU tvojem scenariju sam ja cuo da to ide ovako. Upises 3 teorijska predmeta, jednog padnes. Duge godine imas drugi upis padnutog predmeta i upises jos jedan teorijski predmet (koji ti se u tom trenutku gleda kao predmet izvan strukture studija). Polozis taj novo upisani predmet -> zadovoljio si strukturu -> pises molbu da te se oslobodi polaganja ovog padnutog.\n\nIdenticna situacija kao da u startu upises sva 4, polozis 3 i opet lako ispises ovog koji je visak.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117265": {
      "poster": "NekocBraca",
      "content": "@NekocBraca#117263 \n\nNemam vremena/volje traziti i citirati pravilnike. Ja sam nakon prvog semestra diplomskog odlucio produzit godinu, razvodnit semestre i otic na erasmus. Tada sam istrazivao malo kako priznavnjae/polaganje predmeta funkcionira, izmjenio nekoliko mailova sa studentskom sluzbom i ects koordinatoricom. Uvijek sam spominjao samo ove kategorije predmeta koje sam naveo, nitko mi nikada nije spomenuo ikakvo semestralno gledanje predmeta.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117268": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @NekocBraca#117263 Odnosno, jos nisam cuo  za scenarij u kojem je netko oslobodjen polaganja predmeta, a jos nije polozio dovoljan broj ects-a iz te skupine.\n\nFair enough, nije baš na diplomskom ni moguće ako misliš završiti u roku kad imaš samo 2 godine.\n\n> @NekocBraca#117263 Identicna situacija kao da u startu upises sva 4, polozis 3 i opet lako ispises ovog koji je visak.\n\nE ali o tom ti pričam - to ne bi trebalo biti moguće, jer ako to napraviš u 1. godini onda nisi zadovoljio strukturu studija (još). Što znači da u tom trenu ne možeš ispisati predmet, nego tek sljedeće godine AKO tad zadovoljiš strukturu studija. Kad bi to bilo moguće, što je jedan od scenarija, onda se te skupine očito gledaju semestralno i/ili odluke su nekonzistentne.\n\n@NekocBraca#117265 Dobro onda, nadajmo se da je tako da kolega ne izgubi godinu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117271": {
      "poster": "NekocBraca",
      "content": "@micho#117268 \n> E ali o tom ti pričam - to ne bi trebalo biti moguće, jer ako to napraviš u 1. godini onda nisi zadovoljio strukturu studija (još). Što znači da u tom trenu ne možeš ispisati predmet, nego tek sljedeće godine AKO tad zadovoljiš strukturu studija.\n\nTo mozes napraviti u slucaju kada u ljetnom semestru polozis oba teorijska predmeta i onda JESI zadovoljio strukturu studija. Ako to nisi napravio, onda moras upisati ponovno.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117273": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@NekocBraca#117271 Okej za teorijske jer su samo u 1. godini, ali generalno gledajući to nije slučaj (npr. predmeti specijalizacije). Konkretno u ovom slučaju, kolega bi se mogao pozvati na to, to mu je dobar argument, ali oni opet mogu reći ne (ako nije upisao još izbornih sad) i pozvati se na to da je svaki upisani predmet obavezan za studenta.\n\nDrugim riječima, ne može ih prozvati za nekonzistenciju ako ne zna slučaj gdje je bila ta ista praksa.\n\nMislim ja osobno mislim da je argument da je zadovoljena struktura studija good enough, sad treba vidjeti što će oni reći jer nisam siguran da sam čuo da je tako prije bilo. **Treba primijetiti da je struktura studija s ECTSima definirana za diplomski studij, ne za preddiplomski.** Zato kažem da ovo moje mišljenje, a ne činjenica, ne može se pozvati na to da \"ima dovoljno bodova\", kad to nije u pravilniku, bar ne za preddiplomski.\n\n### Na što se kolega može onda pozvati?\n\nWell, 180 ECTSa. Pravilnik iz 2020 ne govori gotovo ništa o tim skupinama predmeta, ali kaže da ti treba 180 ECTSa. I onda možda kolega može reći gle, imam 180+ ECTSa i položio sam potreban broj izbornih. Po pravilniku imam sve preduvjete za završetak studija.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117296": {
      "poster": "SergeantPepper (Chet)",
      "content": "Još u 10. mjesecu sam se raspitivao je li bitno položiti skupine predmeta za svaki semestar ili je samo bitno da je na kraju zadovoljen broj ECTS bodova\n\nEvo što je Čupić odgovorio (isječak maila)\n\n![](assets/2021-01-06/00007.png)",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "InCogNiTo124",
          "Lyras",
          "NekocBraca",
          "[deleted]",
          "[deleted]",
          "boss15",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117301": {
      "poster": "njofra",
      "content": "Slao sam početkom semestra mail studentskoj je li moguće upisati društveni predmet u krivom semestru, ovo je bio odgovor (2+ mjeseca nakon pitanja):\n\n>Poštovani/a,\n>\n>nakon polaganja možete predati molbu da Vam se položeni predmet prizna u odgovarajućem semestru.\n>\n>Srdačan pozdrav,\n\nPo tome bi ja zaključio da postoji neka razlika između semestara ako je potrebno pisati molbe za priznavanje. Vjerojatno ne bi radili problem oko toga za izborne predmete, ali nije automatski.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117468": {
      "poster": "Filemon",
      "content": "da je struktura studija toliko stroga po semestrima, ljudi koji idu na Erasmus+ na dipl. ne bi nikad završili FER jer im se ne bi priznavali odrađeni predmeti u zimskom semestru kao predviđeni u ljetnom i obrnuto.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "NekocBraca",
          "[deleted]",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117484": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "@Filemon#117468 Mislim da to nije bilo originalno pitanje iako sam se i ja pogubila u toliko postova. Cini mi se da je pitanje bilo u smislu moze li se recimo u zimskom odslusati vise izbornih pa da se ne mora slusati izborni u ljetnom (?) i bi li studentska/faks to dopustili. Koliko znam aplikacija te prisili da moras upisati u svakom semestru jedan izborni. Sad, neki izborni su recimo ponudeni u npr. 1. i 3. semestru diplomskog, i onda u teoriji ako u 1. semestru uzmes recimo dva koja se pojavljuju i u 1. i u 3. semestru (to bi valjda prodekanica treba odobriti jer gazis potreban broj bodova za izborni za taj semestar, ne znam bi li aplikacija sama dala) moglo bi se rijesiti da se sljedece godine u zimskom ne mora slusati izborni (ako su oba polozena naravno), ali mislim da ne bi vrijedilo da se tako pokrije i izborni 2. tj. ljetnog semestra iste godine. No nisam Studentska sluzba. Erasmus je malo drugacija prica i sveucilista imaju dogovore medusobno pa priznavaju razne kombinacije.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117689": {
      "poster": "Filemon",
      "content": "@thelonewanderer#117484 joj te grupe izbornih su skroz divlje, kome se što nudi u kojem semestru, a realno većina ih je self-contained i uopće ni ne bi trebalo toga bit, jer nema preduvjeta. Kao što su svi prirodoslovno-matematički i društveni afair svima ponuđeni u oba zimska semestra, tako bi trebalo biti i za ostalo. \n\nPala mi je napamet još situacija kad se nekom na razmjeni uopće ne nude prirodoslovno-matematički ili društveni kolegiji, naravno da onda upišu dva umjesto jednog nekad tijekom studija.",
      "votes": {
        "upvoters": [
          "NekocBraca",
          "[deleted]",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "123613": {
      "poster": "antitalent21",
      "content": "Imam pitanje vezano uz diplomski, upisao sam ga u zimskom semestru i htio bih ipak produzit i ljetni semestar je li to moguće i jel cu morat kaj platit?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123615": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@antitalent21#123613 Ako ga položiš i imaš 120 ECTS-a, gotov ti je studij.\n\nAko ga padneš, možeš ga upisati u ljetnom opet, samo ne znam točno kako tu radi ponovni upis, tj. jel bi platio 4200, 8400, ili ništa.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123618": {
      "poster": "antitalent21",
      "content": "@micho#123615 da taj dio sa placanjem me muci jer je to zapravo ista akademska godina a ects-i se racunaju po godini",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123620": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@antitalent21#123618 Da, pogledao sam sad pravilnik i čini mi se da ćeš platiti 4200 kn. Tj. interesantno, to postoji u pravilniku 2015. godine, ali ne i u 2020., tj. u tome još nisam našao. Al u pravilniku iz 2015. godine u čl. 14 nedvosmisleno piše da plaćaš predmet koji ponovno upisuješ u istoj akademskoj godini prilikom ponovnog upisa. U pravilniku iz 2020. piše za ponovni upis predmeta, ali ne toliko jednoznačno.",
      "votes": {
        "upvoters": [
          "antitalent21"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123622": {
      "poster": "antitalent21",
      "content": "@micho#123620 odmah na upisu ljetnog semestra? i jel mozes mi poslat to, hvala",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123623": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@antitalent21#123622 čl. 15. st. 3.\n\nhttps://www.fer.unizg.hr/_download/repository/Pravilnik_o_sveucilisnom_preddiplomskom_i_diplomskom_studiju_-_signed[1].pdf\n\nst. 4. bi sugerirao da iako to ne bi platio na početku godine kako st. 2. kaže, ne bi mogao završiti faks bez da platiš",
      "votes": {
        "upvoters": [
          "antitalent21"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123629": {
      "poster": "antitalent21",
      "content": "Da nada sam da postoji samo ljetni rok kao i za predmet ali nista od toga",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123641": {
      "poster": "jitser",
      "content": "Kada se šalje molba za \"prebacivanje\" diplomskog na idući semestar?\n\nNpr. ja bih htio diplomski upisati u idućem zimskom semestru, a koliko sam skužio upisati će mi se automatski sad u ljetnom. \n\nMoj mentor se složio da ga upišem u idućem zimskom pa me zanima na koji način to postići.\n\nJel procedura da pustim da mi se automatski upiše diplomski sad u ljetnom semestru pa šaljem molbu za ispis ili prije nego se upiše šaljem nekakvu molbu? I jel postoji nekakav format odn. primjer molbe koja se šalje?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123644": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@jitser#123641 Po pravilniku FER-a u tome semestru moraš upisati diplomski u ljetnom, tako da takve kombinacije bez manipulacije upisanih predmeta moraš raditi u suradnji sa referadom, ako ti se smiluju, molba ne postoji iz očitih razloga.\n\nA konkretno gdje to piše, čl. 33. st. 4.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123646": {
      "poster": "jitser",
      "content": "@micho A da, znam da moram upisati sve ali sam isto tako čuo da si je pomoću te molbe uspjelo nekoliko ljudi produžiti studij.. mislim, treba imati neki \"valjan\" razlog da to dopuste. Znači vjerojatno ova varijanta da šaljem referadi da mi ispišu predmet nakon upisa, uz potpis mentora na molbi možda?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123648": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@jitser#123646 Ne bih rekao da ga možeš samo tako ispisati bez plaćanja, opet, treba pitati referadu.",
      "votes": {
        "upvoters": [
          "jitser"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "126334": {
      "poster": "tt98",
      "content": "@jitser#123646 Evo cisto primjer - ja idem sad za vrijeme ljetnog semestra u Irsku na Amazonov studentski internship i morao sam u referadu poslati tzv. Izjavu o dugotrajnoj sprijecenosti. Rekli su mi samo jos da onda ispisem diplomski kad se otvori aplikacija i da im poslije internshipa posaljem ugovor ili neki dokaz da sam stvarno imao praksu taj semestar.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "Mioch",
          "NekocBraca",
          "[deleted]",
          "[deleted]",
          "in1",
          "jitser"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "133265": {
      "poster": "Jim",
      "content": "Molim vas pomoc.. imam jedan predmet nepolozeni iz ljetnog semestra, 5. sam godina. Želim produžiti studij tako da pišem diplomski u zimskom semestru iduce godine, znaci produljenje 1 semestar, ne cijela godina. Jel ja automatski ne mogu upisat diplomski rad cim imam taj 1 nepolozeni predmet u tom semestru ili ipak mogu? Ako mogu, ne bih htio i  ne znam na koji način da to ostvarim (jel moram namjerno past jos jedan predmet ili?). Ako netko moze pomoci i ima sve informacije bio bih jako zahvalan.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "133275": {
      "poster": "InCogNiTo124",
      "content": "@Jim#133265 ako ti je predmet manje ili jednako od 5 ects bodova, mislim da ce ti se automatski upisat uz diplomski. Ono sto se s mentorom mozes dogovorit, i sto bivsi kolege radili, je da te on srusi na obrani. E sad, povlaci li to nekakve penale u vidu financija, ne bih ti znao reci",
      "votes": {
        "upvoters": [
          "Jim"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "133280": {
      "poster": "SergeantPepper (Chet)",
      "content": "@Jim#133265 moraš pasti još predmeta iz tekućeg semestra tako da zboj ects-a nepoloženih predmeta bude strogo veći od deset\n\nTako se diplomski rad automatski neće moći upisati",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "133281": {
      "poster": "SergeantPepper (Chet)",
      "content": "@InCogNiTo124#133275 mislim da to vuče pad diplomskog i prijenos u iduću ak. god, što se plaća 4200 kn ako se ne varam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "133299": {
      "poster": "Jim",
      "content": "@SergeantPepper#133280 Čekaj ozbiljno? Mislim znam da mi je netko prije rekao da čim imas jedan nepoloženi predmet, da se ne može upisati diplomski rad.. očito se promjenilo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "133306": {
      "poster": "SergeantPepper (Chet)",
      "content": "@Jim#133299 https://www.fer.unizg.hr/_download/repository/Pravilnik_o_preddipl._i_dipl._studiju_na_FER-u_procisceni_tekst_2015%5B1%5D.pdf Članak 33, stavak (6)",
      "votes": {
        "upvoters": [
          "Filemon",
          "Jim"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134506": {
      "poster": "Vasili (Fasili)",
      "content": "Trenutno sam 3. godina i cilj mi je produžiti studiranje za godinu dana. Zbog toga sam namjerno izgubio pravo polaganja ppj kako ne bih morao upisati završni rad. U zimskom semestru sam upisao 36 ectsa i 36 ectsa imam za ljetni semestar.\n\nKoliko razumijem moram paziti da imam više od 30 ectsa položenih na kraju ove godine da ne moram platiti 8400kn. Mene sad zanima jel bih ja izgubio kakva prava ako za iduću godinu ostavim samo PPJ i završni rad (radi broja ectsa) ili mi je bolje u ljetnom semestru upisati samo predmet koji moram jer ga ponavljam i onda bi i ove i iduce godine imao preko 30 ectsa?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134660": {
      "poster": "Asura (Asura)",
      "content": "@Vasili#134506 \n\nZavrsnu godinu ne moras imati vise od 30 jer ako tipa upisujes diplomski nakon toga, to ti je nova razina studija i ne gleda ti se ista od prije.  Ja sam imao samo projekt i zavrsni na preddiplomskom (to je manje od 30 i sve je ok bilo, nije trebalo placati nista tako da samo pazi da ako si na istoj razini studija tj. preddiplomski u tvome slucaju i imas jos jednu godinu nakon te di si upisao manje od 30, samo onda placas cijelu godinu)",
      "votes": {
        "upvoters": [
          "Vasili (Fasili)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134701": {
      "poster": "[deleted]",
      "content": "@Asura#134660 \n\njel znas mozda moze li se na 4. godini preddiplomskog imat samo jedan kolegij? recimo padnes transverzalni predmet u 6. semestru, moze li se regularno sljedecu godinu imat prazan zimski semestar i samo taj jedan kolegij u ljetnom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134707": {
      "poster": "Asura (Asura)",
      "content": "@Itachi#134701 \n\nNajbolje je provjeriti dal možeš braniti završni ako nisi položio sve, nekako mi se čini da sam čuo da je netko imao ovu situaciju. Možd najbolje pitati u stuslu, što ak se desi da nedo bog padneš slučajno taj predmet 🤣",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134722": {
      "poster": "Johnny_Bravo (a beautiful and unique snowflake)",
      "content": "@Itachi#134701 Ja sam imao tri, zavrsni sam rijesio na trecoj godini (i obranio). Nekako sam imao dovoljno bodova i nisam nista placao (makar su sva tri bili ponovni upisi)",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134741": {
      "poster": "Svudec",
      "content": "@Itachi#134701 Možeš imati taj slučaj, ali mislim da jedino ako ti to bude drugi upis. Najbolje da namjerno padneš trgovačko pravo.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134828": {
      "poster": "boss15",
      "content": "@Emma63194#117250 jesu odgovorili?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "134832": {
      "poster": "Emma63194",
      "content": "@boss15#134828 Ma jesu, ali su kompletno fulali pitanje. Samo su mi napisali da jednom upisan predmet postaje obavezan i to je to. Opće se nisu dotaknuli ovog \"predmeti po grupama\". Nisam imala volje slati im ponovo i navlačiti se s njima, kad je već netko ovdje stavio odgovor maila Čupiću (a tbh, vjerujem više njemu nego ekipi u StuSlu).",
      "votes": {
        "upvoters": [
          "boss15"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Asura (Asura)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "134838": {
      "poster": "[deleted]",
      "content": "@Svudec#134741 thx na savjetu, zakaj trgovacko pravo? kolko vidim to ni nemamo na FER3",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "135149": {
      "poster": "Svudec",
      "content": "@Itachi#134838 A zato što je meme predmet, ali ako nemate onda ništa.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137002": {
      "poster": "Nocna_smjena",
      "content": "Cisto me zanima jer znam da postoji takvo nesto na nekim fakultetima. Ukoliko neko padne neki predmet na trecoj godini preddiplomskog na FER-u da li moze uvjetno upisati neke ili sve predmete prve godine diplomskog?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137015": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Nocna_smjena#137002 da, npr. za UUUZ je bilo tako",
      "votes": {
        "upvoters": [
          "Nocna_smjena"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137021": {
      "poster": "Nocna_smjena",
      "content": "@micho#137015 pa toe super onda. Opet dobar dio ekipe sa preddiplomskog ne mora produzivat godinu tj put do statusa magistra zbog jednog ili dva predmeta hahaha",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137024": {
      "poster": "Filemon",
      "content": "@Nocna_smjena#137021 a ne, produljuješ studij svakako jer ne možeš upisat i završit diplomski u jednoj godini sve i da položiš 60 ECTS predmeta na crno jer ih nema toliko i ne možeš skippat lanac preduvjeta seminar => projekt => diplomski.\n\nSamo si možeš malo rasteretit stukturu studija sa društvenima i ako se ne varam određenim predmetima matematike i prirodoslovlja",
      "votes": {
        "upvoters": [
          "[deleted]",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137033": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Nocna_smjena#137021 Ovo što je Filemon rekao, ti upisi \"na crno\" ti funkcioniraju na način da ti npr. na preddiplomskom odradiš predmet, a onda kad ga upišeš na diplomskom imaš auto prolaz. Ti predmet zapravo nisi prošao dok ti ne prođe semestar u kojem si ga zapravo upisao, to ti je sve na razini dogovora s profesorom i zapravo nemaš nikakvu garanciju da nećeš morati stvarno polagati predmet osim profesorove riječi.\n\nTo je pogotovo opasno kad bi ti sad prošao predmet tako, a onda se promijenio predavač koji odjednom ne bi nudio tu opciju, onda bi morao sve isponova.",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137043": {
      "poster": "Nocna_smjena",
      "content": "@Filemon#137024 mozes onak 10-12 ectsa iz svakog semestra prenijet i opet unutar 5 godina zavrsit faks. Ak ti u zimskom semestru ostane tipa 10 ectsa pises molbu za upis vise od 37 ectsa, oni to odobre i ti si defakto sve predmete iz 7. semestra upisao i isti vrag ponovis i za ljetni semestar. Onda opet neke eventualne nepolozene predmete sa 4. godine mozes prenijeti na petu godinu jer po pravilniku fer-a ili sveucilista u zg-u (nemrem se sad vise tocno sjetit di sam to procitao ali jedno od to dvoje sigurno jest) mozes imat jos maksimalno jedan predmet upisan uz diplomski rad (toe za 10. semestar pravilo)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137046": {
      "poster": "Svudec",
      "content": "@Nocna_smjena#137043 Problem je što su predmeti (odnosno nositelji) koji dozvoljavaju upis na crno u manjini.",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137049": {
      "poster": "Nocna_smjena",
      "content": "@Svudec#137046 nene. To dogovaras direktno sa faksom. Nema tu profesora. Znam da hrvatski studiji imaju ovu foru jer mi stari radi tamo. Sam neznam dal FER ima ovu foru",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137050": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Nocna_smjena#137049 Nema tog tu, a hrvatski studiji ti donedavno nisu ni imali status fakulteta",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]",
          "markoo321 (Grinch)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "markoo321 (Grinch)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "137051": {
      "poster": "Nocna_smjena",
      "content": "@micho#137050 Ae slozit cu mail stuslu. Bas me ovo interesira",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137061": {
      "poster": "Svudec",
      "content": "Slobodno pitaj stuslu, ali službeno su to dva odvojena studija i po svim pravilnicima ti ne možeš upisati diplomski ako već nemaš završen preddiplomski.",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137074": {
      "poster": "Filemon",
      "content": "@Nocna_smjena#137043 da slažem se, dobra ti je matematika i možeš takve neke stvari. \n\nAli ako ti ostane predmet sa 3. godine preddiplomskog koji je ponovni upis ne možeš, jer ovo nije integrirani studij, a ne možeš biti student diplomskog studija bez da si završio preddiplomski",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137094": {
      "poster": "Nocna_smjena",
      "content": "Poslao sam mail stuslu. Vjv sutra dobim odgovor\n\n@Filemon#137074 mislim da to nije toliko striktno definirano. Ti mozes studirat diplomski ali nemres dobiti titulu magistra ak nemas titulu prvostupnika tj baccalaureanta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "NekocBraca",
          "SinanSuckich (Yelena)",
          "Svarog (Veles)",
          "Widlar",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "137102": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Nocna_smjena#137094 Ti mozes studirat diplomski ali nemres dobiti titulu magistra ak nemas titulu prvostupnika tj baccalaureanta\n\nSvakako ne možeš dobiti titulu magistra bez da si upisan na diplomski studij, koji ne možeš upisati bez bakalara u srodnom području (i potencijalno polaganja prijemnog i razlikovnih predmeta).\n\nI sad sve ovisi šta ti misliš pod studirati. Prisustvovati predavanjima i pisati labose može svako, no pisati ispite (tj. polagati pisane ispite) i polagati predmet ne može svako, za to moraš imati upisani predmet.",
      "votes": {
        "upvoters": [
          "Filemon",
          "NekocBraca",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137116": {
      "poster": "Nocna_smjena",
      "content": "@micho#137102 zato i spominjem **uvjetni upis** i za takvo nesto treba odobrenje faksa (ako ima tu foru i slozi se sa studentom). Ne pricam o obicnom upisu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Filemon"
        ],
        "tuga": []
      }
    },
    "137122": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Nocna_smjena#137116 Takav upis ne postoji u pravilniku:\n\nČlanak 20. stavak 2. ti govori o uvjetu upisa na diplomski\n\nČlanak 33. ti govori sve što trebaš znati o upisu predmeta, i jasno je vidljivo da koncept uvjetnog upisa ne postoji. Nadalje, stavak 2 ti jasno kaže da jedini način kako možeš upisati predmet je ako si stekao preduvjete po studijskom programu (npr. FER2, FER3) i izvedbenom planu studija (npr. R smjer, E smjer). Po svim studijskim programima, bazni preduvjet upisa predmeta je da si na tom studiju, za što se ponekad može dati iznimka ako su predmeti ekvivalentni (npr. OPP FER2 i PROINZ FER3). Ali to je onda izričito rečeno.\n\nPostoji još razloga radi kojih je potez besmislen, ali sumnjam da će te itko od nas moći uvjeriti u suprotno dok ti referada ne odgovori, tako da ajde pričekaj taj odgovor prije daljnje filozofije na temu.",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137143": {
      "poster": "Nocna_smjena",
      "content": "@micho#137122 pise isto da i student gubi pravo studiranja ako padne predmet po drugi put a mi u praksi vidimo ako je student na drugoj ili trecoj godini preddiplomskog da mu se u pravilu odobri treci upis\n\nMislim meni je nejasno cemu tolki pesimizam. Ovo ako i potvrdno odgovore je samo dodatna beneficija za studente",
      "votes": {
        "upvoters": [
          "boss15",
          "deus_vult"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137155": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Nocna_smjena#137143 Da, to je jedna od iznimka kod nas. Jedno je nulificirati jednu točku pravila što konceptualno ne ometa ostatak pravilnika, drugo je izmisliti pravilo koje ometa veliki ostatak pravilnika.\n\nTi tvrdiš da uvjetni upis postoji na FER-u službeno, ja sam ti pokazao da to nije istina. I sad možeš ti povući neke veze, postoje ljudi koji su upisali predmet 5 puta, ali to nema veze s formalnim uređenjem, već korumpiranosti fakulteta kao i svake druge javne hrvatske ustanove.",
      "votes": {
        "upvoters": [
          "NekocBraca",
          "[deleted]",
          "deus_vult"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137172": {
      "poster": "Cereal_Killer (vagab0nd0)",
      "content": "@Nocna_smjena#137002 \n\nJa cu ti reci da se sve moze kad se hoce i to bezbolno.  Moto: uporan i naporan s mailovima i sve birokratske zavrzlame mozes rijesiti",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137173": {
      "poster": "Cereal_Killer (vagab0nd0)",
      "content": "@Cereal_Killer#137172 _**s v e**_",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "InCogNiTo124",
          "JayOhAit",
          "Lyras",
          "NekocBraca",
          "boss15",
          "kix7 (Fish99)",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "137237": {
      "poster": "[deleted]",
      "content": "> @Nocna_smjena#137143 Mislim meni je nejasno cemu tolki pesimizam. Ovo ako i potvrdno odgovore je samo dodatna beneficija za studente\n\nPa pesimizam je u tome što takvo što konceputalno ne postoji na FER-u. Znaš koliko je ljudi produžilo godinu zbog jednog ili dva predmeta? Jako puno, a nikad nisam čuo od ikog da je bio na takvom uvjetnom upisu kako ga ti opisuješ. Misliš da to nikome prije nije palo na pamet?\n\nOvdje se u praksi moraš formalno upisati na studij za koji nisi stekao odgovarajuću kvalifikaciju, što je puno kompliciranije nego nekome omogućiti treći ili n-ti upis.\n\nKao što ti @micho gore kaže, nisu to baš iste odredbe.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137238": {
      "poster": "[deleted]",
      "content": "> @micho#137122 Po svim studijskim programima, bazni preduvjet upisa predmeta je da si na tom studiju, za što se ponekad može dati iznimka ako su predmeti ekvivalentni (npr. OPP FER2 i PROINZ FER3). Ali to je onda izričito rečeno.\n\nAli imaš ljude koji su tipa s R smjera upisali neki E smjer, ili došli s drugog faksa, i oni imaju razliku u sklopu diplomskog, pa onda tu slušaju neke preddiplomske predmete.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137241": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Delpins#137238 Okej, al to ti nema baš previše veze s preduvjetima za upis predmeta, to ti se čak regulira po programu zasebno (jer očito predmeti koje moraš upisati kad se prebacuješ s FESBa, npr., ovise o programu). Tj. te stvari su pokrivene drugim člancima, a mislim da je upis predmeta s drugog smjera/modula isto tip iznimke ko 3. upis, barem ja nisam nigdje našao gdje je to regulirano u pravilniku.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137294": {
      "poster": "Emma63194",
      "content": "Ako može netko samo potvrditi/negirati: pasti Seminar i jedan predmet od 5 ECTS-a na 4. godini produljuje studij za godinu dana (sa studentskim pravima sve tri godine) s minimalnim plaćanjem? \n\nIli ima neka bolja opcija? (a da je produljenje za jednu godinu, ne jedan semestar)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "InCogNiTo124"
        ]
      }
    },
    "137298": {
      "poster": "Filemon",
      "content": "@Emma63194#137294 ako se ne varam, i seminar je dosta, zbog preduvjeta za projekt i diplomski.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137299": {
      "poster": "Emma63194",
      "content": "@Filemon#137298 Ali onda u sumi nemam 30 ECTS-a iduće godine?",
      "votes": {
        "upvoters": [
          "Filemon",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Filemon"
        ]
      }
    },
    "137300": {
      "poster": "SergeantPepper (Chet)",
      "content": "@Filemon#137298 nije dosta pasti samo seminar zato što se onda u idućoj ak. godini ne može položiti >= 30 ECTS koji bi bili u strukturi studija\n\nDrugo objasnjenje:\n\npad dipl projekta stvara “rupu” od 8 ECTS-a koju treba pokrpiti seminarom od 3 ECTS-a \n\ni još jednim predmetom od barem 5 ECTS-a\n\nEDIT: seminar je 3 ECTS-a",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137301": {
      "poster": "Emma63194",
      "content": "> @SergeantPepper#137300 pokrpiti seminarom od 4 ECTS- a\n\nSeminar nosi 3 ECTS-a",
      "votes": {
        "upvoters": [
          "Filemon",
          "SergeantPepper (Chet)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137302": {
      "poster": "SinanSuckich (Yelena)",
      "content": "@Emma63194#137301 onda predmetom od 5 ectsa i seminarom od 3 ectsa",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137304": {
      "poster": "SinanSuckich (Yelena)",
      "content": "ja recimo nisam sad upiso (ovo mi sacuva pare na ponovnom upisu) kvantna (5ects) i past cu seminar (3) i to taman bude 8 nadoknade",
      "votes": {
        "upvoters": [
          "Emma63194",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137317": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Emma63194#137294 Minimalno plaćanje je da jednostavno nisi upisala predmet od 5 ECTSa nekim bruteforceom, al da\n\nza prava ti kažem iduće godine ak ih izgubim al ne bi trebao 👽",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137357": {
      "poster": "Emma63194",
      "content": "> @micho#137317 Minimalno plaćanje je da jednostavno nisi upisala predmet od 5 ECTSa nekim bruteforceom, al da\n\nTo mi zaista ne pada na pamet kako bi uspjelo. Nema preduvjeta, a ne vidim nikakav drugi način da to ostvarim.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137358": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Emma63194#137357 Neki kažu da bi mogla tražiti da ti ispišu predmet u prvim tjednim bez penala.\n\nMeni pada napamet scenarij da se softlockaš - odabereš predmete u skupini s kolizijom, i onda odabereš zamjenski predmet s kolizijom. Ako si sa zamjenskim predmetom ne razrješiš koliziju, onda ti neće moći biti automatski upisani svi.\n\nAko radi ovo 1. onda je najbolje ne upisat taj predmet od 5 ECTSa a past seminar (jer onda niš ne plaćaš). Sve u svemu, ovo treba planirat na 3. godini, sve su to igrice oko koje referada nije baš sretna jer bi ti trebala završiti studij u najkraćem mogućem roku a ne ga odugovlačiti (tak su bar mene našpotali kad sam ih pitao o taktici)",
      "votes": {
        "upvoters": [
          "Emma63194"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137359": {
      "poster": "[deleted]",
      "content": "jel zna netko kak ranije završit?",
      "votes": {
        "upvoters": [
          "Simpy",
          "boss15"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137366": {
      "poster": "[deleted]",
      "content": "@Nostro#137359 nemoguce, i ja sam htio speedrunnat diplomski u jednoj godini lmao, al se nemre",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137367": {
      "poster": "mihamih",
      "content": "treca godina preddiplomski po fer3:\n\nsad u ljetnom semestru (6. semestar) bih trebao upisat predmete koji svi skupa nose 27 ECTSa, zavrsni rad mi se prebacuje na iduci zimski semestar jer imam neke predmete koje moram polozit jos iz zimskog i to bi mi bio zadnji semestar\n\nsad me zanima jel mogu bez ikakvih posljedica za ljetni semestar odabrat da upisem 25 ECTSa i da onda moram ovaj jedan transverzalni od 2 ECTSa upisat u 8. semestru cime bih si produzio preddiplomski sa 7 na 8 semestara, plus u tom 8. semestru ne bih onda imao samo 2 boda vec 12 zbog zavrsnog koji bi mi se prebacio sa 7. na 8. semestar",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137373": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@mihamih#137367 samo ako ti ga daju da ne upišeš, što po pravilniku ne bi smio (jer moraš upisati svaki predmet koji možeš), ali nikad ne znaš kak će se osjećati taj dan, možda daju\n\nimao bi posljedica ak u ovom semestru nemaš 5+ ECTSa",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137374": {
      "poster": "mihamih",
      "content": "@micho#137373 ovako bih imao sad u 6. semestru 25 ECTSa, a u 7. i 8. svakom po 12 ECTSa, simulacija upisa mi dopusta, sad ne znam jel smijem to tako izvest",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137378": {
      "poster": "Filemon",
      "content": "> @mihamih#137367 zavrsni rad mi se prebacuje na iduci zimski semestar jer imam neke predmete koje moram polozit jos iz zimskog\n\novo ne moraš osim ako si baš pao pao na labosima ili nečemu jer završni je predmet kao i svaki drugi osim diplomskog, možeš ga normalno upisati i završiti, a predmete iz zime riješiti na rokovima",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137380": {
      "poster": "mihamih",
      "content": "@Filemon#137378 ta tri predmeta ce mi bit prvi upis, jer ih nisam ovaj semestar uopce mogao upisat zbog ogranicenja ectsa, tako da sigurno upisujem taj 7. semestar",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137381": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@mihamih#137374 Nebitno koliko imaš semestralno, ako nemaš 30 u ovoj godini platit ćeš cijelu godinu ove jeseni\n\nAk ti aplikacija da da tak napraviš, onda slobodno napravi. Međutim može se dogodit da te skuže pa ti otključaju aplikaciju da si upišeš taj predmet koji si \"zaboravio\", al onda ne znam kaj dalje xD",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137383": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Filemon#137378 Čini mi se da sad završni upisuješ tek onaj semestar u kojem možeš završiti studij\n\nTak da mislim da ni nema izbora, nego da actually mora upisati završni u ljetnom jer u zimskom ne može završiti studij xD",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137387": {
      "poster": "mihamih",
      "content": "@micho#137381 ma 30 cu imat svakako\n\nali ako me skuze kako kazes i moram upisat taj koji sam \"zaboravio\", onda mi je jedina opcija da ga namjerno padnem i onda cu ga morat upisat u 8. ponovo\n\n@micho#137383 ali ako bi ja polozio sve ove iz ljetnog ostaju mi samo ta tri predmeta u zimskom koje moram polozit, sto znaci da je taj zimski semestar onaj u kojem zavrsavam studij i u njemu bih onda morao zavrsni upisat, kaj ne?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137390": {
      "poster": "Koalalica (zaba)",
      "content": "samo odi na erasmus u onom semestru u kojem imas tinf. probs neces naci ni jedan predmet slican tinfu, pa ce ti on ostati za sljedecu godinu :D",
      "votes": {
        "upvoters": [
          "Amon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Emma63194",
          "Filemon",
          "Tratarira"
        ]
      }
    },
    "137392": {
      "poster": "mihamih",
      "content": "@Koalalica#137390 dobar plan za slucaj da jos nisam polozio tinf, ali kak stvari stoje izgleda da sam ga polozio osim ako mi bazant ne zavalja -50 na ZI iz nekog razloga",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137401": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @mihamih#137387 ali ako bi ja polozio sve ove iz ljetnog ostaju mi samo ta tri predmeta u zimskom koje moram polozit, sto znaci da je taj zimski semestar onaj u kojem zavrsavam studij i u njemu bih onda morao zavrsni upisat, kaj ne?\n\nDa, tak da.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137594": {
      "poster": "Nocna_smjena",
      "content": "@Nocna_smjena#137143 ipak nist. Nema FER ovu foru. Mora osoba zavrsit preddiplomski studij do kraja da bi mogla upisat predmete diplomskog 😢",
      "votes": {
        "upvoters": [
          "boss15"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon",
          "Widlar"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "137620": {
      "poster": "Svudec",
      "content": "@mihamih#137367 Zašto želiš produljiti preddiplomski do ljeta? To ima smisla samo ako si u domu ili baš ne možeš zivjeti bez menze. \n\nPo zakonu o obavljanju studentskih poslova ako zavrsis faks usred akademske godine, možeš preko sc nastaviti raditi do kraja akademske godine (iako nemaš status studenta)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "137779": {
      "poster": "mihamih",
      "content": "@Svudec#137620 za sad samo skupljam informacije i razmatram opcije",
      "votes": {
        "upvoters": [
          "Svudec"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138602": {
      "poster": "cavlic",
      "content": "bok ekipa, ne znam postoje li gore odgovori negdje na ova pitanja,  no ja ću pitati pa ako netko zna neka mi kratko odgovori:\n\n1) ako mi iz predzadnjeg semestra (3.) na **diplomskom** ostane samo jedan predmet, njega mogu polagati na ljetnom ili jesenskom te dekanskom roku? mogu li bez obzira što njega nisam položio na zimu (4 ECTS) upisati redovno u ljetnom semestru diplomski rad?\n\n2) koji je krajnji rok za predati diplomski rad? odnosno smatra li se da produžujem studij za godinu dana ako taj predmet položim tipa na ljetnom roku a diplomski predam na zimu iduće godine?\n\n3) koja je najbolja strategija ako bih odlučio produžiti studiranje još godinu dana? možda pasti namjerno upravo ovaj predmet iz zimskog semestra? ili proći taj predmet pa predati diplomski na zimu? \n\nhvala puno",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138732": {
      "poster": "Nocna_smjena",
      "content": "@cavlic#138602 \n\n1. Koliko znam vrijede dosadašnja pravila za sve studente (predmeti iz zimskog semestra se mogu polagati na zimu, ljeto ili jesen i dekanski). Ti možeš upisati diplomski rad u ak. godini u kojoj teoretski možeš završit studij (znači ako si upisao SVE predmete predviđene za 2. godinu diplomskog studija). Ako nisi upisao samo jedan predmet predviđen diplomskim studijem onda ne možeš upisati diplomski rad u toj godini.\n\n2. Neznam jesam li dobro pitanje shvatio. Za polaganje svih predmeta imaš vremena do početka iduće ak. godine (znači 1.10. u godini ili par dana gore, dolje). Svi rokovi u svezi diplomskog rada su ti na [ovom](https://www.fer.unizg.hr/predmet/diprad/rokovi) linku. Ti možeš diplomski rad polagat i u zimskom semestru iduće ak. godine i onda će ti promocija biti negdje u travnju u prostorijama FER-a, a ako položiš na ljeto onda u listopadu u koncertnoj dvorani Vatroslava Lisinskog. Toe jedina razlika koju sam ja primjetio između zimskog i ljetnog diplomskog rada. Status magistra i službeni završetak studija tek stječeš kad si položio sve predmete i diplomski rad (možeš i prvo položit diplomski rad pa tek onda zaostale predmete).\n\n3. Za strategiju neznam jer još nisam došao do te faze LoL. Znam ako želiš upisati diplomski rad na zimu da ti onda smije ostat najviše samo JEDAN nepoložen predmet jer prema pravilniku o studiranju ti uz diplomski rad smiješ imat samo još jedan predmet upisan.",
      "votes": {
        "upvoters": [
          "cavlic"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138734": {
      "poster": "Filemon",
      "content": "@cavlic#138602 \n\n> @Nocna_smjena#138732 Koliko znam vrijede dosadašnja pravila za sve studente (predmeti iz zimskog semestra se mogu polagati na zimu, ljeto ili jesen i dekanski). Ti možeš upisati diplomski rad u ak. godini u kojoj teoretski možeš završit studij (znači ako si upisao SVE predmete predviđene za 2. godinu diplomskog studija). Ako nisi upisao samo jedan predmet predviđen diplomskim studijem onda ne možeš upisati diplomski rad u toj godini.\n\nne, uz diplomski se može upisati još jedan predmet, te je moguće upisati diplomski samo ako je zbroj ECTS-a nepoloženih i neupisanih predmeta najviše 10, što i piše u [uputama](https://www.fer.unizg.hr/intranet/studenti/upis/upute). \n\n> @Nocna_smjena#138732 (možeš i prvo položit diplomski rad pa tek onda zaostale predmete).\n\ndiplomski se može braniti tek kad položiš sve ispite\n\nostalo je ok mislim",
      "votes": {
        "upvoters": [
          "[deleted]",
          "cavlic"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138887": {
      "poster": "cavlic",
      "content": "@Nocna_smjena#138732 koliko sam shvatio, ovaj JEDAN predmet koji je ostao mogu položiti sad na zimu, ljeto ili jesen te na dekanskom roku. upisati diplomski rad onda mogu\n\n1) početkom ljetnog semestra **ove** ak. godine\n\n2) početkom zimskog semestra **iduće** ak. godine\n\nako se odlučim za opciju 2 ostaje mi cijeli ljetni semestar slobodan i tek onda u 10. mj. počinjem pisati diplomski rad i s njime završavam na zimu 2022. je li ta opcija legitimna i mora li se nešto posebno platiti? \n\nhvala!! :)\n\nčak mislim pitati referadu vezano uz detalje, zanima me samo je li takvo što moguće jer mi se čini kao savršena opcija haha",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138894": {
      "poster": "SergeantPepper (Chet)",
      "content": "@cavlic#138887 ako padneš taj predmet i oduličiš diplomski branit u zimskom iduće godine, koliko ćeš ects-a imat u ovoj ak. godini?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138908": {
      "poster": "cavlic",
      "content": "u ovoj ak. godini sam na zimskom semestru do sad položio 36 ECTS-a (imao sam 2 predmeta iz prošlog zimskog semestra koje sam prenio i položio sada). znači sveukupno sam upisao 40 ECTS-a i položio 36, a potrudit ću se sad na zimskom položiti i ovaj od 4 ECTS-a",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138916": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@cavlic#138887 Pitanje je jel možeš birati, s obzirom na to da ćeš moći upisati diplomski on će ti se automatski upisati, ali ako ne položiš taj predmet na zimu nećeš moći obraniti diplomski do jeseni\n\nMislim da ti je jedini način da upišeš diplomski u zimskom semestru da:\n\n- imaš 2 predmeta ili više od 10 ECTSa u ljetnom za upisati\n- padneš diplomski na ljeto\n- nekako nagovoriš referadu da ti ispiše diplomski na ljeto (što nisam siguran da možeš uopće)\n\nAli onda opet, upitno je kako gledaju kad taj predmet koji možeš proći, možeš proći na roku. Ako ga ne gledaju tako, onda ti se neće upisati diplomski na ljeto.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138919": {
      "poster": "Emma63194",
      "content": "Razmišljam o tome pasti Seminar i jedan predmet od 5 ECTS-a idući semestar (konkretno, NOS)\n\nOno što me zanima jest, je li profesor dužan držati ponavljačku grupu iduće godine kad krene fer3 diplomski ili ne?\n\nAko ne, onda bi to u biti značilo da tko god padne, slušao bi NOS u zimskom semestru s fer3 ekipom.\n\nZanimaju me sada dva scenarija: prvo, može li se desiti da gradivo bude toliko različito da ne priznaju za fer2 i da se onda moram prebaciti na fer3?\n\nDrugo, što ako taj fer3 NOS bude imao manje ECTS-a nego ovaj na fer2? Što onda napraviti?\n\nKome se možda najbolje obratiti s tim pitanjima, nositelju predmeta, StuSlu ili možda čak prodekanici?\n\nNajviše me u biti zanima mogu li se sjebati s tom odlukom da sad kažu da se moram prebaciti na novi program (pa upisivati još hrpu predmeta) i smiju li to opće napraviti, odnosno, postoji li neko pravilo koje \"mene štiti\" da moram moći dobiti priliku ponovo odslušati predmet i da mogu ostati na ovom studijskom programu na kojem jesam?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "InCogNiTo124"
        ]
      }
    },
    "138931": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Emma63194#138919 je li profesor dužan držati ponavljačku grupu iduće godine kad krene fer3 diplomski ili ne?\n\nFormalno nije\n\n> @Emma63194#138919 može li se desiti da gradivo bude toliko različito da ne priznaju za fer2 i da se onda moram prebaciti na fer3?\n\nAk si potpisala ugovor ko ekipa na preddiplomskom da se obvezuješ prebaciti na FER3 ako nešto padneš, onda moraš. Međutim vjerojatno će se predmet priznavati kao ekvivalent.\n\n> @Emma63194#138919 Drugo, što ako taj fer3 NOS bude imao manje ECTS-a nego ovaj na fer2? Što onda napraviti?\n\nOnda ćeš morati upisati ekstra predmet u skupini da zadovoljiš strukturu. To znači da ćeš morati upisati 4. predmet iz 1. semestra. Ako se taj predmet više neće održavati kao i NOS, onda si se softlockala, što znači da će ti to biti prisila da promijeniš program (jer u suprotnom ne možeš više završiti FER2 na RZu) ili će se riješavati na poseban način.\n\n> @Emma63194#138919 Kome se možda najbolje obratiti s tim pitanjima, nositelju predmeta, StuSlu ili možda čak prodekanici?\n\nStuslu.\n\n> @Emma63194#138919 Najviše me u biti zanima mogu li se sjebati s tom odlukom da sad kažu da se moram prebaciti na novi program\n\nMožeš, uvijek\n\n> @Emma63194#138919 smiju li to opće napraviti, odnosno, postoji li neko pravilo koje “mene štiti” da moram moći dobiti priliku ponovo odslušati predmet i da mogu ostati na ovom studijskom programu na kojem jesam?\n\nNe lol\n\nU praksi su se održavale ponavljačke grupe, ali koliko mi je poznato to nije bilo neko pravilo nego solidarnost nositelja (uz eventualno pritisak od iznad). U stvari, u pravilniku se jedva spominju predmeti kao nešto relevantno za završetak studija, već broj ECTSa po skupinama predmeta. Predmetima se bave programi, a konkretno kod FER2 programa koji ima 1200 stranica ne piše ništa oko toga, nego se opisuju sami predmeti.\n\nIsto tako, FER3 tranzicija se čini različita na diplomskom od preddiplomskog jer koliko mi je poznato nisu se potpisivali ugovori da se prebacuješ na FER3 ako padneš, što znači da je jedini failsafe pravilo od max 2 upisa. Tranzicija bi mogla biti puno kaotičnija, jedina je sreća što je diplomski puno jednostavniji od preddiplomskog u pogledu koliko je moguće delayati predmete, pa onda nema tolikih problema s ekvivalentima i prebacivanjem.\n\nNaposljetku, za diplomski je ljude briga manje nego za preddiplomski, tako da treba biti oprezan.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138975": {
      "poster": "Emma63194",
      "content": "> @micho#138931 U praksi su se održavale ponavljačke grupe, ali koliko mi je poznato to nije bilo neko pravilo nego solidarnost nositelja (uz eventualno pritisak od iznad).\n\nJel to onda znači da postoji šansa da se i Seminar i Projekt ne bi održali za godinu, odnosno dvije?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138985": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Emma63194#138975 Hm uvijek postoji šansa, no kod tih predmeta ti je dosta lakše iz razloga što ih mentori mogu održati neovisno o drugima, nemaš predavanja, ispita, nego samo te rokove i prezentacije.\n\nIsto tako, zar na FER3 diplomskom nema Seminara/Projekta? Mislim da to na FER3 imaš čak u sva 4 semestra (ili umjesto seminara još jedan projekt, tako nešto?), samo je pitanje ECTSa u tom slučaju, jer vidim da na FER3 trebaš manje ECTSa za rad s mentorom, 39 po pravilniku umjesto 41 koliko je trenutno (3 seminar, 8 projekt, 30 diplomski).",
      "votes": {
        "upvoters": [
          "Emma63194"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139474": {
      "poster": "johndoe",
      "content": "Zna li netko koliko je fakultet fleksibilan što se tiče dopuštanja upisivanja diplomskog uz dva predmeta u semestru, ako u tom semestru imamo pravo ostvariti 120 ECTS? Basically, FAQ fakulteta kaže da imamo pravo samo jedan predmet uz diplomski. Koliko su fleksibilni ako hoćemo još jedan? Suma oba predmeta 7 ECTS.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139845": {
      "poster": "Nocna_smjena",
      "content": "@johndoe#139474 salji mail stuslu ili prodekanici za nastavu. Simple 😂\n\nAli tbh glupo mie da ti to ne odobre",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139849": {
      "poster": "johndoe",
      "content": "@Nocna_smjena#139845 ma znam, morat ću poslati, samo sam čuo sam da se ljudima hrpa molbi odbija otkad je nova prodekanica, čak i onih najbanalnijih. Ovo bi mi bilo suludo da mi se ne odobri.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139860": {
      "poster": "Nocna_smjena",
      "content": "@johndoe#139849 well mogu iz osobnog iskustva rec dae barem prema meni dobra. Odobrila mi par molbi koje sam joj tijekom studija slao (pricam o Mihaeli)",
      "votes": {
        "upvoters": [
          "johndoe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139916": {
      "poster": "neZnamNista",
      "content": "kod diplomskog studija, je li moguće da se ne upiše nijedan predmet s ljetnog semestra, tj. da semestar bude prazan\n\n1. godina sam diplomskog i zanima me je li moguće da ovu godinu položim sve kontinuirano ,a da u drugoj u dogovoru s mentorom ne upišem projekt. kako bi onda imao 22 ects-a u čitavoj godini htio bih nadoknaditi te ECTS bodove upisom zimskih predmeta da ispunim prag od 30 ects. primjetio sam da je sličnan način korišten ali uz upis predmeta na ljetnom semestru, ali kako nema na drugoj godini u tom semestru ništa osim diplomskog mislio sam da je ovo možda bolja alternativa.  bi li me ta kombinacija oslobodila od plaćanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139920": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@neZnamNista#139916 Ne možeš samo tako birati mentorske predmete koje nećeš upisati, jer se upisuju automatski. Trebaš pregovarati s referadom o tome ili namjerno pasti seminar, a referada ti ne smije ne upisati projekt samo da bi ti produljio godinu (znam jer su meni rekli da ne bi uopće smjeli pričati sa mnom o taktikama produljenja studija).\n\nA zimske predmete možeš samo upisati ako ih padneš. Tako da ako položiš sve kontinuirano u 1. godini, time si se softlockao da završavaš studij sljedeće godine, osim ako padneš projekt pa produljiš pola godine za simboličnu cifru od 8400 kn (jer ćeš imati 22 ECTSa), ili diplomski za 4200 kn. Alternativno, možeš onemogućiti upis diplomskog tako da u zimskom semestru padneš više od 10 ECTSa, ali to je skuplja opcija, dakle minimalno 1540 kn. Postoje i još neke taktike naravno.\n\nNajlakši način je jednostavno pasti seminar i ne upisati/pasti predmet od 5 ECTSa u prvoj godini, kao što smo rekli već nekoliko puta.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139945": {
      "poster": "Emma63194",
      "content": "@neZnamNista#139916 Još jedna alternativa kod toga ti je sljedeća: padni predmet specijalizacije (4 ECTS-a), društveni (2 ECTS-a) i Seminar (3 ECTS-a) što je onda ukupno 9 ECTS-a i 1260 kn. \n\nOvo čisto ako si u situaciji da si na RZ (za druge module ne znam) i nemaš puno izbora oko predmeta od 5 ECTS-a (teorijski predmeti) i nisi siguran za te i ostale od 5 ECTS-a (recimo, predmet specijalizacije ili matematički predmet) hoće li se održati iduće godine ili ne, a za neke predmete već sada vidiš da imaju svoj ekvivalent na fer3 (recimo, AVSP ili Paralelno programiranje).  \n\nAko se i društveni ne održava ponovo na ljeto, lako upišeš samo dva na zimu i imaš zadovoljeno koliko trebaš ECTS-a iz te skupine predmeta.\n\nOpcija da se padne samo Seminar i nadopuni tih 5 ECTS-a do 30 dodatnim predmetom i mene zanima, ali nisam sigurna može li to onda spriječiti plaćanje pune školarine.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139998": {
      "poster": "Zuzu (Coffe123)",
      "content": "npr. u situaciji pada saminara i 5ectsa na 1.godini diplomskog i tada na 2.godini diplomskog upisujemo 30ectsa jer se popuni projekt. E sad hipotetski da na toj drugoj godini, na zimu, padnes neki predmet(nemaš uvijet za rok) , može li se onda u ljetnom semestru uz seminar upisati još neki predmet van obaveznih kako bi se nadopunili ectsi da se ne plati godina?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140000": {
      "poster": "jelica (ajmemeni)",
      "content": "@neZnamNista#139916 meni su u referadi rekli da mogu ne upisat predmet, da ce mi u aplikacija izbacit upozorenje da sam odabrala manje ectsa nego preporuceno ali da se moze",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140002": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Zuzu#139998 Ovisi o modulu/kategoriji predmeta\n\nNa RZ-u npr. možeš samo ako je neki neobavezni (jer od obaveznih nemaš što za odabrati). Možda se može uz upisivanje predmeta izvan strukture.",
      "votes": {
        "upvoters": [
          "Zuzu (Coffe123)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141352": {
      "poster": "basketbaler (Burek sa sirom)",
      "content": "Trenutno sam završio 1. semestar diplomskog fakulteta i položio sam 32 ECTS-a. Želim produžiti studij za godinu dana\n\nBih li mogao produžiti studij ako padnem seminar i ne upišem jedan predmet matematke,fizike i prirodoslovlja sad u ljetnom semestru ( muči me sto su ti predmeti matematike fiz i prirodoslovlja 4 ectsa pa sa seminarom koji je 3 to je ukupno 7 ectsa, pa nije zadovoljeno onih 8 ectsa koje sam pročito da treba pasti).\n\nTakođer, kada se treba plaćati nepoložene ectse, kada smo ih položili manje od 55 ili kada smo ih pali više od 5?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141368": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @basketbaler#141352 Bih li mogao produžiti studij ako padnem seminar i ne upišem jedan predmet matematke,fizike i prirodoslovlja sad u ljetnom semestru ( muči me sto su ti predmeti matematike fiz i prirodoslovlja 4 ectsa pa sa seminarom koji je 3 to je ukupno 7 ectsa, pa nije zadovoljeno onih 8 ectsa koje sam pročito da treba pasti).\n\nMogao bi, ali ćeš onda platiti cijelu godinu\n\n> @basketbaler#141352 Također, kada se treba plaćati nepoložene ectse, kada smo ih položili manje od 55 ili kada smo ih pali više od 5?\n\nPlaćaš ponovne upise kad ih je više od 5 ECTS-a",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141387": {
      "poster": "Emma63194",
      "content": "> @basketbaler#141352 muči me sto su ti predmeti matematike fiz i prirodoslovlja 4 ectsa pa sa seminarom koji je 3 to je ukupno 7 ectsa, pa nije zadovoljeno onih 8 ectsa koje sam pročito da treba pasti\n\nNeki nose i 5 ECTS-a, baci oko na predmete koji se nude.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141402": {
      "poster": "basketbaler (Burek sa sirom)",
      "content": "@micho#141368 To bi onda plaćao na upisu šeste godine?\n\n A u slučaju da padnem jedan od teorijskih predmeta profila, a ne upišem seminar, tada bih mogao produžiti bez plaćanja?\n \n@Emma63194#141387 a ako bih idući semestar onda upisao neki predmet od tih što nose 5 ectsa, onda nebi morao plaćati?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141531": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @basketbaler#141402 To bi onda plaćao na upisu šeste godine?\n\nDa\n\n> @basketbaler#141402 A u slučaju da padnem jedan od teorijskih predmeta profila, a ne upišem seminar, tada bih mogao produžiti bez plaćanja?\n\nNe možeš samo tako ne upisati seminar jer se automatski upisuje, morao bi razgovarati s referadom i s mentorom o tome.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "145858": {
      "poster": "Nocna_smjena",
      "content": "Just out of curiosity pitam i no offence meant\n\nZasto se neki odlucuju produziti studij da mogu paralelno i raditi? Ja gledam sto se prie faksa rijesiti tako da ne moram imat faks nonstop na pameti. Znam dae fakultetsko obrazovanje gotovo, da nemam vise nikakve brige oko toga da necu predmet proci i da se mogu poslu skroz posvetit ili odseliti iz HR. Dzeparac se zaradi preko ljeta, zime, pauze izmedu zimskog i ljetnog semestra i tijekom akademske godine se mogu neke sitnije stvari raditi od par h dnevno",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "145859": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Nocna_smjena#145858 Ne produljuješ nužno da bi mogao raditi, to možeš i bez\n\nproduljuješ da bi napravio bolji diplomski, da bi imao manje stresan diplomski, da bi si napumpao radni staž, možda da imaš više vremena pronaći karijeru (jer surprise, surprise, neki ni na diplomskom ne znaju šta će raditi), ima dosta razloga",
      "votes": {
        "upvoters": [
          "Filemon",
          "MsBrightside",
          "Nocna_smjena",
          "Simpy",
          "Zuzu (Coffe123)",
          "bb8 (zaza)",
          "kix7 (Fish99)",
          "madoxx"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "145902": {
      "poster": "allien",
      "content": "@Nocna_smjena#145858 vjv uz ove koje je @micho  naveo ima i dosta onih koji samo zele jos godinu dana uzivat u studentskom zivotu",
      "votes": {
        "upvoters": [
          "BigZ1",
          "Erinon",
          "Filemon",
          "Murin",
          "Simpy",
          "Svarog (Veles)",
          "Svudec",
          "Zuzu (Coffe123)",
          "ardi (sprut)",
          "bb8 (zaza)",
          "boss15",
          "kix7 (Fish99)",
          "madoxx"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "146538": {
      "poster": "jitser",
      "content": "Koja je procedura ako želimo \"pasti\" Diplomski rad kako bi si produžili studij na način da ga ponovno upišem u idućem semestru? Konkretno, jel se odmah na početku semestra to kaže mentoru i tu prestaje ikakav rad za kolegij sve do idućeg upisa?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "146541": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@jitser#146538 kaži mentoru da ne bude iznenađen, da ne potroši vrijeme, a pasti možeš i da jednostavno profulaš neki rok ili ne dođeš na obranu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "147316": {
      "poster": "aKul (Vili Beroš)",
      "content": "@johndoe#139474 \n\nJel su ti odobrili molbu? odnosno imas li bilo kakvav feedback? Imam istu situaciju i ne vidim smisao u takvom glupom pravilu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "147546": {
      "poster": "XiJinping (JusufBideni )",
      "content": "@XiJinping#109871  Znači dogodio mi se najsjebaniji shit što se tiče ove sheme. Imao sam 35 ECTSa upisanih ovaj semestar, i od jednog predmeta (koji mi je bio izvan strukture studija) sam instant odustao u 11. mjesecu s namjerom da ga ispišem na kraju godine. Pao sam kao što sam i planirao 10+ ECTS-a da se aktivira klauzula da ne mogu upisati diplomski rad, ali su oni \"izmislili\" neki uvjet nakonadno koji ja prije nisam mogao naći, a to je uvjet da ukoliko imam mogućnost završiti studij ove akademske godine, da moram upisati diplomski rad.\n\nE sad, ovaj predmet viška koji nisam položio nisam rješio ni labose te je profesor očito unio u sustav da ne mogu položiti njegov predmet ove godine te zbog tog predmeta (kojeg namjeravam ispisati i onako i ovako) ne mogu upisati diplomski rad. Ovaj sistem je apsurdno smiješan i pitaj Boga što se ovdje događa.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Filemon",
          "InCogNiTo124",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "turunturu (Cement)"
        ]
      }
    },
    "147554": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@XiJinping#147546 vec 10 minuta izgledam ovako:\n\nhttps://media1.tenor.com/images/fb3f2d1e814190100a4ae401b1660d5b/tenor.gif\n\nhtio si produziti vakultet godinu dana tako da ne upises diplomski rad\n\nzbog nekog predmeta nisi mogao upisati diplomski rad\n\nu cemu je problem?",
      "votes": {
        "upvoters": [
          "Emma63194",
          "InCogNiTo124",
          "[deleted]",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Emma63194",
          "Mioch",
          "XiJinping (JusufBideni )",
          "allien",
          "in1",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "147572": {
      "poster": "Filemon",
      "content": "@jadzia-dax#147554 htio je neupisat diplomski, a planirao je da bude zbog toga jer ima nepoloženo više od 10 ECTS iz zimskog sem, kako i piše u pravilniku o studiju i uputama za upis.\n\nNije ga upisao pukom srećom zbog nekog trećeg predmeta, jer nema uvjet iz labosa, inače bi se normalno upisao diplomski.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "InCogNiTo124",
          "[deleted]",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "147574": {
      "poster": "jadzia-dax (Jadzia Dax)",
      "content": "@Filemon#147572 so, jedina steta je da će morat na rokove iz ovog sto je planski pao?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Lyras"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "147676": {
      "poster": "XiJinping (JusufBideni )",
      "content": "@jadzia-dax#147574 Da, uglavnom samo to, ali ne kukam niti se žalim samo mi je smiješno kako stvari funkcioniraju.",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "InCogNiTo124",
          "[deleted]",
          "madoxx"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "147684": {
      "poster": "kavastoplim (kavustoplim)",
      "content": "nemam pravo polaganja za jedan predmet iz zimskog semestra pa nisam mogla upisati zavrsni ove godine. Znaci iduce godine bi upisala taj jedan predmet i zavrsni u zimskom semestru. Ako obranim zavrsni u drugom mjesecu traju li mi studentska prava sve do kraja akademske godine?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "147799": {
      "poster": "allien",
      "content": "@kavastoplim#147684 ne",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149933": {
      "poster": "login",
      "content": "Imam jedno pitanje. Vjerujem da je vec bilo odgovoreno posto ima stvarno puno objava, al evo brzinski ako netko zna. Sad sam 4. godina, sve redovno upisano i htio bi produljiti studij za 1 godinu. Buduci da nisam upoznat previse s tim svim forama oko placanja, zanima me da li se to moze nekako izvesti bez placanja, ili uz neko minimalno placanje. Hvala unaprijed.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149980": {
      "poster": "Emma63194",
      "content": "@login#149933 Ne znam ima li opcija da se ništa ne plaća. \n\nAko si RZ, najsigurnije mi se čini pasti predmet od 4 ECTS-a (za koji znaš da će se ponovo izvoditi iduće godine i da neće nositi manje), društveni predmet (nije te briga izvodi li se ponovo ili ne, možeš u zimskom semestru upisati dva i tako zadovoljiti tu skupinu predmeta) i Seminar, što je onda ukupno 9 ECTS-a.\n\nNe znam doduše postoji li ikakva garancija da će se Seminar ponovo izvoditi, a StuSlu već mjesec dana ignorira moj mail i nekako mi se čini da neću dobiti odgovor na to.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150004": {
      "poster": "login",
      "content": "A ako bi htjeli produzit za 1 semestar, malo citam na ferwebu, kazu da diplomski rad nije moguce upisat ako nam je ostalo 2 predmeta iz zimskog semestra. Jel moguce onda tipa na 5. godini u zimskom semestru ostavit 2 predmeta, ne upisat dipl. rad, na ljeto ili jesen polozit ta 2 predmeta i skupit 30 ectsa, pa sljedeci zimski semestar upisati diplomski rad i na taj nacin bi ispalo bez placanja ako sam dobro skuzio?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150008": {
      "poster": "Emma63194",
      "content": "@login#150004 Vidi @XiJinping#147546 \n\nTehnički možeš tako probati, ali nitko njih ne sprječava da kažu \"imaš prilike sada dovršiti studij, možeš upisati Diplomski\".",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "login"
        ]
      }
    },
    "150426": {
      "poster": "allien",
      "content": "@login#150004 nije li samo da ne mozes upisati 2 predmeta uz diplomski u istom semestru? a čak i ako vrijedi ovo što si napisao, time ces si produljit studij samo za semestar, a ne za cijelu godinu. Čim obraniš diplomski, gotov si sa studijem i gubiš sva studentska prava osim prava na rad preko student servisa, to ti ostaje jos 3 mjeseca nakon obrane.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150427": {
      "poster": "Amali (Amajli)",
      "content": "@allien#150426 @login#150004 \n\npise 10 ects nepolozeno i neupisano, meni se cini ko da je to broj ects zima+ljeto (zima nepolozeno na drugoj, ljeto pad na prvoj godini), a na ljetno je jos ogranicenje da je samo 1 predmet neovisno o broju ects-a (ako se dipl rad upisuje na ljeto ofc)\n\ndakle ako ostavis 11+ ects iz zime za ljeto/jesen, prema ovom ti se dipl rad nece upisati? ja mislim, tak mi je i frendica objasnila da je ona tak skuzila. ona je doduse htjela upisat rad pa je polozila te predmete pa nez jel se zaista ne upise\n\n[img fancy=off]https://fer.studosi.net/assets/files/2021-03-05/1614988658-882708-image.png[/img]\n\nsoz na slikanom ekranu, iskopala sam sliku koju mi je frendica poslala",
      "votes": {
        "upvoters": [
          "allien",
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150478": {
      "poster": "login",
      "content": "@allien#150426 Da u tom slucaju se produzuje za 1 semestar samo.\n\n@Amali#150427 Moguce, samo me zbunilo ono sto je prije napisao kolega jusuf, ne znam jesam li dobro skuzio, al on je ostavio za rok predmete iz zimskog semestra 2. godine diplomskog, al su mu svejedno upisali diplomski rad. Znaci onda bi trebalo ostavit 11+ ects-a iz zimskog semestra 2. godine da se ne upise diplomski rad?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150487": {
      "poster": "Emma63194",
      "content": "@login#150478 @Filemon#147572 \n\nStvarno, čitaj malo thread. Većina informacija ti je tu tako i tako.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150493": {
      "poster": "Amali (Amajli)",
      "content": "@login#150478 ha prema ovom bi trebalo bit iako prema njegovom slucaju gledaju ipak nesto petnaesto i zanemaruju ogranicenja skroz, tak da ne bih se oslanjala na to osim ak ih pitas da mozes trazit da se ne upise, al ak nisu kolegi dali vj nisu milostivi\n\n1) Mozda mozes isto nac neki predmet koji ima uvjete na labose i kont i rok, pa se onda ne moze upisati nikako, al msm da se onda mora platit full jer je ispod 30 ects-a u toj godini, iirc to je granica pune cijene i samo nepolozenih ectsa\n\nBas ne zele da se produljuje bez placanja\n\n2) A uz placanje sam pol godine I believe (ak imas 30ects iz zime) mozes pitat mentora da te srusi kad se upise? Zvuci ko best case scenario ak jedu govna s ovim \"vise od 10 nepolozenih ectsa\", bar ako gledamo samo drugu godinu.\n\n3) Stignes i past neka dva predmeta sad u ljetnom pa ti je _to_ best case scenario za placanje ak zajebavaju jer msm da je taj uvjet strog (sam jedan predmet uz rad). Doduse i to bi se moglo pitat stuslu jel se drze tog, just in case\n\n3.a) ako padnes sad na ljeto dva u vrijednosti N ectsa, iduce godine polozis te ljetne al padnes dva na zimu od N ectsa, platis 2*N ectsa i produljis 2 semestra? Ovo bi mi netko trebo potvrdit al mentalna gimnastika kaze da bi trebalo funkcionirati jer ces imat 30 ectsa na drugoj godini pa placas samo nepolozeno opet. Kljucno je da bude ukupno isti broj ectsa zimski i ljetni\n\nBar sam ja tak skopcala ta njihova pravila, i to su ti sve opcije koliko znam\n\nGlhf",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "150497": {
      "poster": "login",
      "content": "> @Amali#150493 3.a) ako padnes sad na ljeto dva u vrijednosti N ectsa, iduce godine polozis te ljetne al padnes dva na zimu od N ectsa, platis 2*N ectsa i produljis 2 semestra? Ovo bi mi netko trebo potvrdit al mentalna gimnastika kaze da bi trebalo funkcionirati jer ces imat 30 ectsa na drugoj godini pa placas samo nepolozeno opet. Kljucno je da bude ukupno isti broj ectsa zimski i ljetni\n\nE da ovo sam upravo razmisljao, mislim da bi to cak bio najbolji moguci scenarij, jedino je sad pitanje kako ce postupit buduci da je fer3 za nama, past neki predmet pa upisat ekvivalent na njihovom programu, nisam siguran al ovo bi bila najbolja opcija. Hvala puno!",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "151875": {
      "poster": "johndoe",
      "content": "@aKul#147316 Nisam još ni slao jer je za idući semestar tek, a i vjerojatno mi neće ni trebati",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "151879": {
      "poster": "nickname",
      "content": "Ako ja položim sve s prve godine diplomskog studija a ne upišem projekt nagodinu, mogu li ja tih 8 ectsova napunit tako da upišem ekstra predmete? Npr. upišem 5 teorijskih predmeta profila umjesto 3?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "151881": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @nickname#151879 Ako ja položim sve s prve godine diplomskog studija a ne upišem projekt nagodinu\n\nOvo ne možeš samo tako jer ti se projekt upisuje automatski, dakle moraš žicat da ti ga ispišu na što, naravno, nemaš pravo, dakle ovisi kak će se netko osjećat oko toga\n\n> @nickname#151879 mogu li ja tih 8 ectsova napunit tako da upišem ekstra predmete?\n\nBez da ti ekstra predmete ne klasificiraju kao predmete iz te skupine, ne.",
      "votes": {
        "upvoters": [
          "nickname"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153949": {
      "poster": "basketbaler (Burek sa sirom)",
      "content": "Gore je navedeno da u slučaju pada seminara i jednog predmeta od 5 ECTS-a zimskog semestra se (besplatno) može produljiti godina.\n\nVrijedi li to i ako se padne seminar ali i predmet iz ljetnog semestra? \n\nTakođer položio bih ove godine 55 ECTS-a pa jel bi morao plačati šta ako padnem tih 8 ECTS-a od seminara i jednog predmeta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153951": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@basketbaler#153949 Nije besplatno jer moraš platit 8 ECTS-a. Besplatno je jedino ako jedan od tih predmeta uspiješ ne upisati, ali to se po pravilniku ne može, dakle na milosti si i nemilosti stuslu.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153953": {
      "poster": "basketbaler (Burek sa sirom)",
      "content": "@micho#153951 Znači platio bih 8 * 140 (ako je tolko po ECTS-u), ali bih se izvukao da ne moram plaćati 8400 ili 4200",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153963": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@basketbaler#153953 da",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154075": {
      "poster": "Asura (Asura)",
      "content": "Jedna dobra ideja koja mi je pala na pamet je upisati predmet koji se zna da se nece pedavati te godine pa se automatski ispise, a zamjenskih recimo stavis 0, ako se moze to :D",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154119": {
      "poster": "MsBrightside",
      "content": "@micho#141368 znači li ovo da ja sad kako nisam upisala dva predmeta namjerno moram plaćat čitavu godinu čak i ako budem imala položeno 42 ects boda? Ja sam ovaj semestar upisala 22 ects-a. Šta će mi se sad dogodit na kraj akademske",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154121": {
      "poster": "miss_anthropocene (neunist.iva)",
      "content": "@MsBrightside#154119 ja sam u ljetnom semestru prošle godine namjerno upisala manje ECTS-a (22 isto, mislim) i sve mi je bilo normalno, ništa nisam morala platiti",
      "votes": {
        "upvoters": [
          "MsBrightside",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154122": {
      "poster": "MsBrightside",
      "content": "@miss_anthropocene#154121 imala sam ode mini srčani tako da hvala 😄",
      "votes": {
        "upvoters": [
          "miss_anthropocene (neunist.iva)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "154126": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@MsBrightside#154119 Ak si na 1. godini diplomskog, da\n\nne plaćaš jedino ak završiš studij pa prošla godina na novom studiju ne postoji\n\nscrollaj skroz dolje http://www.unizg.hr/studiji-i-studiranje/\n\nEDIT: Gledaju se ECTSi u godini, ne u semestru 🙄",
      "votes": {
        "upvoters": [
          "Simpy"
        ],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154127": {
      "poster": "miss_anthropocene (neunist.iva)",
      "content": "@micho#154126 ??\n\nkolegica ce imat 30+ ectsa u godini, ne znam zbog ceg ju traumatiziras bezveze",
      "votes": {
        "upvoters": [
          "Filemon",
          "Mioch",
          "MsBrightside",
          "[deleted]",
          "[deleted]",
          "jelica (ajmemeni)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154128": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@miss_anthropocene#154127 nisam vidio da priča o semestru umjesto o godini, ispravit ću",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "166352": {
      "poster": "Sveti_Ilija (Sveti Ilija)",
      "content": "Planiram ovaj semestar završiti preddiplomski, nakon toga uzeti godinu pauze i onda diplomski upisati vani. Rado bih nekako zadržao studentska prava tu godinu pauze, ali nisam siguran kako. \n\nPrva opcija je da upišem diplomski iz memea i ništa ne položim. Ako ga ispišem nakon toga, zanima me je li moguće u budućnosti vratiti se i pokušat ga završiti (i platiti tih 8400 koje će me čekati)\n\nDruga opcija je da padnem neki predmet sada i upišem ga ponovno sljedeće godine, no kako sam shvatio, završni ne mogu braniti ako sam pao neki drugi predmet. To znači da bih trebao pasti ili taj predmet i završni ili samo završni. Ako padnem samo završni, trebam li ga sljedeće godine upisati u zimskom semestru (tada pretpostavljam da gubim prava odmah nakon obrane) ili ga mogu i u ljetnom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "166355": {
      "poster": "InCogNiTo124",
      "content": "> @Sveti_Ilija#166352 završni ne mogu braniti ako sam pao neki drugi predmet.\n\nZavrsni mozes branit cak i ako si pao nesto, za razliku od diplomskog. Znam kolegicu koja je uredno rjesila 3. godinu (skup s obranom), a na jesen predmete s druge xD",
      "votes": {
        "upvoters": [
          "Sveti_Ilija (Sveti Ilija)",
          "[deleted]",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "166357": {
      "poster": "menace_master",
      "content": "@Sveti_Ilija#166352 ja sam proslo ljeto obranila zavrsni, a pala jedan predmet iz ljetnog semestra i sad imam nenamjerni gap year 🤷‍♀️ ako ces ic ovim putem padni predmet od sto manje ects-a tako da sto manje platis",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "Sveti_Ilija (Sveti Ilija)",
          "[deleted]",
          "ink",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "InCogNiTo124",
          "thelonewanderer (Du är inte min chef!)"
        ]
      }
    },
    "181281": {
      "poster": "Nocna_smjena",
      "content": "@Sveti_Ilija#166352 In my opinion, ja nebi radio pauzu iz vise razloga. Prvo, kad se \"ohladis\", teze se je vratit nazad u fakultetski ritam. Drugo, dosta vise gradiva preddiplomskog ces zaboravit nego da nisi radio pauzu i time neki predmeti ti automatski postaju tezi. Trece, moguce je da ce se nesto u toj pauza godini dogoditi pa ces kasnije skuziti da nemas vise vremena za studiranje. Cetvrto, morat ces si naci novi crew s kojima polazes iste predmete (ja preferiram imat neke ljude koje znam duze vrijeme pa je lezernija atmosfera i mozete si pomagat oko gradiva). Peto, faks, tj. fakultetske obaveze ce ti prije sic sa pameti nego da ih ostavljas za kasnije. \n\nLogicno, ovo sve je pod pretpostavkom da imas u planu nastavit put do magisterija. Ja sam isto treca godina ali cu ici odmah na diplomski iz maloprije navedenih razloga",
      "votes": {
        "upvoters": [
          "Amon",
          "Sveti_Ilija (Sveti Ilija)",
          "lucija (luc)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "181282": {
      "poster": "ink",
      "content": "@menace_master#166357 u istoj sam situaciji ja, pao sam neka sranja u 5. semestru ali sam sad bez problema upisao Završni, i ako ga obranim, slijedeće godine ću imat samo nekoliko ECTSa u zimskom semestru i prazan ljetni\n\nNije mi baš jasno zašto ljudi govore da se ne može tako produljit",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "181286": {
      "poster": "Nocna_smjena",
      "content": "@Nocna_smjena#181281 Istina, priznajem, i ja bi volio mali odmor ali dugorocno gledano lakse je odmah sve rijesiti",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "181304": {
      "poster": "nairobi (light_grandma)",
      "content": "@Nocna_smjena#181281 ovo mi zvuci kao da si ti to htio napraviti pa se sad sam sebi opravdavas sto ipak nisi 🙃",
      "votes": {
        "upvoters": [
          "BreadCat",
          "Emma63194",
          "Filemon",
          "Svarog (Veles)",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "miss_anthropocene (neunist.iva)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "Ardura (Maddy)",
          "BreadCat",
          "Erinon",
          "JeleeII",
          "Nocna_smjena",
          "Sulejman",
          "Svarog (Veles)",
          "Vasili (Fasili)",
          "Vishnjevac",
          "Widlar",
          "bb8 (zaza)",
          "member",
          "mesojed (sofronijevicevPrst)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "miss_anthropocene (neunist.iva)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "181701": {
      "poster": "njofra",
      "content": "@Nocna_smjena#181281 Zavisi sto radis u toj godini pauze. Ja sam uzeo godinu pauze od faksa za odraditi praksu vani i iako je sve sto si nabrojao istina, jako mi je drago da sam to napravio. Bilo je izvrsno iskustvo, podebljao sam si CV, zaradio nesto, dosta putovao, dobio odlicnu ponudu za posao... Tesko je vratiti se, ali ponovio bi svaki put da imam opciju. S druge strane, ako planiras provesti tu godinu samo za 'mali odmor', onda se definitivno ne isplati zbog svega sto si naveo.",
      "votes": {
        "upvoters": [
          "BreadCat",
          "Nocna_smjena",
          "Svarog (Veles)",
          "Vasili (Fasili)",
          "orange"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "181724": {
      "poster": "Nocna_smjena",
      "content": "@njofra#181701 Ma jasno. Neki se mogu vratit nazad u ritam ali nekima je to dosta teze ako ne i nemoguce kad su izasli iz sustava. Ovo sto sam gore govorio mislim da je najsigurnija opcija da ne skrenes s puta za ostvaranje titule magistra.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "iLabaviUmeDaZabavi (prvi do boga)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "203284": {
      "poster": "login",
      "content": "Ekipa imam neku kalkulaciju. Znaci ako ja u ovom semestru (2. semestar diplomskog) padnem linearnu algebru i avsp (4 + 4 ects), onda sljedeci zimski semestar napravim isto, ne ispunim neki uvjet npr. na 2 predmeta pa opet padnem 4 + 4 ectsa, na taj nacin bi ako se ne varam mogao produzit studiranje za godinu dana. Zanima me jel ovo najlaksi nacin za produzit ili postoji nes drugo?",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203288": {
      "poster": "Sulejman",
      "content": "@login#203284 Jednostavno padneš bilo šta na zadnjoj godini?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203289": {
      "poster": "login",
      "content": "@Sulejman#203288 Editirao sam post, zaboravio sam napomenut da sam 1. godina diplomskog",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203364": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@login#203284 Pad tih predmeta ti ne onemogućava upis Diplomskog. Diplomski ne možeš položiti bez da su položeni ti predmeti. Tak da ono što će ti se dogoditi regularno je da ćeš sigurno platiti 8 ECTSa ponovnog upisa, i onda ćeš ili završiti u roku, ili platiti 38/34/30 ECTSa radi pada Diplomskog (i ovih predmeta). I onda ćeš produljiti godinu jer ne možeš upisati Diplomski u zimskom semestru radi 2 predmeta. Ili pola godine ako položiš bar jedan od ta dva predmeta.\n\nA postoji li bolja taktika - naravno da postoji, samo treba pročitati malo gore.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203379": {
      "poster": "Emma63194",
      "content": "@login#203284 Zamoli mentora/icu da te sruši na Seminaru, padni jedan predmet od 4 ECTS-a (za koji znaš da će se ponovno održavati i da neće nositi manje ECTS-a) i padni društveni. \n\nSve bi ti trebalo biti ok. Društveni ako se i ne održi ponovo, lagano upišeš dva u zimskom semestru. Jedino je upitno kako će se Seminar održavati iduće godine.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203391": {
      "poster": "[deleted]",
      "content": "Koji ste vi cigani",
      "votes": {
        "upvoters": [
          "DazedAndConfused",
          "Svarog (Veles)",
          "Vishnjevac",
          "[deleted]",
          "gladiator",
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203395": {
      "poster": "[deleted]",
      "content": "de ne budite *insert rodno potkovana uvreda* i zavrsite to u 2 godine kako Bog zapovijeda i adio.",
      "votes": {
        "upvoters": [
          "iLabaviUmeDaZabavi (prvi do boga)"
        ],
        "downvoters": [
          "Simpy"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203398": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "Cisti babilon, ako oces past godinu plati jebeni ponovni upis, a ne na drzavnoj grbaci. CAO.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": [
          "Simpy"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203402": {
      "poster": "Emma63194",
      "content": "@abcdefgh#203391 Zašto?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203472": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@iLabaviUmeDaZabavi#203398 Ne znam jesi li toga svjestan ali školarina je samo jedan maaaaali dio ukupnih troškova za edukaciju. Šta ti misliš da su na medicini troškovi jedne godine 10000 kn? Jedan doktor ti Hrvatsku košta nekoliko milijuna kuna bahahah",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203480": {
      "poster": "login",
      "content": "@micho#203364 Hmm nisam te bas skuzio. Napiso si da bi mi se diplomski rad upisao u ljetnom semestru, al ako ja u zimskom direkt padnem 2 predmeta na nacin da ne ispunim neke uvjete za labose i slicno, onda mi se ne bi ni upisao diplomski rad jer imam 2 predmeta koja sam svakako pao i ne mogu te godine nikako zavrsit, a ects-e do 30 bi nadoknadio predmetima iz ljetnog semestra koje sam prije ostavio",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203481": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@login#203480 Ali svejedno bi mogao upisati diplomski, samo ga ne bi mogao završiti. Znači takvim upisom si praktički garantiraš pad diplomskog.\n\nPročitaj si malo bolje pravila pa ćeš vidjeti da se limitacija 1 predmeta uz diplomski odnosi na to kad upisuješ predmet uz diplomski. Tebi su ovi predmeti već upisani i ti ih teoretski ne padaš do kraja godine, samo ne možeš pristupiti rokovima ako su ti uvjet npr. labosi. Tako da ak hoćeš ostvariti da ne možeš upisati diplomski tim uvjetima, onda bi morao pasti još 3 ECTSa, ili 2 predmeta u ljetnom semestru.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203483": {
      "poster": "login",
      "content": "@micho#203481 Racunao sam na ovo da se moze jer ima ona fora da se diplomski moze upisat samo uz jedan predmet u tom semestru, 2 vec ne prolaze, a sad kolko je to izvedivo pojma nemam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203484": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@login#203483 Pa lijepo sam ti rekao, ti ta 2 predmeta ne upisuješ u istom semestru kao diplomski, nego u zimskom. Dakle to ti jedino štima ako upisuješ diplomski u zimskom semestru, što onda podrazumijeva da ga nisi mogao upisati, da ga nisi upisao uz molbu, ili da si ga pao pa ga ponovno upisuješ.\n\nA i ako pročitaš bolje pravilo, ono kaže da ti uz Diplomski ne možeš upisati 2+ predmeta. Dakle ne kaže da ne možeš upisati Diplomski ako imaš još 2+ predmeta, nego je to samo logička konsekvenca, da ne možeš ponovno upisati toliko predmeta, pa ne možeš ni završiti Diplomski bez da su položeni, pa ti ga nema smisla ni upisivati.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203526": {
      "poster": "Sele",
      "content": "@login#203480 Ako ti iš pomaže, pitao sam sada studentsku za ovaj slučaj ako se izgubi pravo polaganja na roku nekog predmeta zimskog semestra (ali samo 1) i odgovorili su mi da se u tom slučaju ne može upisati Diplomski rad u ljetnom semestru. Tako da je ista situacija i s 2 predmeta.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203537": {
      "poster": "login",
      "content": "@Sele#203526 e pa to sam ja i mislio, jer nekako mi nema smisla da ti upisu predmet od 30 ects koji nemas sanse polozit, tak da to je to",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203584": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Sele#203526 Kod ovog treba biti oprezan, jer neki predmeti ne okinu taj \"pao si\" gumb, i onda ti aplikacija ne zna da ga ne možeš upisati... Znam da ga AIPR okine iz prve ruke (jer sam pao preko labosa i odmah mi je pisalo da treba ponovni upis, i prije završetka semestra), ali znam da ga SIS **ne okine**, bar ponekad, iz druge ruke :)\n\nMislim u tom slučaju, u scenariju garantiranog pada ne bi actually išao pasti predmet nego bi išao u referadu, objasnio im da nema smisla da ti se upisuje diplomski kad se ne može završiti, i oni bi ti ga ispisali. Ali ako bi se ti predmeti vodili kao da ih nisi još pao, onda će ti aplikacija automatski upisati predmet. I onda ovisi hoće li to netko uhvatiti pa ti ga ručno maknuti ili ćeš morati ići u referadu da ti ručno maknu.\n\nNa FER3 je drukčije kad možeš jednostavno ne upisati te predmete.\n\nAl ne kužim zašto kolega umjesto da padne ove predmete jednostavno ne pita referadu da mu ne upišu projekt... Onda samo mora sve položiti da ne plati cijelu godinu, diplomski mu automatski neće biti upisan i onda na 3. godini ima samo projekt i diplomski. Znači ako prođe ta molba, ne treba pasti ni poduzimati išta više, samo prođeš sve u zimskom semestru i to je to.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Sele",
          "[deleted]",
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "203586": {
      "poster": "HeHe (Direktor života)",
      "content": "ja bih vas sve prijavio policiji",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Katie",
          "Sele",
          "Simpy",
          "SinanSuckich (Yelena)",
          "Svarog (Veles)",
          "Widlar",
          "nnn (dinoo)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "204047": {
      "poster": "Filemon",
      "content": "@micho#203481 krivo\n\n> Diplomski rad upisuje se u semestru u kojem će student ostvariti najmanje 120 ECTS-bodova i položiti sve predmete propisane studijskim programom njegovog profila. Uz Diplomski rad moguće je upisati najviše jedan predmet, a upis Diplomskog rada je moguć, ako je ukupan broj ECTS bodova nepoloženih i neupisanih predmeta potrebnih za završetak studija najviše 10 ECTS-a te ako student ima mogućnost polaganja ispita iz nepoloženog predmeta u jesenskom roku (ima pravo izlaska na ispit).\n\nkolega bi padom **2 zimska preko labosa + preostalih predmeta iz ljetnog koje bi ostavio** pao na uvjetu da ima više od 10 ECTS nepoloženih predmeta te da nema mogućnost izlaska na rok.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "204072": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Filemon#204047 Kolega nije pričao o ostavljanju predmeta u ljetnom, nego samo zimskom. Semestar u kojem je diplomski NEMA drugih predmeta za upis. Ovo pravo izlaska na jesenskom ne radi najbolje u aplikaciji tako da bi trebalo paziti da se oba tako upišu, kao što sam i rekao gooooore. A očito nije nešto što je po defaultu, nego nešto što se ručno stavlja.\n\nIsto tako, zanima me gdje si ovo našao jer ovaj citat nije ni iz pravilnika 2017., ni iz pravilnika 2020.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "204450": {
      "poster": "Filemon",
      "content": "> @micho#204072 Kolega nije pričao o ostavljanju predmeta u ljetnom, nego samo zimskom\n\nako bi kolega nadoknadio ectse kolegijima iz ljetnog koje bi prije ostavio, razmatra nešto past i u ljetnom.\n\n> @login#203480 a ects-e do 30 bi nadoknadio predmetima iz ljetnog semestra koje sam prije ostavio\n\njer ja ne vidim što inače može bit predmet iz ljetnog koje si prije ostavio.\n\n> @micho#204072 Isto tako, zanima me gdje si ovo našao jer ovaj citat nije ni iz pravilnika 2017., ni iz pravilnika 2020.\n\ncitat je [s uputa za upis semestra](https://www.fer.unizg.hr/intranet/studenti/upis/upute), jedina stvar u njemu koja ne postoji u pravilnicima je ovo s ima mogućnost izlaska na rok, ali to je i tako implicitan uvjet, jer predmet koji možeš ić na rok je nepoložen predmet u trenutku kad se upisuje diplomski.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "204465": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Filemon#204450 ako bi kolega nadoknadio ectse kolegijima iz ljetnog koje bi prije ostavio, razmatra nešto past i u ljetnom.\n\nOkej, my bad, nisam, skužio da se ovaj prvi pad odnosi na ljetni radi \"isto\", da, onda definitivno ni ne može upisati diplomski i produljuje godinu dana.\n\n> @Filemon#204450 jer predmet koji možeš ić na rok je nepoložen predmet u trenutku kad se upisuje diplomski.\n\nE, ali kao što sam rekao, ta klasifikacija je ručna, ne automatska, pa nije baš tako jednostavno. Ali skužio sam sad da je kolega mislio pad 8 ECTSa u ljetnom i 8 u zimskom. I onda ide to produljivanje godine bez problema, jedino uz plaćanje.\n\n*tl;dr* my bad, nisam skužio da se radi o padu u ljetnom i zimskom. Tak se može, nije baš najbolje riješenje, ali ide.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "206884": {
      "poster": "kremenko16",
      "content": "Ako moze netko pogledat jel propustam nesto preocito 😀 \n1. Godina:\n\nU 1. sem diplomskog sam pao Raspoznavanje uzoraka (5 ects) , a u 2. cu past Biblijsku teologiju 2 (2 ects). Znaci na prvoj god je rijesenih 53 ects, nema placanja godine.\n2. Godina:\n\nU 3. sem diplomskog upisem sve osim Diplomskog projekta (8 ects) da mogu izbjec upis Diplomskog rada. To je 23 ects upisana (iako u predmetima specijalizacije profila treba odabrati minimalno 8 ects, ja bi upisao 9 ects) plus Raspoznavanje uzoraka iz 1. semestra je 28 ects. U 4. semestru upisem ponovno Biblijsku teologiju 2 i to je ukupno 30 ects po godini, nema placanja godine.\n3. Godina:\n\nU 5. semestru upisem Diplomski projekt a u 6. Diplomski rad pa je ukupno za tu godinu 38 ects.\n\nMoro bi samo placat ponovni upis Raspoznavanja uzoraka i Biblijske teologije ( ukupno 7 ects) što je sigurno bolje od plaćanja cijele godine 😀",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "206887": {
      "poster": "SinanSuckich (Yelena)",
      "content": "@kremenko16#206884 kako mislis ne upisat projekt?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "206890": {
      "poster": "kremenko16",
      "content": "@SinanSuckich#206887 U studentskoj su mi rekli da se to moze, koliko je to tocno ne znam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "206892": {
      "poster": "Emma63194",
      "content": "> @kremenko16#206884 nema placanja godine.\n\nAli plaćaš 7 ECTS-a, to valjda znaš?\n\n> @kremenko16#206884 upisem sve osim Diplomskog projekta\n\nJa ovo ne bih uzela zdravo za gotovo da možeš tek tako ne upisati. Svašta studentska govori, radije to još detaljnije provjeri. \n\nNavodno su i maknuli uvjet Seminar -> Projekt pa ono, mislim da im je u interesu riješit se čim prije fer2 generacije, sumnjam da će tek tako dati produljenje studija.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "206893": {
      "poster": "kremenko16",
      "content": "@Emma63194#206892 \n\n> \n\n> @Emma63194#206892 Ali plaćaš 7 ECTS-a, to valjda znaš?\n\n> @kremenko16#206884 Moro bi samo placat ponovni upis Raspoznavanja uzoraka i Biblijske teologije ( ukupno 7 ects) što je sigurno bolje od plaćanja cijele godine 😀\n\nU krajnjem slucaju sve i da moram upisat Diplomski projekt, mogu ga past i platit i tih 8 ects ?",
      "votes": {
        "upvoters": [
          "Emma63194",
          "MsBrightside"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217462": {
      "poster": "Mariox",
      "content": "Koliko sam vidio, ima dosta studenata koji rade studentski posao na diplomskom.\n\nRazmatram je li mi se isplati raditi na pola radnog vremena (20 sati tjedno) tijekom diplomskog studija. \n\nPozitivne strane bi bile:\n\n-> naučim puno na radnom mjestu\n\n-> headstart za karijeru nakon što diplomiram (iskustvo za cv ili nastaviti raditi na mjestu gdje sam radio tijekom diplomskog)\n\n-> zarada\n\nNegativne strane:\n\n-> povećani rizik da ću morati produžiti faks\n\nAko se ispostavi da je pola radnog vremena + diplomski previše, onda bi standardna procedura bila produžiti faks za godinu dana. Produživanje faksa za godinu dana zbog posla se može gledati iz ove perspektive: \"zar se nije bolje samo više usredotočiti na faks da se dovrši što prije, pa da se onda može raditi s boljom plaćom nakon što se diplomira?\" Zanimaju me mišljenja o ovome. U mojoj situaciji novac nije presudan.",
      "votes": {
        "upvoters": [
          "kix7 (Fish99)",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217472": {
      "poster": "[deleted]",
      "content": "daj sam zavrsite faks kak je zamisljeno kaj izmasljate gluposti. puslice obicne",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "Emma63194",
          "Filemon",
          "Heklijo (Geralt of Rivia)",
          "Murin",
          "Svarog (Veles)",
          "Vishnjevac",
          "ZliDule",
          "[deleted]",
          "ates",
          "boss15",
          "nairobi (light_grandma)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Heklijo (Geralt of Rivia)"
        ],
        "tuga": []
      }
    },
    "217509": {
      "poster": "[deleted]",
      "content": "@Smoet#217472 dobar si ti smoe, ajde imaš plus kod mene za intership kad budem senior.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217514": {
      "poster": "InCogNiTo124",
      "content": "> @Mariox#217462 “zar se nije bolje samo više usredotočiti na faks da se dovrši što prije, pa da se onda može raditi s boljom plaćom nakon što se diplomira?”\n\nYes placa se poveca, al ti se troskovi vise povecaju, ak nista na javni prijevoz, dopunsko zdravstveno, razna osiguranja ak ces uzimat, jos je gore ak ces morat u svoj stan, ili te starci natjeraju da im pocnes placat. XD\n\nS obzirom da si rekao da ti pare nisu problem, onda je bolje radit preko diplomskog i podnest taj oportunitetni trosak ak bas padnes nest.\n\nUostalom produzenje studiranja uopce nije lose, ko prvo iksica (dakle menza + popusti po svuda na svijetu) ko drugo masa studentskih natjecanja na koja se mozes prijavit da stavis na CV, a i lakse ti je dobit poso ko student nego kasnije, recimo znam za jedan hrvatski startup kolika je razlika u intervjuima za praksu preko fera i ovako i ne bi covjek vjerovo\n\nDoduse ja sam malo biased, jer ja sam radio 4. i 5. godinu i stigo sve u roku zavrsit sa vecim prosjekom neg na preddiplomskom, a sad kad sam na pragu diplome sam shvatio da bi rade jos god dana da obavim neke stvari, neke natječaje i tak.\n\nIn the end, go for it, cak i ak popusis, dosl nis strasno osim (maximalno) 8400 hrk i vjecna labela \"oh shit nisam speedrunnao faks\" za koju, vjeruj mi, niko ne mari",
      "votes": {
        "upvoters": [
          "Filemon",
          "Mariox",
          "Sulejman",
          "[deleted]",
          "[deleted]",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217523": {
      "poster": "Vasili (Fasili)",
      "content": "@Mariox#217462 Nisam na diplomskom, ali radim već godinu dana u struci pa da nadodam neke prednosti i mane koje sam iskusio.\n\nPrednosti: \n- upoznao puno ljudi\n- predmeti su mi malo lakši jer radim (na poslu se upoznaš s puno tehnologija i za puno toga čuješ)\n- sad imam \"svoj\" novac\n- imam novo mjesto za učenje \n\nMane:\n\n- faks mi je postao još dosadniji\n- ne možeš ostati pit s ekipom do 5 ujutro bilo koji dan u tjednu\n- ne vidim toliko često ljude s faksa\n\n\nJel bi preporucio ljudima da se zaposle? Da, samo nađite dobru firmu koja vas neće tjerat da radite dok su ispiti.",
      "votes": {
        "upvoters": [
          "Fica (Prof)",
          "Filemon",
          "Heklijo (Geralt of Rivia)",
          "InCogNiTo124",
          "JeleeII",
          "Lyras",
          "Mariox",
          "Simpy",
          "Urmum (mamaRu)",
          "[deleted]",
          "[deleted]",
          "boss15",
          "kix7 (Fish99)",
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223197": {
      "poster": "don_gregot",
      "content": "Meni je ostala obrana rada i jedan 4-ECTS predmet iz zimskog semestra. U preddiplomskom sam nekoliko puta ponovo upisivao godinu pa je ispalo 5 godina, ali ne i na diplomskom (samo jednom ponovio jedan 5-ECTS predmet u zimskom semestru). Ukoliko ne uspijem na dekanskom položiti ovo što mi je ostalo, što mi se događa? Gubim li pravo na studij ili samo ponovo upisujem sve iznova? Koliko plaćam ECTS?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223202": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@don_gregot#223197 Samo upisuješ predmete isponova, ali to ti znači i da plaćaš cijelu godinu ak nemaš 30 ECTSa, ili 34 ECTSa ak te taj predmet od 5 ECTSa prebacio preko 30. To je pod pretpostavkom da ti odobre 3. upis, za što bi trebao slati molbu (i što bi trebalo biti odobreno s obzirom na to da je to zadnji predmet do završetka studija). Ako ti ne odobre, a predmet ne možeš zamijeniti nečim drugim da bi ispunio strukturu studija, da, letiš s faksa.",
      "votes": {
        "upvoters": [
          "don_gregot"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223206": {
      "poster": "don_gregot",
      "content": "@micho#223202 Hvala! Ovaj koji ponavljam sam riješio, ovaj koji mi još visi sam prvi puta upisao. Iz prošle godine imam 57 ECTSa (dobio malo ekstra preko izbornog), dok sam iz ove položio 31 ECTSa (uključujući ovaj ponovljeni).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223215": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@don_gregot#223206 Aha, onda ako taj padneš samo plaćaš 34 ECTSa kako sam i rekao, nemaš 3. upisa nit ima neke osnove zašto bi izgubio prava, jer diplomski bi pao tek 1. put. I onda najnormalnije polažeš taj predmet i diplomski u zimskom semestru.",
      "votes": {
        "upvoters": [
          "Filemon",
          "don_gregot"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "223420": {
      "poster": "HeHe (Direktor života)",
      "content": "pes mi nije dobro pa nisam ni ja dobro ):",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235573": {
      "poster": "iNavy (mornar Ica)",
      "content": "koliko minimalno ectsa se može upisati u godini a da sam i dalje redovit student (prvi upis 1. godine diplomskog)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235643": {
      "poster": "BigZ1",
      "content": "Znaci ja planiram produzit faks ali ne za semestar nego bas za godinu. Seminar 2 bih pao  (2.semestar) i potom bih pao projekt u 3.semestru kako bih ga mogao tek godinu kasnije upisati bez da upisem diplomski drito na zimskom semestru te 3.godine. Trebam li jos nesto pasti na drugoj ili prvog godini kako bi si ovo osigurao? (takodjer sve rupe u ects bodova bi popunio potpuno sa predmetima iz slobodnog izbora kako bih imao bodova tipa za dom i da zadrzim status studenta. Sad me zanima jel to onda izvedivo ili ne?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235644": {
      "poster": "BigZ1",
      "content": "@iNavy#235573 ja msm 30, msm da sam tako procitao gore u threadu.",
      "votes": {
        "upvoters": [
          "iNavy (mornar Ica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235695": {
      "poster": "PostarLakogSna (snedul)",
      "content": "Imam pitanje, nadam se da mi netko može razjasniti situaciju.\n\nNaime, zanima me što se događa dogodine ako bi produžio godinu samo s jednim predmetom od 5 ECTS-a?\n\nPlaćam li onda što fakultetu i kakva je situaciju s onim upisom više od 25 ECTS-a? Predmet je iz zimskog semestra.\n\nGubim li pravo na dom i stipendiju ijedne od narednih godina?\n\nMoram li ponovno pisati i braniti završni ukoliko sam ga već pisao i obranio ove godine, kakva je procedura s tim?\n\nNisam do sad nikad produživao ni prenosio pa zanima kakva je procedura oko ovih pojedinosti.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235949": {
      "poster": "kavastoplim (kavustoplim)",
      "content": "I mene zanima oko placanja, ja dogodine upisujem 22 ectsa koja su mi ostala (zavrsni + dva predmeta) pa jel moram placat 8400kn jer sam upisala manje od 30 ectsa?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235950": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@kavastoplim#235949 Ako produljiš godinu još jednom, da, samo radi upisa: ne",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236003": {
      "poster": "Kuhar",
      "content": "@PostarLakogSna#235695 \n\nOno sto ti ja mogu rec je da zavrsni neceas morat opet polagat. Ja sam produljio godinu s 4 predmeta i ne moram nikakav zavrsni ponavljat.",
      "votes": {
        "upvoters": [
          "Filemon",
          "General_Kenobi (Aborteur)",
          "Kikyy99",
          "PostarLakogSna (snedul)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236545": {
      "poster": "lalala",
      "content": "Jel mogu ne upisat projekt u aplikaciji? (diplomski fer 2)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236677": {
      "poster": "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA DŽIN)",
      "content": "@lalala#236545 \n\ntoi mene zanima, ima ko kakvih iskustva i jeste kontaktirali stuslu mozda?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236683": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@lalala#236545 Možeš ne upisati ali izgleda da ti se automatski upiše ako dozvoliš upis tog broja ECTSa",
      "votes": {
        "upvoters": [
          "lalala"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236688": {
      "poster": "Kiflica",
      "content": "@micho#236683 Upiše li se i ako nemamo položen seminar?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236693": {
      "poster": "tt98",
      "content": "Kako upisujem diplomski u zimskom? Jel ima neka molba ili nesto?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236694": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Kiflica#236688 Tad ne, nemaš preduvjet",
      "votes": {
        "upvoters": [
          "Filemon",
          "Kiflica"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236808": {
      "poster": "Svudec",
      "content": "@tt98#236693 Diplomski se ne može upisati na zimu. Postoje samo jesenski i ljetni upisi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236809": {
      "poster": "login",
      "content": "@Svudec#236808 pa kaj nije moguce u zimskom semestru imat diplomski rad?",
      "votes": {
        "upvoters": [
          "Filemon",
          "tt98"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236820": {
      "poster": "[deleted]",
      "content": "diste neradnici.\n\nDnevni podsjetnik da ako ne zavrsis faks u <5 godina si podkapacitiran",
      "votes": {
        "upvoters": [
          "Wayk"
        ],
        "downvoters": [
          "Filemon"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236821": {
      "poster": "Svudec",
      "content": "@login#236809 Nesporazum haha Mislio sam da se odnosi na diplomski studij.",
      "votes": {
        "upvoters": [
          "login"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237548": {
      "poster": "bc52556 (Rip)",
      "content": "Imam zajebanu situaciju, nadam se da mi ju netko moze razjasniti i sto me ceka u buducnosti.\n\nSada upisujem 3. godinu, a ostala su mi 3 predmeta s 3. semestra (ukupno 16 ectsa). Poslao sam legit (nadam se opravdanu) molbu studentskoj sluzbi za upis 46 ectsa u 5. semestru, ali naravno da postoji velika mogucnost da ce ju odbiti. Stoga, moram si pametno poslozit situaciju u slucaju da odbiju i to stavit u upise\n\n1) nemam pojma sto mi je i kakvu strukturu predmeta najbolje upisati. Trenutni plan je u zimskom upisati uz ove predmete s 2. godine, Programsko inzenjerstvo, Projekt R, Upravljanje znanjem i Prevodenje programskih jezika (njega razmisljam izbacit i ostavit za produzenu godinu + 2 izborna predmeta ostavit). Koliko je to pametan/glup plan i kakve su posljedice? \n\n2) Koliko sam shvatio, Zavrsni rad ulazi u strukturu ljetnog semestra (u kojem bi sve redovno upisao jer sam tu sve polozio). Medutim, on meni uporno nudi u zimskom semestru da moram obavezno stavit zavrsni rad kao zamjenski predmet, sto mi je potpuno besmisleno.\n\n3) Apsolutno mi nista nije jasna prica oko studentskih prava, placanja full skolarine itd. itd. Dakle jebote led, zasto ja ne mogu upisati ko normalan covjek ostatak predmeta sto mi je ostalo s 3. godine (a to bi mi bio PRVI UPIS njih) u produzenoj godini?\n\nUnaprijed hvala!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237549": {
      "poster": "[deleted]",
      "content": "@bc52556#237548 Plaćaš sigurno, u svakom slučaju 16*140 = 2240kn. \n\nOstvario se (vjerojatno) više od 1 ECTS u prošloj godini pa ostvaruješ pravo na rad preko SC-a.\n\nAko si ostvario više od 18 ECTS u prošloj, i 36 ECTS u prošle dvije godine, ostvaruješ pravo na subvenciju prehrane, dakle menzu.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237564": {
      "poster": "bc52556 (Rip)",
      "content": "Da, mozda sam trebao naglasiti da mi je ocekivano da to moram platiti... Bitno mi je samo da ne moram platiti 8400.\n\nHvala na odgovoru!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237575": {
      "poster": "Kobe",
      "content": "@bc52556#237548 ja sam prosle godine bio u sličnom problemu samo sta je meni ostalo još 3 predmeta iz 4. Semestra 😂. Prihvatili su mi molbe za upis više od 40 ects-a u 5. I ponovno u 6. semestru, ako napišeš motivirajuce molbe hah ne vidim zašto ne bi tebi isto prihvatili i vjerujem da ćeš to uspjeti riješiti. Sretno!",
      "votes": {
        "upvoters": [
          "bc52556 (Rip)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237616": {
      "poster": "bc52556 (Rip)",
      "content": "@Kobe#237575 Pa to je vrlo ohrabrujuce, hvala! 😁",
      "votes": {
        "upvoters": [
          "Kobe",
          "Kuhar"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "252492": {
      "poster": "MJ3",
      "content": "jel netko uspio prebacit diplomski rad na zimski semestar zbog više od 10 nepoloženih ects-a iz zimskog semestra (ali uz polaganje na ljetnom/jesenskom/dekanskom roku)? Ili se obavezno diplomski rad upiše jer se studij može završiti u toj ak.god.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "252505": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"MJ3\"#p252492 Ako položiš na zimskom ti se upiše, ako ti ostane za ljetni/jesenski ti se automatski prebaci u sljedeći semestar, jer se gleda u trenutku upisivanja jel ga možeš upisat, ne na kraju.",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277835": {
      "poster": "maverick",
      "content": "Probavam već treći put čitat ovaj thread i shvatiti kako produljiti taj diplomski za godinu dana, ali svatko govori nešto drugo i sve je toliko raštrkano da uopće nema smisla dalje čitati.\n\nMože li netko tko je siguran u svoj postupak podijeliti na jednom mjestu što je točno potrebno da se produži diplomski za godinu dana i da se pritom plaća najmanje što je moguće? Samo da se napokon ima na jednom mjestu - ovo trebaš upisat, ovo ne i to je to. Ovo kad je sve na 305 poruka i odgovora nije baš dobro za moje mentalno zdravlje, a valjda ni još nekih koji žele napraviti to :')",
      "votes": {
        "upvoters": [
          "1vq",
          "AK10 (endyyyy)",
          "BigBoi",
          "Kiflica",
          "Lusy (MGJ)",
          "Trava",
          "Urmum (mamaRu)",
          "Viks",
          "kix7 (Fish99)",
          "mesojed (sofronijevicevPrst)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277836": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"maverick\"#p277835 Mislim da više ne možeš bez straight up ne upisivanja diplomskog, a za FER2 još uvijek vrijedi 2. post.\n\nEDIT: Zapravo, možeš forsati da ti se ne upiše da skupiš 2+ nepoložena predmeta i da do sljedećeg ljetnog semestra položiš sve ili maks 1 do 10 ECTS-a ostaviš. Ali ne znam jel to potrebno jer mislim da sad, za razliku od prije, možeš jednostavno ne upisati diplomski. Ako ne, najlakše je samo ne upisati/pasti 2 transverzalna, to je 4-5 ECTS-a i neće se naplaćivati.",
      "votes": {
        "upvoters": [
          "maverick"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277912": {
      "poster": "Filemon",
      "content": "@\"maverick\"#p277835 ne ne govori svatko nešto drugo. Nego kako to napravit ovisi o FER2/FER3, kao i kada to odlučiš/što je već položeno.\n\nda je to moguće napravit na jedinstven način za sve situacije, ne bi bilo 300 postova. pa skrolaj polagano, ljudi su do ovog došli čitanjem pravilnika i informacijskog paketa ectsa, ovo je svakako brže od tog.\n\ni praktički na početku threada je nešto što pokriva najveći mogući broj slučajeva",
      "votes": {
        "upvoters": [
          "General_Kenobi (Aborteur)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277970": {
      "poster": "maverick",
      "content": "Može netko pametniji i iskusniji od mene utvrditi kakav je plan te je li istina navedeno?\n\nPrebacio sam se na dipl. s E na R smjer pa imam 2 dodatna predmeta za položiti.\n\nPlan mi je \n- 1. semestar skupiti 29 ECTS-a, 2. semestar skupiti 26 ECTS-a = godina 55 ECTS-a\n- 3. semestar ne upisati Projekt i izborni (ili 2 izborna), ali položiti 30 ECTS-a zbog nadoknade pada predmeta u 1. semestru, a 4. semestar otići na Erasmus i tamo položiti 25 ECTS-a = godina 55 ECTS-a\n- 5. semestar odraditi Projekt i izborni (ili 2 izborna), 6. semestar odraditi Diplomski rad = godina 38-40 ECTS-a\n\nZanima me je li takav plan izvediv te hoću li morati plaćati ovu razliku od 20-22 ECTS-a ili nešto drugo?",
      "votes": {
        "upvoters": [
          "kix7 (Fish99)"
        ],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}