{
  "title": "[NATPRO] Prijave - 2020/2021",
  "creator": "PeroPerica",
  "slug": "natpro-prijave-20202021",
  "tags": [
    "FER",
    "Natjecateljsko programiranje",
    "Organizacija"
  ],
  "posts": {
    "57707": {
      "poster": "PeroPerica",
      "content": "Prijave za NatPro otvorene su na linku: \n\nhttps://bit.ly/natpro2020\n\nAko imate pitanja, možete ih postaviti i u ovaj thread.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "Quentin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "57993": {
      "poster": "Rene",
      "content": "Može netko napisat dojmove s vještine? Korisnost, zanimljivost, koliko vremena oduzme i bilo šta korisno za znati?",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "Juren",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58886": {
      "poster": "Juren",
      "content": "@Rene#57993 Ja sam bio prije 2 godine i preporucio bih :) Sto se tice korisnosti nije da ces kasnije poloziti neki kolegij iskljucivo sa znanjima koje tu skupis, ali mnogi kolegiji ti budu jasniji ili ce ti biti lakse nakodirat labose, da ne pricamo o intervjuima kod top tier firmi gdje ti ovo moze biti krucijalno...  Sto se tice zanimljivosti to ovisi iskljucivo o tvojim interesima :D. Meni su predavanja bila zanimljiva i ok odradena. Tada je bio princip da studenti koji se bave natjecateljskim programiranjem drze predavanja. Svaki tjedan imas jednu zadacu i bi se u pravilo moglo rjesiti isti dan. Bilo je nekih tezih zadaca kad sam izgubio i po dva cijela dana, ali sve u svemu isplati se bar upisat :)",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "InCogNiTo124",
          "MiqeloS",
          "Quentin",
          "Rene",
          "haworthia (bulrog)",
          "indythedog"
        ],
        "downvoters": [
          "JoKing"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59766": {
      "poster": "Dell",
      "content": "Koliko teško je ovo za posložiti ako do sada nismo imali nikakav doticaj s competitive programmingom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60045": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Dell#59766 Nije teško pokopčati jer se ne radi o puno informacija iza visoke apstrakciji. Ono što je znanje ovdje je pristup problem (a ne hrpa teorije) koji je za razliku od pristupa prosječnog FERovca već desetljećima razrađivan i u principu usavršen. Kako bi rekao moj prof informatike iz srednje: postoji razlika između kompleksnosti i kompliciranosti. Veći problem će ti IMO biti naviknuti se na (skoro) tjedne zadaće ako npr. nemaš disciplinu za tak nešto.",
      "votes": {
        "upvoters": [
          "Dell"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60047": {
      "poster": "PeroPerica",
      "content": "@Dell#59766 Ja nisam imao (skoro) nikakav doticaj s comp-progom kad sam prije 3 godine ovo upisivao, i nisam imao uopće ikakvih problema. Vještina je namijenjena ljudima koji su ili totalno neupoznati, ili znaju relativno malo. \n\n> @micho#60045 na (skoro) tjedne zadaće\n\nSamo da još jednom napomenem, ove godine nećemo imati obavezne zadaće, bit će na dobrovoljnoj bazi. Naravno, položiti predmet na ispitu bez relativno redovitog rješavanja zadaća bit će jako teško (ne zbog valorizacije, već znanja).",
      "votes": {
        "upvoters": [
          "Dell",
          "InCogNiTo124",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60049": {
      "poster": "PeroPerica",
      "content": "@PeroPerica#60047 Ne mogu vise editat, pa evo odgovora:\n\n@Dell#59766 \n\nAko zelis procijenit tezinu, pogledaj ovo:\n\nhttps://codeforces.com/edu/course/2/lesson/4/1",
      "votes": {
        "upvoters": [
          "Dell"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60051": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @PeroPerica#60047 Samo da još jednom napomenem, ove godine nećemo imati obavezne zadaće, bit će na dobrovoljnoj bazi.\n\nHmmmm, vjerojatno bi bila dobra ideja ostaviti jedan zadatak za neku osnovnu primjenu gradiva kao obavezan, nezz baš koliko smisla predmet ima bez tih zadaća. I to kažem kao netko tko je dropoutao radi nemogućnosti alociranja vremena za bolju kvalitetu Pythona, obično korištenje C++-a ili primjenu Rusta. Jer da je tako bilo prošle godine, čak i da sam prošao predmet overfittanjem na gradivo, to bi vjerojatno bilo jako loše znanje i bastardizacija predmeta koji radi dobro sve što Čupićeva Java radi krivo.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60052": {
      "poster": "PeroPerica",
      "content": "@micho#60051 Imamo ideju stavit nekakve checkpointe (1-2) kroz semestar, koji su otvoreni neko vrijeme i moraju se rijesit donekle.\n\nProblem sa zadaćama je to što X.FER nema ni približno dovoljno ljudi da napravi potpuno nove, nikad vidjene zadatke. Nemoguce je pregledavat plagijate kod vec gotovih zadataka, jer zelimo da ljudi suradjuju dok uce, koriste internetske izvore, itd, a onda mi je glupo forsirat ljude da stalno to rade, kad znam da ce neki samo copy pasteat tudji kod i uredit ga dovoljno da ne padne na plagijatima.\n\nValjd ferovci imaju dovoljno samokontrole da redovito uce, a ovim checkpointima cemo im omogucit provjeru toga.\n\nEDIT: Zavrsni ispit cemo sastavit od potpuno novih stvari, znaci takvih zadataka nece bit nigdje, i tu pada u vodu to overfittanje. Ali naravno, ideje koje se koriste bit će one koje smo ispredavali i dali da sami isprobate u opcionalnim zadacama.",
      "votes": {
        "upvoters": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60054": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@PeroPerica#60052 Fair enough, to bi moglo biti okej",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "PeroPerica"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60463": {
      "poster": "AK10 (endyyyy)",
      "content": "Može netko malo napisati o prijemnom? Je li težak, kako uopce izgleda itd?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60504": {
      "poster": "PeroPerica",
      "content": "@AK10#60463 Bude nekoliko zadataka i nekoliko dana za rijesit ih. Nisu teski, s gradivom prve god bi ih trebao moc rijesit. U pravilu ga gotovo svi prodju.",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60505": {
      "poster": "Dell",
      "content": "Još jedno pitanje, može li se položiti vještina kompletno koristeći Javu ili je potrebno koristi C++?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "60508": {
      "poster": "PeroPerica",
      "content": "@Dell#60505 Moze! Inace je sporija, ali nastojimo prilagodit da ocekivano rjesenje prolazi u oba jezika.",
      "votes": {
        "upvoters": [
          "Dell",
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73615": {
      "poster": "PeroPerica",
      "content": "Bump! Prijava se zatvara u srijedu, 30. rujna u 18:00.\n\nObrazac je dostupan na sljedećoj adresi: https://bit.ly/natpro2020. Više informacija o predmetu dostupno je u prijavnom obrascu.\n\nAko ste se prijavili već nakon prve obavijesti, prijavu ne morate ponavljati. Prijave na vještinu u FER-ovom sustavu upisa predmeta zanemarujemo.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}