{
  "title": "[ELEENEA] Ljetni rok - 2019/2020",
  "creator": "Klembuksna",
  "slug": "eleenea-ljetni-rok-20192020",
  "tags": [
    "FER",
    "Elektroenergetika",
    "Ispiti"
  ],
  "posts": {
    "58415": {
      "poster": "Klembuksna",
      "content": "Pozdrav ekipa, evo pitanja s ljetnog roka možda se ponovi nešto i na jesenskom \n\n1. Nacrtati u p-v dijagramu izotermnu i izentropsku kompresiju iz iste početne točke. Nacrtati u T-s dijagramu procese izobarnog i izohornog odvođenja topline iz iste početne točke. Za koju su promjenu stanja idealnog plina mehanički rad promjene volumena i tehnički rad jednaki? Za koju je promjenu stanja idealnog plina tehnički rad jednak nuli?\n\n2. Je li promjena entropije radnog medija veća u Jouleovom ili Carnotovom procesu? Navesti dva postupka povećamka term. stupnja djelovanja u TE s plinskom turbinom te 2 postupka povećanja u TE s parnom turbinom. Nacrtati h,s dijagram Rankinovog procesa za TE s međupregrijanjem pare. \n\n3. Koje je porijeklo geoterm. energije? Na koji se način postiže separacija tekuće i parne faze u elektrani sa separiranjem pare? Nacrtati T,s dijagram elektrane s binarnim ciklusom. Kako funkcionira toplinska pumpa?\n\n4. Nacrtati ovisnost energije veze po nukleonu o broju nukleona. Koja je funkcija kontrolnih šipki, a koja moderatora u nuklear. reaktoru? U kojem je agregatnom stanju fluid na primarnoj strani parogeneratora, a u kojem na sekund. strani parogen PWR elektrane? Koje je porijeklo ostatne topline u nukl.reaktoru? \n\n5. Nacrtati karakteristiku snage fotonap. ćelije za nazivno i za 2 puta manje ozračenje. Nabrojiti vrste solarnih TE i poredati ih prema porastu njihove efikasnosti. Koja se komponenta sunč. zračenja koristi u solarnoj TE, a koja u FN elektrani? Nacrtati nadomjesnu shemu FN ćelije. \n\n6. Nacrtati vrem. ovisnost snage na radnom i kapac. trošilu i navesti koje su frekvencije snaga ako je frekv. napona i struje u oba slučaja 50Hz? U čemu se sve razlikuju prijenos i distribucija el. energije i kada koristimo istosmjerni prijenos? Što je vozni red elektrana i koje se elektrane koriste za pokrivanje vršnog opterećenja u njemu? Koja je osnovna razlika između zateznog i nosivog stupa dalekovoda? Koja je razlika između prekidača i rastavljača?\n\n7. U istom dijagramu nacrtajte konsumpc. krivulje za ravničarsku i planinsku rijeku. Kako dijelimo HE prema načinu korištenja vode, a kako prema visinskoj razlici? Koje su karakteristike Peltonove turbine, kako joj se regulira snaga i kako joj se mijenja tlak u rotorskom kolu? U koju grupu turbina ovisno o smjeru strujanja vode spada Kaplanova turbina? Da li je vjerojatnost nastanka kavitacije veća u ulaznom ili izlaznom dijelu turbine?\n\n8. Nacrtati promjenu tlaka i brzine za strujnu cijev koja opisuje rad VA. Koji su načini regulacije snage VA i na kojem se aerodinam. efektu temelje? Koji konstruktivni element spaja brzohodnu i sporohodnu osovinu VA i pretvorbu koje energije vrši? Što znači kada kažemo da je VA indirektno spojen na mrežu i koje su prednosti koje takav način spajanja pruža?\n\n9. Kako je definirana efikasnost gorivnog članka i kako mu izgleda UI karakteristika? Što su to neposredne energ. pretvorbe i koja je od njih trenutno najviše korištena za proizvodnju el. energije? Što su to primarne pretvorbe biomase? Navesti termičke pretvorbe poredane u smislu pada potrebne količine kisika. Navesti načine proizvodnje vodika. Da li vodik kao gorivo ima veću masenu ili volumnu gustoću energije?\n\n10. Navesti bar 2 razloga za spremanje el. energije u EE sustavu i navesti koji razlog spremanja ima najveću frekvenciju korištenja? Koji su spremnici mehan. energije i koji im je redoslijed kada ih poredamo prema efikasnosti spremanja? Opišite ciklus SMES spremnika energije, napišite izraz za spremljenu energiju i navedite što je samopražnjenje za taj tip spremnika. Što je primarni, a što sekundarni efluenti odgovorni za onečišćenje zraka i koji uzrokuju kisele kiše u okolini TE?",
      "votes": {
        "upvoters": [
          "Bisenberg (DonaldPump)",
          "DukeFiction",
          "EstebanVihaio",
          "GranAutismo",
          "Kuhar",
          "PikachuOnAcid (Kaneki kun)",
          "Upforpslone",
          "aCroEn",
          "jocelyn",
          "mimara",
          "netflix (seximan)",
          "pcharlie"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}