{
  "title": "[ONF] O predmetu",
  "creator": "Stark",
  "slug": "onf-o-predmetu",
  "tags": [
    "FER",
    "Osnove nuklearne fizike"
  ],
  "posts": {
    "64865": {
      "poster": "Stark",
      "content": "Jesu li ovo u nastavnim aktivnostima pod 2. ispitni rok bodovi iz pismenog ili preneseni bodovi iz seminara?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149466": {
      "poster": "Red_Baron",
      "content": "Kako se ove godine izvode predavanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "149487": {
      "poster": "mentally_disturbed_llama",
      "content": "@Red_Baron#149466 Preko Teamsa, neće biti snimana.",
      "votes": {
        "upvoters": [
          "Red_Baron"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "198879": {
      "poster": "Mare",
      "content": "Ima li netko uploadana video predavanja Nuklearna struktura i Nuklearna struktura?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277489": {
      "poster": "ljama_glama",
      "content": "Kako izgledaju ispiti iz ovog predmeta? Ima li dovoljno materijala za nauciti? Jel jos uvijek Sanda Pleslic glavna? Nalikuje li struktura ispita upravljanju znanjem? \n\nBiste li preporucili predmet (kao jedan od laksih)?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277507": {
      "poster": "Jale (čakijale)",
      "content": "@\"Spike433\"#p277505 Je li to da se mijenja nositelj na ONF provjerena informacija?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277510": {
      "poster": "Jura (Spike433)",
      "content": "@\"Jale\"#p277507 \n\njedan lik s discorda nas je upozorio da ima profesora sa zpf-a kao izvor, cak i da je 50% meni je to dovoljno makar tvrdi da je 100%",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277530": {
      "poster": "EstebanVihaio",
      "content": "@\"Jale\"#p277507 prošle godine je predavanja vodio Mario Matijević, profesorica nije imala nikakve veze s ispitima, samo sa seminarima (ako se dobro sjećam, ali mislim da je bilo tako). Mislim da je predmet malo teži nego kad je profesorica bila glavna, ali svejedno je ok predmet koji se lako položi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277531": {
      "poster": "EstebanVihaio",
      "content": "@\"ljama_glama\"#p277489 Ima dovoljno materijala, prošle godine su se auditorne stalno radile u sklopu predavanja, znači zadatci se prožimaju kroz predavanje da se malo bolje shvati slika procesa. Kao što rekoh, mislim da je predmet malo teži sada, ali ništa previše zahtjevno. Upiši predmet, zanimljivo gradivo se obrađuje, a uživo bi izvedba svakako trebala biti bolja nego preko Teamsa.",
      "votes": {
        "upvoters": [
          "ljama_glama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277608": {
      "poster": "ljama_glama",
      "content": "@\"EstebanVihaio\"#p277531 kakvi tipovi zadataka dolaze na ispitima? Jel ima na zaokruzivanje, negativnih? Koji je omjer tipova zadataka?\n\nJel treba dolazit na predavanja ili su dovoljne tipa samo auditorne?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277621": {
      "poster": "EstebanVihaio",
      "content": "@\"ljama_glama\"#p277608 tipičan ispit iz fizike, pitalice točno/netočno bez negativnih bodova, malo teorije (5 bodova je to nosilo, ako se ne varam) općenito oko nekih definicija i objašnjavanja npr. šta koji član u formuli energije vezanja predstavlja, izvesti izraz za Comptonovo raspršenje i slično + zadatci koji su varijacija onih što su na predavanjima odrađeni. \n\nJa mislim da trebaš dolaziti na predavanja jer prošle godine nije bilo određenog termina za auditorne, nekad bi ih profesor najavio, ali većinom se zadatci odrađuju uz predavanja. Naravno, uvijek ti ostaje opcija samostalno rješavati zadatke, što samo po sebi nije loše, ali meni je, osobno, trebalo objašnjenje iza pojedinih izračuna.",
      "votes": {
        "upvoters": [
          "ljama_glama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277735": {
      "poster": "Passcala",
      "content": "@\"ljama_glama\"#p277608 Profesorica više neće biti na predmetu, netko drugi ga preuzima. Zadnje 4 godine je ispite i seminare držala ona, a kako će predmet i ispiti izgledati ove godine nemam pojma(vjerojatno će biti teže).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "anon00",
          "ljama_glama"
        ]
      }
    },
    "292111": {
      "poster": "anon00",
      "content": "Pojam nemam sto se radi na predmetu i ne stignem ga spremiti za meduispit pa me zanima kakav je na roku? \n\nIli je pak moguce skupiti nesto bodova uz minimalnu pripremu?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306865": {
      "poster": "ppooww (pp)",
      "content": "Ako nekog zanima upis nakon promjene nositelja\n>!![](assets/2022-06-30/00006.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Jale (čakijale)"
        ]
      }
    },
    "306870": {
      "poster": "anon00",
      "content": "@\"pp\"#p306865 Zanima me sto se toliko promijenilo u odnosu na Plesic? \n\nGledajuci stare ispite, nisu nista posebno lakse, a na predavanja vjerujem da ni kod nje nitko nije dolazio \n\nA samo gradivo se nije mijenjalo \n\nSto je razlicito?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306871": {
      "poster": "ppooww (pp)",
      "content": "@\"anon00\"#p306870 Meni se stari ispiti cine laksi jer se ponavljaju zadaci i uvijek bude nekoliko zadataka copy&paste iz skripte. Za razliku od toga, sad na zavrsnom iz drugog ciklusa nije dosao niti jedan zadatak iz skripte. Takoder, dosli su zadaci iz prvog ciklusa sto nisam ocekivao, ali mozda nisam slusao dovoljno.\n\nPredmet nije postao tezi niti se ista znacajno promijenilo u tom smislu. Koga ovo zanima i ko ce ic na predavanja nece imat problema s prolazom. Ali bi rekao da vise nije \"free\" prolaz predmet. Doduse nije ni da je nesto pretjerano tezak za proc.",
      "votes": {
        "upvoters": [
          "anon00"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}