{
  "title": "Subvencionirani prijevoz HŽ-om",
  "creator": "Articoka",
  "slug": "subvencionirani-prijevoz-hz-om",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "73343": {
      "poster": "Articoka",
      "content": "Znam da Splitsko-dalmatinska županija pruža mogućnost besplatnog prijevoza HŽ-om za sve studente koji studiraju izvan mjesta prebivališta, ali nisam bio u stanju pronaći konkretnije informacije po tom pitanju. Je li itko zna kada se ti natječaji obično raspisuju i trebam li se vratit nazad u Split da ostvarim pravo na tu subvenciju ili je to sve moguće odraditi iz Zagreba? Što sve uopće treba napraviti da se dobije ta subvencija?",
      "votes": {
        "upvoters": [
          "Articoka"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73344": {
      "poster": "[deleted]",
      "content": "@Articoka#73343 mozes sve u zg na kolodvoru ako ove godine bude. Doneses 50kn, sliku i potvrdu o statusu studenta. Iskaznicu pokupis isti ili sljedeci dan, ovisno ima li guzve",
      "votes": {
        "upvoters": [
          "Articoka",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73345": {
      "poster": "Articoka",
      "content": "@Psychosis#73344 Masu fala, brz si bome hahaha. Samo znaš li još kad obično se može ić po to?\n\nEdit: u smislu kojeg datuma obično objave natječaj",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73346": {
      "poster": "[deleted]",
      "content": "@Articoka#73345 to ne bih znao\n\nAko bude subvencije moci ces bilo kad, nema neki rok. Ja sam jedne godine izvadio tek u 12. mjesecu. Nema neki poseban natjecaj, svi redoviti studenti imaju to pravo",
      "votes": {
        "upvoters": [
          "Articoka",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73347": {
      "poster": "Articoka",
      "content": "@Psychosis#73346 Ništa, puno hvala u svakom slučaju onda.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73349": {
      "poster": "GTX9800",
      "content": "Ovo? http://www.hzpp.hr/prijevoz-studenata-sdz-a?p=275\n\n>Kako bi ostvarili pravo na besplatan prijevoz, studenti trebaju popuniti zahtjev za izradu pametne kartice na koju će im biti dodijeljen profil studenta SDŽ-a, uz predočenje identifikacijskog dokumenta iz kojeg je vidljivo prebivalište na području SDŽ-a i potvrde SDŽ-a o statusu redovnog studenta. Cijena izrade studentskog profila iznosi 50 kn.\n>\n> Studenti koji posjeduju pametnu karticu i koji nemaju dodijeljen profil trebaju popuniti zahtjev za izradu pametne kartice, uz predočenje identifikacijskog dokumenta iz kojeg je vidljivo prebivalište na području SDŽ-a i potvrde SDŽ-a o statusu redovnog studenta.\n>\n >Studenti koji posjeduju pametnu karticu i imaju dodijeljen profil studenta SDŽ-a, koji vrijedi godinu dana od dana ispostavljanja, trebaju predočiti identifikacijski dokumenti iz kojeg je vidljivo prebivalište na području SDŽ-a i potvrdu SDŽ-a o statusu redovnog studenta.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73357": {
      "poster": "Red_Baron",
      "content": "@Psychosis#73346 Okej, ovo je krivo. Ono što doktor Dabić kaže nije subvencija već HŽ-ov popust za studente. Ako si student, platiš 50 kuna godišnje tu karticu i imaš 50% popusta na sve jednosmjerne karte HŽ-a u Hrvatskoj.\n\nP.S. @Articoka, doktor Dabić je lažni lekar - on je zapravo Radovan Karadžić!\n\nSubvencija znači - kupim mjesečnu kartu koju mi jednim dijelom subvencionira grad ili županija.\n\n@Articoka#73343 u pogledu subvencije za Splitsko-dalmatinsku županiju ne znam točno. Za Sisačko-moslavačku je nekoć trebalo predati zahtjeve za subvenciju i sve potvrde početkom 9. mjeseca (kako to sad funkcionira, nemam pojma).",
      "votes": {
        "upvoters": [
          "Fica (Prof)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Articoka",
          "Filemon",
          "InCogNiTo124",
          "Stark"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "73358": {
      "poster": "[deleted]",
      "content": "@Red_Baron#73357 nije to to. SDŽ studenti imaju poseban status. To nisu mjesecni pokazi nego jednosmjerne karte.\n\n 50% karte placa HŽ, 50% SDŽ\n\n HŽ i SDŽ imaju poseban neki deal van standardnog studentskog popusta.\n\n U svakom slucaju najsigurnije je to izraditi sto prije",
      "votes": {
        "upvoters": [
          "Articoka",
          "Filemon",
          "Red_Baron",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73366": {
      "poster": "Red_Baron",
      "content": "@Psychosis#73358 U tom slučaju - moje isprike na dezinformaciji :)",
      "votes": {
        "upvoters": [
          "Articoka",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "73370": {
      "poster": "Articoka",
      "content": "> @Red_Baron#73357 P.S. [@Articoka](https://fer.studosi.net/u/Articoka), doktor Dabić je lažni lekar - on je zapravo Radovan Karadžić!\n\nOh ne, bio sam prevaren, kako je ovo moguće.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "xpn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124",
          "Red_Baron",
          "__builtin_popcount (std::popcount)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "73445": {
      "poster": "Filemon",
      "content": "@Psychosis#73358 tako je. Isto vrijedi za studente PGŽ koji studiraju van mjesta prebivališta.",
      "votes": {
        "upvoters": [
          "Articoka"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75999": {
      "poster": "Bobinator",
      "content": "nisam siguran jel ista stvar, ali rekao bi da je, BBŽ ima isto besplatne sad vec neke dvije godine ako se ne varam. prvi put sam morao napravit iskaznicu kako je vec netko rekao, a onda kad idem kupovat kartu samo dam osobnu i tu iskaznicu. par puta sam kupovao samo sa iskaznicom i morao placat, a kad dam osobnu mi prepise podatke na neki papir i da besplatno. subvenciju uplati zupanija i besplatno je dok god je ima, pa ako bas uletis kad se potrosila a nisu opet uplatili, onda ces morat platit kartu. i kod nas vrijedi i za jednosmjerne i povratne\n\nal opet kazem, nisam siguran koliko je to isto, samo djelim svoje iskustvo iz BBŽ",
      "votes": {
        "upvoters": [
          "Articoka",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "__builtin_popcount (std::popcount)",
          "miss_anthropocene (neunist.iva)"
        ],
        "tuga": []
      }
    },
    "77373": {
      "poster": "Red_Baron",
      "content": "Evo ga, stigla je informacija više - baš za SDŽ: https://www.ferata.hr/prijevoz-redovitih-studenata-u-sdz-vlakom/",
      "votes": {
        "upvoters": [
          "Articoka"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "77376": {
      "poster": "Articoka",
      "content": "@Red_Baron#77373 Vidjeh već ali fala. Jedino ne znam šta misle s tom potvrdom SDŽ o studiranju, nisan nigdje vidia šta treba poslat u upitu na mail da ti pošalju tu potvrdu.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}