{
  "title": "[LABPRO1-PIIIS] O predmetu",
  "creator": "gunaman",
  "slug": "labpro1-piiis-o-predmetu",
  "tags": [
    "FER",
    "Laboratoriji profila"
  ],
  "posts": {
    "75099": {
      "poster": "gunaman",
      "content": "Evo nova tema s obzirom da niti jedna jos ne postoji.. Koja je baza s ovim? Sutra ujutro u osam je online predavanje, a nigdje nema obavijesti, key-a za MS teams, niti bilo cega slicnog.. Da se razumijemo i  sa vecinom ostalih predmeta je isto, ali oni nisu sutra u 8...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75102": {
      "poster": "Dell",
      "content": "Fiktivni datumi u kalendaru, ne postoje predavanja iz tog predmeta.",
      "votes": {
        "upvoters": [
          "Bobicki"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75152": {
      "poster": "Zarko",
      "content": "Postoji obavijest na stranici predmeta:\n\n_Nema (uvodnog) predavanja iz LERI1\n\nPoštovane studentice i studenti,\n\nuvodno predavanje iz LERI1 u ponedjeljak 30.9. od 8 do 10 sati NEĆE se održati.\n\nTermin ponedjeljkom od 8 do 10 sati koristit će se samo kada to bude najavljeno u obavijestima na ovoj stranici._",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75256": {
      "poster": "-Ivan- (Ivančica)",
      "content": "@Zarko#75152 Ja nez di si ti našao tu obavijest, ali ponedjeljak je 28.9. To je vjv neka od prijašnjih godina?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75259": {
      "poster": "-Ivan- (Ivančica)",
      "content": "@-Ivan-#75256 UPDATE: Našao obavijest o kojoj kolega priča (i je od ove godine iako je krivi ponedjeljak), to je za labos električnog inženjerstva, a pitanje je bilo za labos programskog inženjerstva, al kak kolega Dell kaže da nema predavanja iz predmeta nije ni bitno valjd.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75457": {
      "poster": "Bobicki",
      "content": "https://fer.studosi.net/d/1114-rac-predmeti-1-godine-diplomskog-studija/149",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78026": {
      "poster": "Just_some_name",
      "content": "moze netko malo bolje objasniti ovaj predmet? \n\nZnaci iz njega se treba dobiti minimalno 50 bodova za prolaz tako da ih se skuplja kroz druge predmete. Dal su nam ti predmeti određeni ili svi koji daju bodove za laboratorij profila su validni za bodove? \n\nTipa ako smo na smjeru PIIS i nemamo napredne baze, a upisali smo objektno oblikovanje. Dal onda bodovi koji se mogu dobit kroz objektno oblikovanje mogu uzet za laboratorij profila?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78032": {
      "poster": "Bobicki",
      "content": "@Just_some_name#78026 Ako je sve ostalo isto kao i prošle godine, za labos profila gledaju se 3 od 5 predmeta koja si odabrao u kategoriji \"teorijski predmeti profila\", i svaki predmet nosi 33 boda za labos profila. Svaki predmet ima bodovanje labosa profila na svoj način koji je najčešće objašnjen na uvodnoj prezentaciji. Kod nekih predmeta je to zasebni zadatak, kod nekih se samo skaliraju bodovi iz labosa, itd. Za sam prolaz, bitno je skupiti samo 50 bodova ukupno, tako da ako su i dalje 3 predmeta po 33 boda, dovoljno je odraditi samo dva labosa profila da bi skupio 50 bodova, odnosno nije nužno odraditi sve labose profila.",
      "votes": {
        "upvoters": [
          "Just_some_name",
          "pepelko"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "104251": {
      "poster": "pepelko",
      "content": "@Bobicki#78032 Znaci ako mi u Labos profila ulaze strojno, raspodijeljeni sustavi i nasp, i ako iz NASP-a ne odradim 1 labos (i to bas ovaj koji trebam obraniti), ocu li proc labos profila ako iz strojnog i raspa uspijem nekako skupit sveukupno > 50? \n\n*Obavijest iz NASP-a: \"vježba koja se fizički prezentira se mora riješiti, ostale su opcionalne (uz pažnju na uvjete polaganja)\"",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "104289": {
      "poster": "Bobicki",
      "content": "@pepelko#104251 Za labos profila bitno je samo skupiti 50 bodova, tako da ga možeš položiti preko bodova iz samo 2 od 3 navedena predmeta. Ovo što nasp ima uvjet da se labos mora položiti vrijedi samo za nasp, tako da to nema utjecaja na prolaz iz labosa profila. Recimo moj slučaj od prošle godine, ja sam imao objektno, rassus i nasp kao tri predmeta koja su vrijedila za labos profila, i zadatak za labos profila iz objektnog sam totalno ignorirao i skupio 50 bodova preko rassusa i naspa.",
      "votes": {
        "upvoters": [
          "pepelko"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129686": {
      "poster": "Murin",
      "content": "Koji je postupak, tj. koje su posljedice ako se ne prođe laboratorij profila?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276816": {
      "poster": "Jakic007",
      "content": "@\"Murin\"#p129686 Dobro bi doso neki info oko ovoga :)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276825": {
      "poster": "Murin",
      "content": "@\"Jakic007\"#p276816 \n\nU mom slucaju je islo tako da sam se dogovorio s nositeljem predmeta da se upise dovoljan broj bodova za prolaz lab profila",
      "votes": {
        "upvoters": [
          "Jakic007"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276922": {
      "poster": "sekiro",
      "content": "Di mogu nac ovaj predmet i vidjet koji mi predmeti ulaze u njega?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276935": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"sekiro\"#p276922 Ti si FER3, nemaš taj predmet",
      "votes": {
        "upvoters": [
          "sekiro"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}