{
  "title": "Životopis",
  "creator": "Bobinator",
  "slug": "zivotopis",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "78049": {
      "poster": "Bobinator",
      "content": "Pozdrav! \n\nPred kraj semestra se planiram zaposliti u struci, a na forumu(i ovom i proslom) sam vidio dosta razlicitih misljenja o tome kako napisati zivotopis. Stvarno je bilo puno razlika, od toga da se pise u nekoj gotovoj formi kako bi podatci bili laksi za usporedit sa drugim kandidatima, a sa druge strane dosta ljudi sprda takve zivotopise. Takoder, koje poslove staviti a koje ne? Npr u mom slucaju konkretno, radim u Microblinku vec dvije godine(sto dobro zvuci), ali na data annotationu(sto je zapravo posao koji bilo tko moze radit), pa me zanima jel to pametno stavit ili ne?\n\nPo objavama sam vidio da tu postoje i ljudi koji u tvrtkama sudjeluju u nekom dijelu zaposljavanja, ljudi koji su isli na predmet upravljanje karijerom i koji su pricali da su tamo naucili dosta stvari oko ovoga, pa mislim da bi bilo korisno da prvenstveno oni, ali i svi drugi kazu sto misle da je najbolje i da sve te informacije budu na jednom mjestu",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78050": {
      "poster": "PeroPerica",
      "content": "@Bobinator#78049 Gotovi template-ovi nisu meme (osim recimo europassa), preporucam https://github.com/x-fer/cv-template, a na ostalo ti ne znam odgovorit.",
      "votes": {
        "upvoters": [
          "Bobicki",
          "Bobinator",
          "InCogNiTo124",
          "NekocBraca",
          "Svarog (Veles)",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78058": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Bobinator#78049 Takoder, koje poslove staviti a koje ne? Npr u mom slucaju konkretno, radim u Microblinku vec dvije godine(sto dobro zvuci), ali na data annotationu(sto je zapravo posao koji bilo tko moze radit), pa me zanima jel to pametno stavit ili ne?\n\nStavljaš svugdje gdje smiješ reći da si radio\n\nTemplateovi nisu generalno mim, jer ipak treba imati malo pameti odabrati latex template i onda ga ispuniti. Europass je meme jer ne trebaš znati apsolutno ništa za njega, dizajn je odvratan a većina informacija redundantne. Ako ti na stranicu A4 možeš napisati najrelevantnije stvari što si radio u životu, to je to. Ako ne možeš, onda ovisi o tome koliko je onaj tko gleda tvoj CV skoncentriran ili pažljiv. Isto tako u novije vrijeme se navodno radi i CV optimizacija gdje se ubacuju ključne riječi koje abuseaju eliminacijske algoritme.",
      "votes": {
        "upvoters": [
          "Bobinator",
          "Hitchcock",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "78145": {
      "poster": "G-bear",
      "content": "Samo bih napomenuo da postoje razlike izmedju CV-a i resumea. \n\nResume je dugacak jednu stranicu, eventualno dvije i tu ujratko opises svoja iskustva koja su specificna za posao na koji se prijavljujes.\n\nCV je sve sto si postogao i svi tvoji skillovi, poput obrazovanja, prijasnjih poslova, achievementa, stipendija, skillova i slicno.\n\nResume se obicno salje firmama gdje se zelis zaposliti, CV je za akademske krugove, vize, europske projekte i slicno.\n\nRecimo, u CV stavis da imas vozacku dozvolu C kategorije i da mozes voziti sleper s prikolicom, dok je u resumeu to apsolutno nebitna informacija ako se ne prijavljujes za posao vozaca. U resume ces napisati da znas Javu ako se prijavljujes za poziciju Java developera, ali vjerojatno neces napisati da znas baratati Latexom.\n\nBarem je to moje shvacanje razlike izmedju CV-a i resumea.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Bobinator",
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "Jakic007",
          "Mioch",
          "SonGoku (~~~~~~~~)",
          "ViBorg",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "allophone",
          "amnael",
          "mAcaLukas (mAca Lukas)",
          "spampers (majmunska boginja)",
          "syntax_error"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}