{
  "title": "[RGKIK] Gradivo",
  "creator": "Jim",
  "slug": "rgkik-gradivo",
  "tags": [
    "FER",
    "Raspodijeljene glavne knjige i kriptovalute"
  ],
  "posts": {
    "93296": {
      "poster": "Jim",
      "content": "jel moze netko objasnit zasto bi isao raditi fork, tj. kakve tocno koristi imam od toga? hvala unaprijed",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93305": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Jim#93296 Na po캜etku kriptovalute je isplativo majnati jer je te쬴na rudarenja mala. I onda se na tom po캜etku stockpilea코 kriptovalutom, pa si bogat ako postane popularna i vrednija. Na po캜etku Bitcoina IIRC dobio si 5 bitcoina besplatno (izuzev 캜injenice da se poticala me캠usobna razmjena za bezveze), 코to ti je danas jedan dosta brzi auto :)\n\nA u smislu forkanja same kriptovalute, ponekad 캖e코 htjeti nova pravila u protokolu, isto tako Bitcoin nije nikako skalabilan (캜ini mi se da se na predavanju spominjala brojka od 250 GB koliko Bitcoin blockchain trenutno ima), pa donekle to mo쬰코 rije코iti forkom (iako time ima코 druge probleme, npr. to vi코e nisu iste kriptovalute)\n\nAko ipak misli코 na slu캜ajne forkove (dakle kad vi코e majnera u isto vrijeme prona캠u razli캜ite blokove), well, sjebano je to 코to 캖e onaj koji ima kra캖i lanac popu코iti, a onaj 캜iji lanac se prizna (onaj s najduljim xD) 캖e dosta profitirati. Ali koliko sam sku쬴o u praksi ne 쬰li코 ba코 ovo raditi jer usporava코 mre쬿 i stvara코 blokove siro캜ad. Dodu코e mislim da se tom usporenju doska캜e tako da se podesi te쬴na, ali ne bih znao tako u detalje stvari. Javim ti kad malo bolje nau캜im ovo xD",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "Jim",
          "vykar (mango)"
        ],
        "downvoters": [
          "madoxx"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93468": {
      "poster": "[deleted]",
      "content": "Pitanja iz Scroogecoina (iz knjige, to je na코a verzija nov캜i캖a koji koristi blockchain, BrankoCoin). Isto je pitanje postavio bio i kolega na kraju drugog predavanja, ali ga 캟erek nije razumio u potpunosti, a kolega nije dao dodatna poja코njenja. Uglavnom prvo je pitanje sljede캖e:\n1. Za코to se ne prebacuje coin ownership, nego se jednom stvoreni nov캜i캖 mo쬰 samo jednom potro코iti? Dakle u tom sustavu, a i u Bitcoinu ako se ne varam, owner nov캜i캖a je immutable. Zna li netko za코to? Kako bi potro코ili nov캜i캖, vlasnik nov캜i캖 mora potpisati transakciju kojom se nov캜i캖 tro코i, ali se onda mora stvoriti novi nov캜i캖 koji 캖e pripasti novom vlasniku.\n2. U knjizi pi코e da Scrooge mora potpisati svaki blok u kojem se nalaze transakcije. Zna li itko za코to? Zar ne treba potpisati samo blockchain na kraju?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93471": {
      "poster": "InCogNiTo124",
      "content": "> @tolecnal#93468 2. U knjizi pi코e da Scrooge mora potpisati svaki blok u kojem se nalaze transakcije. Zna li itko za코to? Zar ne treba potpisati samo blockchain na kraju?\n\nMislim da se sjecam da je na pocetku ScroogeCoin sekcije negdje eksplicitno navedeno da se u primjeru radi samo o pojedinacnin transakcijama, ili ekvivalentno blokovima sa samo jednom transakcijom.\n\n> @tolecnal#93468 1. Za코to se ne prebacuje coin ownership, nego se jednom stvoreni nov캜i캖 mo쬰 samo jednom potro코iti? Dakle u tom sustavu, a i u Bitcoinu ako se ne varam, owner nov캜i캖a je immutable. Zna li netko za코to? Kako bi potro코ili nov캜i캖, vlasnik nov캜i캖 mora potpisati transakciju kojom se nov캜i캖 tro코i, ali se onda mora stvoriti novi nov캜i캖 koji 캖e pripasti novom vlasniku\n\nOvo ne znam ali mi nesto vristi double spending ali ne znam reasonati zasto",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93481": {
      "poster": "[deleted]",
      "content": "> @InCogNiTo124#93471 Mislim da se sjecam da je na pocetku ScroogeCoin sekcije negdje eksplicitno navedeno da se u primjeru radi samo o pojedinacnin transakcijama, ili ekvivalentno blokovima sa samo jednom transakcijom.\n\nDa. To pi코e odmah na po캜etku, ali mi nije jasno za코to potpis onoga tko tro코i nov캜i캖 nije dovoljan. Ku쬴m da je stvaranje nov캜i캖a isklju캜ivo Scrooge akcija, ali ova druga, PayCoins nije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93482": {
      "poster": "[deleted]",
      "content": "@InCogNiTo124#93471 Zna코 li mo쬯a koja je razlika izme캠u hiding i puzzle friendliness propertyja? U knjizi ni코ta ne pi코e op코irnije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93492": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@tolecnal#93482 Pi코e prili캜no jasno - hiding se bazira na otpornosti na kolizije, puzzle friendliness na nepredvidivosti hash funkcije (tj. modifikacija parametara hash funkcije da bi se postigao odre캠eni izlaz zahtijeva prakti캜ki pretragu cijele domene)\n\ns tim da uzmi u obzir sljede캖e - kod hidinga ima코 svojstvo koje zabranjuje ekvivalenciju. Kod puzzle friendlinessa ima코 svojstvo koje zabranjuje pripadnost nekom skupu. U drugom slu캜aju je zabranjena ekvivalencija samo kad je taj skup veli캜ine 1, dakle na najte쬰m difficultyju. Ali 캜ak i tad, pronalazak dijela ulaza u hash uz dani ostatak nije ekvivalentno pronalasku parova izmijenjene poruke i noncea uz isti izlaz. U slu캜aju pronalaska parova to ti je kao da mo쬰코 mijenjati ovaj zadani dio kod puzzle friendlinessa, a to je onda puno lak코e.\n\nPrimjer - rje코ava코 slagalicu [imath]H(\\text{abc} || x) = y[/imath]. Kad bi znao da [imath]H(\\text{efghi} || x') = y[/imath] ima kao rje코enje kra캖i [imath]x'[/imath], onda bi slagalica bila lak코a. Naravno, ovo je ilustrativno, ne캖e ti taj [imath]nonce'[/imath] biti dulji, ali 쬰lim ilustrirati da u slu캜aju mijenjanja po캜etnog podatka mo쬯a mo쬰코 na lak코i na캜in do캖i do rje코enja za razliku od fiksiranog po캜etnog podatka. U tom slu캜aju, da, to je kao da si otkrio [imath]nonce'[/imath] i tra쬴코 preostali [imath]msg'[/imath], ali kod rje코avanja slagalice je upravo te쬴na u tome da ne smije코 dirati zadane parametre, pa onda ne mo쬰코 umetnuti svoj [imath]nonce'[/imath].",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93494": {
      "poster": "InCogNiTo124",
      "content": "@tolecnal#93482 evo tu je okej objasnjeno: https://stackoverflow.com/a/42911162\n\n@tolecnal#93481 uveli smo Scrogea (Branka) da bismo sprjecili problem double spendinga i on je centralni autoritet kojem vjerujemo. To povjerenje Scrooge opravdava sa svojim digitalnim potpisom, ko kad ode코 u op캖inu pa ti lupe pe캜at i to  je sad validno, i zato jer je validno njemu vjerujemo. Takoder, s obzirom da on jedino moze dodavat stvari na ledger, transakcije moraju biti potpisane da bi uopec zavrsile tamo. Valjda ima smisla ovo sve haha",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93505": {
      "poster": "[deleted]",
      "content": "@micho#93492 \n\n> @micho#93492 hiding se bazira na otpornosti na kolizije\n\n> @micho#93492 puzzle friendliness na nepredvidivosti hash funkcije\n\nNisam ba코 uspio to izvu캜 iz teksta, ali ok, sada vidim u stvari koja je razlika. Tnx. Svi캠a mi se tvoje obja코njenje.",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93506": {
      "poster": "[deleted]",
      "content": "@InCogNiTo124#93494 Da, ovo sa Scrooge-om ima smisla. Tnx.",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93519": {
      "poster": "PeroPerica",
      "content": "Zasto se u ovim predavanjima potencira da je ASIC ono sto uzrokuje problem grupiranja? Uzrokuje ga ljudska potreba za smanjenim rizikom (u vidu manje disperzije), a ne tehnika rudarenja.",
      "votes": {
        "upvoters": [
          "Filemon"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93525": {
      "poster": "InCogNiTo124",
      "content": "@PeroPerica#93519 pa okej, da, vise je katalizator, mada da nema asica ne bi bilo _toliko_ grupiranja",
      "votes": {
        "upvoters": [
          "PeroPerica"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93528": {
      "poster": "PeroPerica",
      "content": "@InCogNiTo124#93525 Ok sad sam razmislio, ima smisla da su osobni korisnici dodatno discouraged jer ne dobivaju isti hash rate per money od svog laptopa, kao netko od asic-a.",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93778": {
      "poster": "bebich",
      "content": "Rudarim peercoin i ja ulozim 100 peercoina dal ce mi se njihov age smanjiti(resetirat) ako ja nisam izrudaril blok?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93784": {
      "poster": "antunmod",
      "content": "U interesu ti je raditi fork kod mineanja ako imas velike resurse (cca > 25% cijele mreze). Posto je velika vjerojatnost da ces bas ti pronaci novo rjesenje, mozes stvoriti blok i ne objaviti ga i nad njim rjesavati novu slagalicu. Na taj nacin moguce je da ces pronaci novo rjesenje i dalje graditi svoj lanac, a ostatak sustava je u meduvremeno pronasao manje blokova. Kad zakljucis da ti se priblizavaju/ da je preriskantno, objavis lanac. Naravno, to je riskantno i tesko je da ces uspjeti pribaviti resurse > 25 % 游땚",
      "votes": {
        "upvoters": [
          "ALovelace"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93786": {
      "poster": "antunmod",
      "content": "@bebich#93778 \n\nhttps://bitfalls.com/2018/03/11/peercoin-explained-proof-stake-pioneer/\n\nRekao bih da ne. Pi코e da se resetira u trenutku kad iskopa코 novi blok i da je maksimalna vrijednost coina kad je star 90 dana",
      "votes": {
        "upvoters": [
          "Juren",
          "bebich"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "93914": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Jim \n\nDa nadodam vezano uz motivaciju za fork, htio bi ga napraviti ako npr. 쬰li코 double spendati nov캜i캖e. Dakle ako npr. ti po코alje코 Ani neke pare, ona tebi da proizvod, i onda ako uspije코 napraviti fork gdje ignorira코 tu transakciju i napravi코 transakciju tih nov캜i캖a negdje drugdje (npr. sebi), onda 캖e se prihvatiti tvoja transakcija ako je u duljem lancu, a kad ona za Anu u oprhaned bloku do캠e na obradu bit 캖e odba캜ena jer su ti nov캜i캖i ve캖 potro코eni. Time si samo popu코io proviziju za obradu transakcije.\n\nTo ti je ujedno i motivacija za코to 쬰li코 캜ekati 6+ blokova potvrde prije nego 코to smatra코 transakciju provedenom - bilo koji fork koji je dulji od duljine vrha lanca do bloka u kojem je tvoja transakcija ti potencijalno zblokira tu transakciju poku코ajem double spendinga.\n\nA za ono kontriranje usporavanja rudarenja radi forkova vrijedi ovo:\n\n>! Dakle ajmo re캖i da postoji neki 쬰ljeni fork i sad konstantno nastaju forkovi zbog nekompatibilnosti softvera za rudarenje. Ono 코to 캖e se dogoditi je da 캖e se potencijalno rudariti obje grane podjednako ako do캠e do Nashovog ekvilibrija - i onda si u problemu jer ako je sustav dovoljno stabilan 캖e se naizmjence stvarati ti manji forkovi. Potencijalno si podijelio cijeli community rudara na 2 grupe, i prepolovio brzinu rudarenja. Ako to potraje oko 2 tjedna (a to uop캖e nije vjerojatno!) onda 캖e se smanjiti difficulty mre쬰, jer ona nastoji kopati blok svakih 10 minuta prosje캜no.\n\n> E sad, treba jo코 jednom re캖i da da se ovo dogodi treba stvarno luda sre캖a. Prakti캜ki nemogu캖e jer bi se trebalo dogoditi to da kad se jednom odbaci jedna grana blokova se majneri s te grane prebace na drugu (ne 쬰le gubiti vrijeme i resurse na grani na kojoj su upravo odba캜eni blokovi). Ali, kad bi se ipak dogodila ravnote쬬 i Nashov ekvilibrij, onda bi vjerojatno bilo u interesu majnerima raditi to, smanjiti difficulty, i onda odjednom all-innati na jednu granu. Treba primijetiti da u takvom slu캜aju koordiniranosti za 2 grane lak코e bi bilo jednostavno hijackati cijelu mre쬿 (jer za takav dogovor ima코 barem 25% sa svake strane koji se brinu da se podjednako majna, a to je 50%, vi코e nego dovoljno za malverzacije) :)\n\n> Vjerujem da ne bi bilo te코ko pokazati da vjerojatnost za ovakvim scenarijom raste 코to ima코 vi코e grananja. Dakle uz 2 grane, mislim da je i meni i tebi jasno koliko je nevjerojatno da 2 tjedna svi majnaju otprilike jednako na tim granama. Ali recimo da imamo 100000 grana, bez obzira na to koliko su me캠usobno neujedna캜ene, majnanje 캖e biti jako sporo na svim granama, ali je isto 캜injenica da uz tako veliko raspr코enje 캖e manji postotak grana actually raditi, u slu캜aju jedne kriptovalute, pa Nashov ekvilibrij generalno ne캖e vrijediti dugo jer 캖e postojati puno ve캖a inicijativa majnati na toj grani gdje se priznaju blokovi umjesto potencijalno 99999 grana niskog difficultyja bez profita. No opet, onda se u po캜etcima tog scenarija majneri s ve캖inom resursa u grani samo mogu spojiti na drugu granu i sjebati ostale, samo sad im mo쬯a ni ne treba 50%, uz 100000 grana i uniformnu raspodijeljenost bi im trebalo 0.001%. Tako da vi코e grana = smrt kriptovalute. I zato imamo pravila, da ne mo쬰코 proizvoljno forkati ne코to i tako sjebavati ljude, nego da te ta pravila dr쬰 u jednoj grani, tj. originalnom lancu, a da se ti poku코aju soft forka odbace kao neispravni blokovi.",
      "votes": {
        "upvoters": [
          "Jim"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94152": {
      "poster": "bebich",
      "content": "Koja je razlika izmedu obicne transakcije i coinbase transakcije?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94158": {
      "poster": "InCogNiTo124",
      "content": "@bebich#94152 jedina transakcija koja nema ulaza a ima izlaza, sluzi za stvaranje bitkojna. ona je odgovorna za onih 6.25BTC sto svakom majneru sjedne na acc",
      "votes": {
        "upvoters": [
          "ALovelace",
          "bebich"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94159": {
      "poster": "Ma97",
      "content": "@bebich#94152 Transakcija je npr prijenos 1BTC izme캠u dva ili vi코e korisnika(ili sam sebi), dok je coinbase prva transakcija bloka vrijednosti nagrade za blok (i nagrada za svaku transakciju, mo쬯a?)",
      "votes": {
        "upvoters": [
          "bebich"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94184": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "> @Ma97#94159 i nagrada za svaku transakciju\n\n[s]Mislim da ne, jer ti kad radi코 transakciju nudi코 nagradu, pa bi onda ulaz bio po코iljatelj bitcoina a izlaz ovisno tko je procesuira[/s]. Tu naknadu za transakciju daje korisnik, [s]ne mre쬬[/s] (tj. ne nastane ni iz 캜ega konsenzusom ostalih u mre쬴). Coinbase nema ulaza, a [s]naknade za transakciju imaju[/s].\n\nEDIT: Ispada da naknade za transakciju nemaju isti tijek 쬴vota kao sama transakcija, vidi ispod.",
      "votes": {
        "upvoters": [
          "Ma97"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94228": {
      "poster": "Jim",
      "content": "Iz slu쬭ene literature:\n\nA coinbase transaction creates new coins. It does not redeem a\n\nprevious output, and it has a null hash pointer indicating this. It has a coinbase parameter which can\n\ncontain arbitrary data. The value of the coinbase transaction is the block reward plus all of the\n\ntransaction fees included in this block.\n\n@micho @Ma97",
      "votes": {
        "upvoters": [
          "Ma97",
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)"
        ],
        "tuga": []
      }
    },
    "94244": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@Jim#94228 Okej i코ao sam malo istra쬴vati 코to se to캜no doga캠a. Naime, mene je zajebavala pomisao gdje u tom slu캜aju te naknade mogu samo nestati, jer u principu ako nema transfera po코iljatelj -> negdje, onda se te naknade privremeno uni코tavaju nakon 코to je transakcija izvedena, pa ponovno stvaraju kad miner uzme nagradu.\n\nIspada da je ovakvo pona코anje 쬰ljeno i da se blokovske nagrade stvarno mogu uni코titi ako se ne transferiraju na valjanu adresu (https://en.bitcoin.it/wiki/Miner_fees#Overview)\n\nIspravit 캖u neto캜an navod.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "106828": {
      "poster": "glava222",
      "content": "iz labosa nema pragova, osim da se moraju napraviti oni obvezni zadaci?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "110511": {
      "poster": "antunmod",
      "content": "Gdje mogu prona캖i informacije o seminaru? Vidio sam da bi teme trebale biti objavljene nakon MI, no nigdje ne pronalazim ni teme, ni rokove 游뱂",
      "votes": {
        "upvoters": [
          "Abarth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "117941": {
      "poster": "kojski",
      "content": "Tra쬴 li netko seminarsku grupu/tra쬴 li neka grupa 캜lanove? :)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "123447": {
      "poster": "ALovelace",
      "content": "ima li netko snimljeno 10. predavanje? Vidim da nisu postavili pod snimke predavanja",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "Turg"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "124109": {
      "poster": "Marquisio",
      "content": "Moze netko podijeliti 8. i 9. snimljeno predavanje ako ima ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "124123": {
      "poster": "jitser",
      "content": "Ulazi li 12. predavanje u gradivo ispita? To je ovo 코to je bilo 14.1 i navodno ga je vodio gost predava캜?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "127894": {
      "poster": "Mr_Why",
      "content": "@jitser#124123 s obzirom da je na zavr코nom ispitu iz 2019 pitanje vezano uz porez, a mislim da je to sa tog predavanja, rekao bih da ulazi, ali sumnjam da 캖e se odnositi na puno pitanja",
      "votes": {
        "upvoters": [
          "jitser"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "128420": {
      "poster": "peaceko",
      "content": "@Mr_Why#127894 ima li mo쬯a netko to predavanje (ili mo쬰 re캖i koliko su prezentacije s ferweba povezane)? Jedino koje nisam pratio i onda se nije snimalo..",
      "votes": {
        "upvoters": [
          "a_ko_si_ti",
          "prodanacro (oat)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "ALovelace"
        ]
      }
    },
    "218663": {
      "poster": "a_ko_si_ti",
      "content": "Je li u pisanju Bitcoin skripti uvijek koristim PO_CHECKSIGVERIFY ili tra쬰 da nam ipak bude 1 na vrhu stoga nakon sto je sve gotovo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "245474": {
      "poster": "Gocc (***)",
      "content": "![](assets/2021-10-21/00002.png)\n\nkoji odgovor je tu ispravan",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "245485": {
      "poster": "Rene",
      "content": "@\"anaa\"#p245474 podatci moraju biti sortirani (BST) i onda das putanju do dva susjedna cvora izmedu kojih bi trebao biti trazeni element. Posto su susjedni, trazeni element nije u stablu",
      "votes": {
        "upvoters": [
          "Gocc (***)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255013": {
      "poster": "ana (anci)",
      "content": "Je li segregated witness i Taproot/Schnorr nesto sto je jako bitno na ovom predmetu? Pokusala sam pogledati par videa na yt vezano za to ali ne mogu bas rec da mi je sjelo kako spada.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255071": {
      "poster": "Tone",
      "content": "![](assets/2021-11-18/00003.png)\n\nIma li tko zapisane formule za ova tri zadatka? Sje캖am se da je profesor bio zapisivao na plo캜u, ali nisam zapisala....",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255150": {
      "poster": "boogie_woogie (nika_1999)",
      "content": "@\"Tone\"#p255071 \n\nO캜ekivano vrijeme rje코avanja slagalice je: (2^n) / (t*vi)\n\nVrijeme da 캖e i-ti 캜vor predlo쬴ti novi blok: (2^n) / (sum(vi) * t)\n\nVjerojatnost da 캖e Ai prvi rije코iti slagalicu: vi / sum(vi)",
      "votes": {
        "upvoters": [
          "Kikyy99",
          "Tone",
          "gladiator",
          "luba"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255151": {
      "poster": "boogie_woogie (nika_1999)",
      "content": "Zna netko 4. pod a)?\n\n![](assets/2021-11-18/00008.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255317": {
      "poster": "micho (M퍗폠폫퍌퍊i퍘팩팰폜캖퍖쮋퍃o퍘폑퍟퍜퍆)",
      "content": "@\"anci\"#p255013 Iz sje캖anja nije ba코, znam 코to je segregated witness ovako iz prakse, ovo drugi prvi put 캜ujem haha",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255364": {
      "poster": "Gocc (***)",
      "content": "Isplati li se 캜itat tu knjigu s obzirom da je dost opse쬹a 캜ini mi se da bi puno vremena oti코lo na to",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255677": {
      "poster": "Rene",
      "content": "@\"boogie_woogie\"#p255151 \n\nNisam siguran, al mozda ovako:\n\nA) 600000 OP_CHECKLOCKTIMEVERIFY 2 <pkJosip> <pkMama> <pkTata> 3 OP_CHECKMULTISIG\n\nB) OP_0 <pkJosip> <pkMama> ili OP_0 <pkJosip> <pkTata> (0 je zbog buga u checkmultisig)\n\nC) OP_RETURN\n\nU ovom slucaju mogu i oba roditelja bez Josipa uzeti novce, al valjda nisu klosari",
      "votes": {
        "upvoters": [
          "Juren",
          "boogie_woogie (nika_1999)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Juren"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "255697": {
      "poster": "pingvinka",
      "content": "@\"anaa\"#p255364 procitala sam ju i osobno bila mi je ful korisna i preporucila bih ako smatras da su perezentacije malo oskudne i/ili nisi sve pohvatala na predavanju",
      "votes": {
        "upvoters": [
          "Gocc (***)",
          "Juren",
          "gamigugi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255698": {
      "poster": "pingvinka",
      "content": "@\"Rene\"#p255677 ja bih to onda napisala tako da dvaput bude provjera sig-a, jednom da provjerava bas josipov i njegov mora bit tamo, a drugi put multichecksig tako da bude ili mamin ili tatin\n\ndakle nesto ovako:\n\n(unlocking) 600 000 OP_CHECKLOCKTIMEVERIFY 1 pkTata pkMama 2 OP_CHECKMULTISIGVERIFY pkJosip OP_CHECKSIGVERIFY\n\n(locking s npr. maminim klju캜em) OP_0 sigMama sigJosip",
      "votes": {
        "upvoters": [
          "gamigugi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255711": {
      "poster": "gamigugi",
      "content": "Ako neko ima odgovore na 5. zad iz MI 2018. cijenio bih vidjeti ih\n>!![](assets/2021-11-20/00014.png)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255715": {
      "poster": "Belfort",
      "content": "Postoji sharean dokument od prosle godine sa ispitima i njihovim rjesenjima. Nalazi se u threadu MI 2020/2021 i tu ga stavljam (nadam se da kolega koji ga je napravio nema nista protiv): \n\nhttps://docs.google.com/document/d/19z3LukXgcNYz1sGrpPKozGrJp1WFp0hHQLiOW-yeoF8/edit#heading=h.z2afuuh27ls2\n\nBilo bi lijepo kad bi ga jos netko nadopunio i napisao rjesenja MI-a od prosle godine haha",
      "votes": {
        "upvoters": [
          "Doktor0807",
          "Kikyy99",
          "Nemo",
          "PrisonMike (맚evo)",
          "Quentin",
          "Rene",
          "Upforpslone",
          "Watson (112)",
          "boogie_woogie (nika_1999)",
          "cloudies",
          "gamigugi",
          "joc",
          "keykey",
          "luba",
          "narval13068 (Dima)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255927": {
      "poster": "Gocc (***)",
      "content": "![](assets/2021-11-21/00002.png)\n\nzna netko odgovorit na neka od ovih ozna캜enih pitanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255932": {
      "poster": "Rene",
      "content": "@\"anaa\"#p255927 5. C) nisam 100% na 코to se misli, ali koliko ja shva캖am 캜vor N 캖e zaklju캜iti da je blok ispravan(transakcije i hash su dobri), ali ne캖e nadogra캠ivati taj blok nego svoj zadnji\n\n5.d) ne캖e mo캖i jer 캖e ostatak mre쬰 prihvatiti taj blok i nastaviti nadogra캠ivat lanac na njemu",
      "votes": {
        "upvoters": [
          "Gocc (***)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255941": {
      "poster": "Gocc (***)",
      "content": "@\"Rene\"#p255932 po meni to sve ovisi o tome koji je najdulji lanac, a sad nigdje ne vidim to캜no ovo u skripti zato me buni",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255947": {
      "poster": "adidas",
      "content": "![](assets/2021-11-21/00004.png)\n\nd)\n\nRekao bi da je mogu캖e. Ako napravimo identi캜ne transakcije(isti vin, isti vout itd.). Onda 캖e hash i jedne i druge transakcije biti isti.\n\nNe vidim kakve veze ovo pitanje ima sa BIP 34. BIP 34 se odnosi na coinbase transakcije, a ovo je obi캜na transakcija.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255949": {
      "poster": "Rene",
      "content": "@\"anaa\"#p255941 za c) kao sto sam rekao nije mi najjasnija formulacija, ali za d) nije bitno:\n\nSlucaj 1: blok je ispravan i to je najduzi lanac, ako ga cvor nr prihvati ostali hoce i cvor ce efektivno ostati van lanca\n\nSlucaj 2: blok je ispravan ali nije najduzi lanac, mreza ce ga ignorirati ukljucujuci i razmatrani cvor, ali svejedno taj blok nece zavrsiti u lancu ni tad ni poslije",
      "votes": {
        "upvoters": [
          "Gocc (***)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255954": {
      "poster": "Gocc (***)",
      "content": "@\"Rene\"#p255949 kako mislis  \"cvor ce efektivno ostati van lanca\" zar on nece azurirati svoj laanc na najduzi nakon nekog vremena shvacajuci da on rudari ipak na krivom lancu i da taj lanac nije ispravan",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "255957": {
      "poster": "Rene",
      "content": "@\"anaa\"#p255954 Da, ali onda time onda efektivno prihva캖a i ovaj blok koji je odbio.. Sad ovo \"ho캖e li ga mo캖i u budu캖nosti prihvatiti\" sam ja shvatio kao da ga nekad naknadno stavi u lanac, ali ako je zami코ljeno kao kasnije u vremenu, onda da, mo캖i 캖e (morat 캖e) ga prihvatit kada prihvati cijeli lanac. U svakom slu캜aju i ja bi volio 캜ut jo코 ne캜ije mi코ljenje",
      "votes": {
        "upvoters": [
          "Gocc (***)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "256054": {
      "poster": "lovro (l123)",
      "content": "@\"boogie_woogie\"#p255150 맚a ovdje t ozna캜ava?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "256074": {
      "poster": "boogie_woogie (nika_1999)",
      "content": "@\"l123\"#p256054 \n\nt je prag kojeg mora zadovoljiti sazetak tj. difficulty",
      "votes": {
        "upvoters": [
          "lovro (l123)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "256107": {
      "poster": "Rene",
      "content": "Ovo s o캜ekivanjem i varijancom kada se vrijeme izme캠u blokova udvostru캜i, zar nije da vrijedi E(2X) = 2 E(X), Var(2X) = 2^2 Var(X)? Otkud da se varijanca smanji 2 puta?",
      "votes": {
        "upvoters": [
          "Lordborne"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "256153": {
      "poster": "viliml",
      "content": "@\"adidas\"#p255947 Dvije validne transakcije ne mogu obje tro코iti isti nov캜i캖 dakle ne mogu imati isti vin",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "256170": {
      "poster": "vuk172",
      "content": "@\"adidas\"#p255947 A koji je odgovor na b), c) i e)? Plizzz ne ku쬴m iz ovog shareanog dokumenta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272706": {
      "poster": "adidas",
      "content": "Mogu li se DAI prodati drugoj strani, a da nije MakerDao?\n\nAko se mo쬰 prodati 코to se dogodi sa collateral-om koji je vezan za prodane DAI?",
      "votes": {
        "upvoters": [
          "madoxx"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272946": {
      "poster": "madoxx",
      "content": "@\"adidas\"#p272706 \n\nMo쬰, kada minta코 svoje DAI tokene mo쬰코 ih prodati na za ETH, dolare ili bilo 코to drugo. S kolateralom se ne dogodi ni코ta u tom slu캜aju. Nije on konkretno vezan na te DAI tokene jer su oni fungible, tj. ti ako hoces vratiti kolateral, moras vratit unutra toliko DAI-a koliko si mintao kod zaloga, ali to ne moraju biti \"ti isti tokeni\", nego si ti u me캠uvremenu mogao kupiti ETH za DAI, BTC za ETH, DAI za BTC itd... Zna캜i nikog ne zanima 코ta ti radi코 sa svojim DAI tokenima, glavno je da ih na kraju vrati코 ako 쬰li코 kolateral. Ako ne vrati코 ode glavnina kolaterala + likvidacijski fee",
      "votes": {
        "upvoters": [
          "adidas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272947": {
      "poster": "madoxx",
      "content": "@\"adidas\"#p272706 \n\nanalogija bi ti bila kad ti netko posudi novce, a ti npr. stavi코 auto kao kolateral. Njega uglavnom nije briga jesi li ti tim novcem kupio zlato, kockao, ulo쬴o u posao ili sli캜no.",
      "votes": {
        "upvoters": [
          "adidas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272955": {
      "poster": "Gocc (***)",
      "content": "![](assets/2022-01-23/00010.png)\n\n코to se doga캠a u ZI-ju 2019 s ovom definicijom funkcije i pozivom \"available\" je li to ispravno op캖e sintaksno?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272966": {
      "poster": "Luka14 (Kekec)",
      "content": "@\"anaa\"#p272955 \n\nTo ti je function modifier koji tako캠er mora biti definirat negdje unutar ugovora sa klju캜nom rije캜i modifier\n\nOn u sebi ima posebnu instrukciju koja glasi \"_;\" i na to mjesto se stavlja kod originalne funkcije (u ovom slu캜aju buyNew) te se ona normalno izvr코ava\n\nMo쬰코 na to gledat kao nekakav wrapper.",
      "votes": {
        "upvoters": [
          "Gocc (***)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272967": {
      "poster": "Rene",
      "content": "@\"anaa\"#p272955 to ti je modifikator funkcije definiran na 37. Liniji\n\nZamisli da kod funkcije oznacene s tim modifikatorom dode na mjesto _ u modifikatoru, znaci u ovom slucaju ce se izvest buyNew i na kraju ako je ticketsRemaining otisao u minus bacit ce se greska",
      "votes": {
        "upvoters": [
          "Gocc (***)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272975": {
      "poster": "gladiator",
      "content": "ZI 18/19, mo쬰 li netko ukratko objasniti 3. zadatak?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272998": {
      "poster": "Rene",
      "content": "@\"gladiator\"#p272975 nisam siguran pa bih volio da neko potvrdi, ali \n\nA) nastat ce fork i B dio lanca ce se odvojiti i nastaviti raditi po svome\n\nB) vecina rudara ne prihvaca neispravne blokove pa ce ih i A dio valjda shvatiti da nesto ne stima i fixat bug",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273008": {
      "poster": "PrisonMike (맚evo)",
      "content": "@\"gladiator\"#p272975 Nezz jel zna코 za ovaj dokument: https://docs.google.com/document/d/19z3LukXgcNYz1sGrpPKozGrJp1WFp0hHQLiOW-yeoF8/edit\n\nIma i za taj zadatak obja코njen",
      "votes": {
        "upvoters": [
          "tomekbeli420"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273015": {
      "poster": "gladiator",
      "content": "@\"맚evo\"#p273008 hvala kolega\n\nide _gas_",
      "votes": {
        "upvoters": [
          "Juren",
          "MrHead (vandal)",
          "adidas",
          "madoxx"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Juren",
          "Mikki",
          "MrHead (vandal)",
          "PrisonMike (맚evo)",
          "Rene",
          "Upforpslone",
          "adidas",
          "keykey",
          "tomekbeli420"
        ],
        "wtf": [],
        "tuga": []
      }
    }
  }
}