{
  "title": "[EIIT] Predmeti 3. godine preddiplomskog studija",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "eiit-predmeti-3-godine-preddiplomskog-studija",
  "tags": [
    "FER",
    "Općenito",
    "Informacije o predmetima"
  ],
  "posts": {
    "44401": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Ovdje možete podijeliti iskustva, preporuke i/ili pitati u vezi predmeta **3. godine preddiplomskog studija [u]elektrotehnike i informacijske tehnologije[/u]**.\n\nUkoliko želite podijeliti mišljenje(a) o predmetu, možete koristiti sljedeći predložak:\n\n```markdown\n## Ime predmeta\n\nnešto o predmetu\n\nTežina: **? / 10**\nKorisnost: **? / 10**\nBih li preporučio/la predmet: **Da / Ne**\n```\n\nšto će rezultirati:\n\n>## Ime predmeta\n\n>nešto o predmetu\n\n>Težina: **? / 10**\n\n>Korisnost: **? / 10**\n\n>Bih li preporučio/la predmet: **Da / Ne**\n\nNije imperativ da koristite ovakav predložak (ili bilo koji drugi), ali ovo izgleda sažeto i vjerujem da uz najmanji trud i najmanje tipkanja možete ponuditi lijepo formatirane informacije.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "44403": {
      "poster": "HeHe (Direktor života)",
      "content": "niga",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52108": {
      "poster": "Feelcool",
      "content": "Uvodna napomena: trenutno sam na Automatici, na diplomskom ću upisati ESIT.\n\n## Elektromagnetska polja\n\nJoš jedan od onih predmeta koji ti ubiju volju za studiranjem, sva sreća zadnji takav (ako se ne varam). Samo ime predmeta govori kaj se događa u njemu, nema previše mudrosti. Moje iskustvo je rješit Tirkuljinu zbirku, sve ostalo je overkill. \n\nBtw. na FER2 je bio  u 4. semestru, vama je u 5. Ne sumnjam da će sve ostati isto.\n\nTežina: **8 / 10**-moguće presubjektivno(jbga napatio sam se)\n\nKorisnost: **2 / 10**\n\nBih li preporučio/la predmet: **OŠ NEŠ-MORAŠ**\n\n## Automatsko upravljanje \n\nNajkorisniji predmet što se automatike tiče. Stvarno dobro izveden, labosi (ako ih radiš sam) jako korisni, ispiti dosta teški i zamorni, te treba porješavat mali milijun ispita kao pripremu, ali svi su dostupni na Web-u zajedno s rješenjima. Od njega sam imao najviše koristi na 3. godini. Apsolutno sve što se tiče upravljanja se nadovezuje na njega.\n\nTežina: **7 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **OŠ NEŠ-MORAŠ**\n\n## Elementi sustava automatizacije \n\nNajgori predmet 5. semestra. Nikako ne upisivat. U teoriji zvuči super, radi sve vezano uz automatizaciju i upravljanje. Imate ogromne sreće što ga ne morate upisivat(nama je bio obvezan). Prof. Kovačić jako loše izvodi predmet. Nit sam išta naučio, samo sam se napatio. Ako želite ovo upisat, nemojte.\n\nTežina: **3 / 10**\n\nKorisnost: **0 / 10**\n\nBih li preporučio/la predmet: **NE, NE i NE**\n\n## Osnove mehatronike\n\nUpisao kao izborni u 6. semestru(vama je u 5.). Dosta lagan predmet, s laganim labosima i još laksim ispitom gdje se ponavlja većina zadataka. Ne mogu reći da sam pretjerano puno naučio i da je bilo korisno. Prof. Ileš jako simpatičan, to je plus.\n\nTežina: **2/ 10**\n\nKorisnost: **5 / 10**\n\nBih li preporučio/la predmet: Više **NE** nego DA\n\n## Komunikacijski sustavi (ex Elektroničke komunikacije koji je bio u 5. semestru, vama je u 6.)\n\nLagan i beskoristan. Nemamo ni priblizno dovoljno znanja da bi bio koristan predmet. Asistenti se trude, ali jednostavno nema previše smisla.\n\nTežina: **2 / 10**\n\nKorisnost: **3 / 10**\n\nBih li preporučio/la predmet: **OŠ NEŠ-MORAŠ**\n\n\n## Osnove upravljanja električnim strojevima (ex Praktikum upravljanja električnim strojevima)\n\nPredobar predmet. Vjv. će bit izveden na sličan način kao i PUES. Puno labosa, koji su jako korisni, na kraju sam dobio osjećaj da je ovo idealno izveden predmet u kojem si dosta naučio, dobio dosta praktičnog znanja, a nije bilo preteško.\n\nTežina: **4 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da (za ekipu koja želi na ESIT definitivno)**\n\n\n## Osnove automatizacije (ex Praktikum automatizacije)\n\nŠto se praktične korisnosti tiče, najkorisniji predmet na preddiplomskom. O težini predmeta govori i sama opterećenost labosima(15 labosa). Predmet stvarno pojede semestar, ali ono što daje na kraju je stvarno kvalitetno znanje na području automatizacije. Ljudi koji završe faks, kažu da je ovo jedan od najkorisnijih predmeta na faksu što se tiče kasnijeg zaposlenja. Iako ima 15 labosa, prvih par(tipa od 3. do 8.) su teški, stvarno teški, a kako vrijeme odmiče postaju sve lakši i lakši, ako ne i jako lagani.\n\nTežina: **10 / 10**\n\nKorisnost: **100 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Al_Pakino (Al Pakino)",
          "Apex",
          "Danac",
          "Elle",
          "Ferovac123",
          "Mioch",
          "Red_Baron",
          "Skiv",
          "Upforpslone",
          "Visnja",
          "XkLo",
          "dolfy (Jenny Talia)",
          "netflix (seximan)",
          "pepa",
          "rolotex (brr)",
          "stoja (AutističniAutomatičar)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "52133": {
      "poster": "Bisenberg (DonaldPump)",
      "content": "Meni je 3. godina napravila dar mar u glavi, odabrao sam modul ERI onako, da bude nekakav mix svega, i dobio sam upravo to što sam tražio.\n\nDa se razumijemo, skoro svi predmeti na 3-oj godini su jaaaaakoooo zanimljivi, ali uz mali problem - ako ste kao ja, morate baš baš htjeti da vas ti predmeti zanimaju, i tek će onda postati zanimljivi.\n\n## Elektronika 2\n\nNeću previše pisati o elektronici, ista stvar kao i Elektronika 1, samo što se sada ne radi jedan tranzistor, nego se kombiniraju dva ili više tranzistora ( bipolarac, mosfet ili jfet ), malo pojačala snage, malo bode-ovih dijagrama i tako. Butkovićeva zbirka, zadaci za vježbu - stara priča.\n\nTežina: **7 / 10**\n\nKorisnost: **7 / 10** ( ovisi, kako kome )\n\nBih li preporučio/la predmet: **Da**\n\n## Elektroničke komunikacije\n\nMeni najzanimljiviji predmet, ali loše izveden. BRDO i BRDO teorije, zadaci su lagani ali uz milijun iznimki koje treba znati napamet, nije dopušteno imati nikakav šalabahter jer bi tada predmet bio prelagan. Uče se načini prijenosa korisnih informacija različitim modulacijama ( npr. FM modulacija, kao radio u automobilima ) , općenito o mrežama, lokalnim, mobilnim itd. Tip predmeta koji je ultra lagan i težak u isto vrijeme, ovisno o tome radi li se kampanjski ili kontinuirano, svakako moja preporuka je probati sve kontinuirano, jer znam koliko sam se namučio na roku.\n\nTežina: **5 / 10**\n\nKorisnost: **6 / 10** ( sam po sebi nije baš koristan, ali jako dobar uvod u komunikacije općenito )\n\nBih li preporučio/la predmet: **Da**\n\n## Automatsko upravljanje\n\nPo meni, najbolje organiziran predmet na trećoj godini. Potpuno se slažem s postom kolege @Feelcool malo poviše ove recenzije. Uče se jako zanimljivi principi upravljanja, malo jednadžbi, bode i nyquist, PID regulatori, fora stvari.\n\nTežina: **8 / 10**\n\nKorisnost: **8 / 10** ( ovisi, kako kome )\n\nBih li preporučio/la predmet: **Da**\n\n## Ugradbeni računalni sustavi\n\nMeh predmet. Meni kao ERI-jevcu bi to trebao biti najvažniji predmet na godini, ali pada u totalno drugi plan. Predmet na kojem se može puno naučiti ako želite, ako ne želite nije ga toliko teško proći, malo je problema s nalaženjem materijala. Meni se nije svidio, ima puno, po meni, glupe zastarjele teorije koja ne služi ničemu nego da bude jedno od postavljenih ispitnih pitanja.\n\nTežina: **6 / 10**\n\nKorisnost: **5 / 10** ( ovisi, kako kome )\n\nBih li preporučio/la predmet: **Da**\n\n## Projekt / Završni rad\n\nKriminalno je da se ova dva predmeta toliko stavljaju u drugi plan naspram \"običnih\" predmeta (moje mišljenje). Po riječima mnogih mojih kolega, često se za ove predmete uzimaju neki najjednostavniji zadaci, pro forma, gdje je NEzainteresiranost i studenta i mentora obostrana, što mi je izrazito žao. Često su priče da \" na ovom fakultetu nema prakse dovoljno, samo neke knjige i teorija\". Ja mislim da bi upravo ova treća godina, u sklopu ova dva predmeta trebala studente izbaciti iz takvog razmišljanja i dati im uvid u eventualno stečene sposobnosti tokom cjelokupnog obrazovanja. Da se čovjek može pohvaliti napokon nečime ( \"Evo, ovo sam ja napravio/la. Ne radi najbolje, optimizacija nije napravljena, zapravo više ne radi nego radi, ali NEMA VEZE. To je moje! ).\n\nUglavnom, ova dva predmeta su dvosjekli mač, ako odete u zahtjevnijeg mentora koji nudi jače projekte, puno ćete naučiti ali ćete puno vremena morati utrošiti u to pa postoji veća šansa da će patiti ostatak predmeta. Pripaziti na to.",
      "votes": {
        "upvoters": [
          "Al_Pakino (Al Pakino)",
          "Amon",
          "Apex",
          "BBlock",
          "Bobinator",
          "Danac",
          "Elle",
          "Filemon",
          "InCogNiTo124",
          "Ksai8",
          "Portus",
          "Sans",
          "Skiv",
          "Visnja",
          "Widlar",
          "XkLo",
          "dolfy (Jenny Talia)",
          "ivicato",
          "krokodil",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "pepa",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "53485": {
      "poster": "BigTuna",
      "content": "@Feelcool#52108 jel mozes malo jos pojasnit kak si se napatio na ESA? Jer stavio si tezina 3 pa mi je malo zbunjujuce",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "54211": {
      "poster": "Feelcool",
      "content": "@BigTuna#53485 Patnja nije zbog tezine predmeta. Nego zbog jako lose organizacije i izvedbe. Predmet nije uopce tezak, ali je beskoristan i samo ucis stvari/pojmove/zadatke napamet zato jer nema druge mogućnosti.",
      "votes": {
        "upvoters": [
          "BigTuna"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "54236": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "Na ovoj godini se preporodio sa jedva 3.0 studenta na vrlo dobrog u zimskom i odlicnog sad u ljetnom semestru. Napor povecao nisam, jednostavno su predmeti puno zanimljiviji i laksi za pripremit.\n\n## Elektronika 2\n\nNadogradnja na ELE1 i najbolji predmet semestra. Ako su ti pojacala napeta onda sjedi na predavanje i uzivaj. Ako nisu, odi i mozda ti onda i postanu. Ljudi koji me znaju znaju da ne mogu govoriti objektivno o ele2 i kad bi mogao pao bi ju retroaktivno tako da ju opet mogu proc. Ne bi rekao da je tezak predmet. U najgorem slucaju mos naucit sablonu i pristup rjesavanju zadatka i proc sa dost solidnom ocjenom. \n\nTežina: **5 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Automatsko upravljanje\n\nSuper predmet, kul koncepti, jeben za proc. Labosi i zadace ti uniste vikend, a i mozak. Gradivo definitivno nije jednostavno, pogotovo ako si se provuko kroz matematiku na lijepe oci. Ispiti spadaju def u top 3 najgora ispita na faksu i dijele mjesto sa velikanima E smjera kao sto su EMP i ELEKRU. Najveci problem kod ispita je to sto imas jedno dvije strane racunanja za svaki zadatak i vrlo lako je napraviti gresku, pogotovo pod stresom.\n\nMoj susret s AUPR se moze opisat sa sljedecom slikom \n\n![](assets/2020-07-14/00019.png)\n\n\nTežina: **9 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n## Konstrukcije Elektroničkih Uređaja\n\nZESOI gang. Nez kako ce se i dal ce se odrzavat na f3, al' moja poruka je jasna: ako niste zagrijani za realne komponente, citanje puno grafova i navigiranje poluobjasnjenim gradivom (ugl sto se tice zadataka, predavanja su OK), držite se što dalje od ovog predmeta. Upisao sam ga unatoc tome sto su mi svi govorili da ga ne upisem i shvacam zasto su mi to govorili. Jako puno informacija o jako puno stvari u relativno malo vremena + nismo imali labose ove godine pa nismo ni prakticnog doticaja sa puno stvari imali.\n\nOno sto je stvarno diskvalificirajuce za vecinu ljudi je \"snadji se druze\" pristup. Predavaci ce predat znanje, asistenti ce rijesit par oglednih zadataka, ali ostaje sve na studentu da samostalno usvaja sira znanja potrebna za prolaz predmeta. Definitivno je potrebno sam radit i istrazivat neke stvari, pogotovo dijelove gradiva za koje nema puno zadataka i/ili oglednih primjera.\n\nSve u svemu, dost zanimljiv predmet, ne bi rekao da je pretezak, definitivno vrijedan 4 ECTSa, ali postoje laksi predmeti sa manje glavobolje.\n\nTežina: **6 / 10**\n\nKorisnost: meni **10 / 10**, normalnim ljudima vjv blize **5/10**\n\nBih li preporučio/la predmet: **Ne**\n\n\n## Tehnologija u Medicini\n\nJos jedan ZESOI gang predmet. Ovaj puta sasvim solidno organiziran, zanimljiv, lagan za proc. Def jedan od boljih izbora ako zelis naucit nes o biotehnologiji. \n\nTežina: **3 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Osnove elektroničkih mjerenja i instrumentacije\n\nBig daddy predmet ZESOI ganga za 3. godinu. Red, rad i disciplina. Na ispitu te doceka Vasic, a na usmenom Bilas. Definitivno knock-out kombo za mnoge kolege. Meni osobno je predmet bio sasvim OK, upoznao me sa konceptima koji su me uvijek zanimali, al' nikako da ih se poblize objasni (tipa sum, smetnje, reference i ADCovi). Koliko znam, ovaj predmet vise ne postoji u ovom obliku na f3, al' sumnjam da ce se nes drasticno promijeniti.\n\nTežina: **7 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Apex",
          "Danac",
          "Elle",
          "EstebanVihaio",
          "Trava",
          "Upforpslone",
          "Visnja",
          "Widlar",
          "XkLo",
          "jocelyn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "54301": {
      "poster": "Danac",
      "content": "Netko nešto zna o Elektroenergetskim sustavima?",
      "votes": {
        "upvoters": [
          "PikachuOnAcid (Kaneki kun)",
          "[deleted]",
          "pepa"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "55711": {
      "poster": "KR7 (Detective Schmosby)",
      "content": "**Osnove energetske elektronike**\n\nIma netko iskustva s ovim predmetom?",
      "votes": {
        "upvoters": [
          "pepa"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "56580": {
      "poster": "mrleongalaxyum (Neovlašteni serviser)",
      "content": "Jel išo ko na električnu rasvjetu? Jel se tam uci samo kak zamijenit žarulju il ima neke advanced geometrijske optike?",
      "votes": {
        "upvoters": [
          "gladiator",
          "mrleongalaxyum (Neovlašteni serviser)"
        ],
        "downvoters": [
          "netflix (seximan)"
        ]
      },
      "reactions": {
        "haha": [
          "in1",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "57806": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "Jel ima netko iskustva sa Moderna fizika i primjene u elektrotehnici?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "57885": {
      "poster": "Jure (bidonitez)",
      "content": "znate nešto za Elektromehaničke pretvorbe energije?",
      "votes": {
        "upvoters": [
          "GranAutismo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "58260": {
      "poster": "BedaTheNic",
      "content": "Praktikum robotike ima itko iskustva neka?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59338": {
      "poster": "Grumio",
      "content": "Ako si budem prebacio par predmeta sa 3. na produljenu godinu, jel mi bolje ostavit automatsko upravljanje za iduću godinu ako mu se zelim posvetit, a da polja probam sad polozit ili da napravim obrnuto?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "59428": {
      "poster": "XkLo",
      "content": "jel bio itko na elektroakustici 1?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61177": {
      "poster": "RedJohn (Angela Martin)",
      "content": "Elektroakustika 1 ili Primijenjeni elektromagnetizam?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61189": {
      "poster": "spejs",
      "content": "@RedJohn#61177 Ovisi sta te zanima, ali Hrabar odlicno odradi Primjenjeni elektromagnetizam, would recommend.",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "RedJohn (Angela Martin)",
          "ivicato"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61259": {
      "poster": "ivicato",
      "content": "@RedJohn#61177 izbjegni sve sa elektroakustike i zivot ce ti biti ljepsi",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)",
          "RedJohn (Angela Martin)",
          "spejs"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "larinjo (ferkom)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
          "netflix (seximan)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "61428": {
      "poster": "imemijejura",
      "content": "Praktikum elektroničkih elemenata i sklopova ili primijenjeni elektromagnetizam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61446": {
      "poster": "ivicato",
      "content": "@imemijejura#61428 ovo prvo je novi predmet, ali brzim pogledom mi se čini kao dosta dobar, a i primijenjeni elektromagnetizam je top predmet, tako da bi ti preporucio oba",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61756": {
      "poster": "Eterle",
      "content": "@ivicato#61259 jel mozes rec zbog cega? jel isto onda vrijedi i za audio elektroniku?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61780": {
      "poster": "ivicato",
      "content": "@Eterle#61756 \"slušao\" sam jedan predmet sa elektroakustike i život mi se zgadio zbog toga, audiosustavi u prvom semestru diplomskog elektronike, prezentacije se svode na povijesne razvoje i razne podjele unutar nekih sustava i gluposti raznoranih, uče se vrste zvučnika, mikrofona i šta ti ja znam svega, ispit je 6-7 \"esejskih\" pitanja, apsolutno ništa korisno od tamo nisam naučio, nekome tko je možda u nekim glazbenim vodama će biti zanimljivije, ali mislim da definitivno takav predmet nema šta tražiti na faksu, bar ne u takvom obliku, može puno toga korisnog biti tamo, naravno, ali ne na ovakav način kako je organizirano, više sam \"naučio\" na usmenom dok je Jambrošić ispitivao kolege i mene, nego čitajući prezentacije, a sve sam ih prošao, nekoliko puta",
      "votes": {
        "upvoters": [
          "Eterle",
          "Makrovalni_Hladnjak",
          "MarokMarsci (Collapse Enjoyer)",
          "RedJohn (Angela Martin)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61785": {
      "poster": "Makrovalni_Hladnjak",
      "content": "@RedJohn#61177 Hrabar je vrh. Prihvaća i potiče rasprave tako da ako ti se sviđa razmišljat upiši njegov predmet. Znam jer sam radio na projektu kod njega i uopće nije egaš. Nebitno mu je šta je on prof.dr. i prihvaća ako pogriješi i student ga ispravi. Naravno uz validan argument. I dosta se može od njega naučiti. Voli pokuse.\n\nJa isto upisujem PEM ove godine. Nadam se da će se kvota ispuniti.\n\nIma li vas još što se mislite oko upisa Primjenjenog elektromagnetizma?",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "RedJohn (Angela Martin)",
          "ivicato"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61805": {
      "poster": "ivicato",
      "content": "@Makrovalni_Hladnjak#61785 nagovori sto vise ljudi da ga upise zbog debilnosti fer3 programa prema kojemu je navodno potrebno 15 (??!??!) ljudi da se predmet odrzi (izborni predmeti na trecoj godini), a po meni bi bilo sramotno da se takav predmet ne odrzi\n\nEDIT: i nagovarajte ljude da ne upisuju predmete na elektroakustici, a kamoli da idu na taj smjer kad dode do diplomskog fer3 (navodno ce postojati taj smjer zasebno sto je jako tuzno i zalosno...)",
      "votes": {
        "upvoters": [
          "spejs"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61852": {
      "poster": "Makrovalni_Hladnjak",
      "content": "Kad već reklamiram idemo do kraja. Ako neznate čime se bavi prof.Hrabar i studenti koje vodi možete ovdje vidjeti (to su sve stvari na \"na rubu znanosti\" (ali ne Mišek style)) https://www.youtube.com/watch?v=_iGM9wwDBC4 . To su sve istraživanja kojima se studenti mogu pridružiti i raditi na njima.",
      "votes": {
        "upvoters": [
          "ivicato"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61856": {
      "poster": "MordorGuy",
      "content": "@Makrovalni_Hladnjak#61852 Hrabar samo pumpa članke gdje mu asistenti odrade glavninu posla, doprinos znanosti nikakav, čak bi rekao i negativan\n\nO metamaterijalima laprda već godinama bez ikakvog pomaka",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "General_Frans",
          "Grdobina2000 (Grdobina)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "61861": {
      "poster": "Makrovalni_Hladnjak",
      "content": "@MordorGuy#61856 Baš je vrhunski šta asistenti rade hrpu toga jer onda i stvarno nešto naučiš i razmišljaš. Sve to na kraju prolazi preko njega i dostupan je za pričati i pomoći pri razmišljanju. Ti bi da se odma sve napravi. Ima stvari koje rade. Ima stvari koje ne rade ofc.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "MordorGuy"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "63510": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@ivicato#61805 Jel ima dovoljno ljudi onda da se predmet održi? Lajk ko se prijavio na njega?",
      "votes": {
        "upvoters": [
          "RedJohn (Angela Martin)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Filemon"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "63527": {
      "poster": "ivicato",
      "content": "@Grdobina2000#63510 nemam pojma, mozes poslati mail profesoru pa ga pitati, on ima uvid sigurno",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "63549": {
      "poster": "aeeo",
      "content": "@Grdobina2000#63510\n\nKoliko ja znam, na fer2 je zadovoljena kvota, ali po fer3 nedostaje 2 ljudi.. Sad kako ce to biti izvedeno, ne znam.",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "63570": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@aeeo#63549 Zar nije to isti predmet s drugačijim imenom? Kaj će se održavat primjenjeni elektromagnetizam i primjena valova paralelno?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "63583": {
      "poster": "aeeo",
      "content": "@Grdobina2000#63570\n\nSadrzajem je isti predmet, ali u sustavu se vodi drugacije. \n\nKako ce se tocno odrzavat, stvarno ne znam, ali u svakom slucaju bi bilo dobro predloziti predmet ljudima koje bi moglo zanimati, a tesko im se odluciti iz nekog razloga.",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "63619": {
      "poster": "LUJXIV",
      "content": "Zašto ste se svi zagrijali za taj predmet?",
      "votes": {
        "upvoters": [
          "BigBoi",
          "GranAutismo",
          "jobi (azex)",
          "pitroid"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "74210": {
      "poster": "Bisenberg (DonaldPump)",
      "content": "Malo su se slegli dojmovi ove lude godine, pa bih htio ostaviti ovdje dojmove s ljetnog semestra na ERI-ju. Ako se ne varam, 2 su obavezna predmeta, Završni rad i 3 izborna predmeta.\n\n## Trgovačko pravo\n\nOve godine je gospođa/ica prof. Horak unijela toliku sreću u moj život, dobili smo sve skupa 3 \"eseja\" o nekim temama, dionička društva, nekakvi zakoni u trgovanju, pretraživanje katastra.... što već, ne sjećam se najbolje, te je tjedan prije završnih ispita ove godine svima koji su to napravili ažurirala 100%, nisam mogao doći sebi naredna 3 dana, prvi put otkad studiram sam vidio ono zeleno na intranetu gdje se ažuriraju bodovi, spala mi je dioptrija sa -1.5 na -0.5 zbog tih opuštajućih tonova. Od mene za ovaj predmet nećete dobiti nekakvu realnu recenziju što se tiče gradiva, to možete pitati ove rokaše haha.\n\nAli u globalu, društveni predmet kao društveni predmet, ništa posebno. \n\nTežina: **2 / 10**\n\nKorisnost: **5 / 10** ( objašnjavaju se tu neke zanimljive pravne stvari, tko bude otvarao svoju firmu svakako ja mislim da neće škoditi referencirati se na literaturu ovog predmeta)\n\nBih li preporučio/la predmet: **Da**\n\n## Osnove elektroničkih mjerenja i instrumentacije (OEMI)\n\nNe znam točno kako se zove ekvivalent na FER3 programu, znam da negdje u prošlim postovima piše. Predmet vrlo lako može postati trn u oku ako ga ne riješite po kratkom postupku. Ne znam točno kako izgleda kontinuirano jer ga ove godine nije bilo, ali na roku je malo zeznuto. Pismeni ispit nije kompliciran, može se proći, iz iskustva znam da natežu malo bodove za prag, ali problem je usmeni. Na usmenome je prof. Bilas, sklizak teren jako, k'o Marmontova kad padne snig u Splitu, ko je bija i vidija, dobro da je preživija. Ako se malo smetnete ili zamucnete, već to lagano u njegovim očima nije vrijedno prolaza, pa bi se trebalo dobro dobro spremiti. Predmet je OK, malo se nauči kako rade ovi instrumenti koje koriste elektrotehničari ( multimetar, osciloskop....), senzori, A/D pretvornici itd. Što se mora naglasiti, po mome mišljenju, prof. Bilas se jako potrudio oko održavanja online nastave, i vidi se da drži do svog predmeta, sve auditorne su duge po sat, sat ipo, predavanja snimljena i lijepo sistematično posložena.\n\nTežina: **7 / 10** (zbog jakog usmenog ispita)\n\nKorisnost: **3 / 10** (ne treba ovo nikome haha, mjerni instrumenti su jako jako usavršeni, nema mi razlike da uzmem novi uređaj i pročitam upute za rad ili da položim ovaj predmet, izuzev duševne boli, ali zanimljivo za znati)\n\nBih li preporučio/la predmet: **Da**\n\n## Skritptni jezici (SKRJ)\n\nNisam ni zamišljao na početku ove godine da će mi Skriptni jezici biti najteži predmet ove godine na faksu. Izborni predmet, uči se Bash, Perl i Python, imaju 3 labosa, po jedan za svaki jezik, najčešće je zadatak da se uveze .txt datoteka u kojoj su zapisani podaci o studentima odvojeni razmacima pa treba uzeti npr. samo jmbag svakog studenta i sve ostvarene bodove. Onako, OK za raditi, po meni bolje ovakav predmet nego neki namjerno lagani predmet, ovdje se možda nauči štogod regexa, malo Pythona itd...\n\nNeću pisati loše strane jer ne mogu prenijeti emociju frustracije dovoljno, ne bih ni htio odgovoriti ikoga da upiše ovaj predmet. Tko je imao ovaj predmet ove godine zna da nešto nije bilo u redu ove godine, možda smo mi kolektivno imali brain fart pa smo vukli ovaj predmet kroz 3 roka, ne bih htio svaljivati krivicu ni na koga. Topla preporuka, ovaj predmet proći kontinuirano, zato što se na ispitnim rokovima 2/3 ispita pišu rukom kodovi. Nemojte se dovesti u situaciju da pišete Bash kod rukom iz sjećanja (imate podsjetnik za Bash; kvota 1.10 da ga u prošlih 10 godina nije pogledalo više od 10 ljudi za vrijeme ispita). Izmiješat će Vam se sva pravila za pisanje, a bodove na uvidima teško da ćete dobiti, praktički nemoguće.\n\nTežina: **4 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Konstrukcija elektroničkih uređaja (KEU)\n\nDosta sam bio podijeljen oko ovog predmeta, u početku mi nije bilo drago jer APSOLUTNO nisam znao uopće koje se  gradivo obrađuje. Ovaj predmet sam \"ostavio\" da leži, pa kad drugi prođu, ja ću pitati što su oni radili pa ću i ja tako haha. Na kraju mi je sve jako lijepo sjelo, 90% ispitanog dijela se prođe u auditornim vježbama i kroz odrađene labose. Labosi su zeznuti za riješiti, mora se dosta guglati jer jednostavno manjka informacija u službenim materijalima. Auditorne vježbe su super, ne pojavljuju se zadaci koji tu nisu riješeni, često sa istim brojevima, objašnjeno dosta teorije usput, super. Online predavanja ove godine je većinski odradio prof. Magjarević, ako se ne varam. Na usmenom ispitu također ispituje prof. Magjarević, te ispituje sve što niste znali na pismenom ispitu, što mi je FENOMENALNO. Teoretski, nakon ispitnog roka i odrađenog usmenog ispita ti znaš praktički cijelo gradivo zbog takvog formata ispitivanja.\n\nNa ovom predmetu uči se kako najbolje projektirati uređaje, izvore napajanja, hlađenje, regulatore struje i napona, zaštite od prenapona, RCD zaštite, ispravljače.... zapravo kad razmislim, dosta sam naučio na ovom predmetu.\n\nTežina: **5 / 10** (malo dok se snađete je problematično)\n\nKorisnost: **6 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Računalom podržano projektiranje elektroničkih uređaja (RPPEU)\n\nTko god se želi baviti nekakvim pločicama ili mikrokontrolerima, ja mislim da bi trebao/la upisati ovaj predmet. Vjerojatno će prouzrokovati par mentalnih lomova jer je projektiranje pločica \"iterativan\" postupak, tu frazu više ne mogu slušati. Ako Vam nešto ne radi na simulaciji pločice, asistenti uglavnom kažu \"obratite se demosima\", a ako ne kažu to, onda trebate ispočetka.\n\nA: \"Trebate imati savršen raspored komponenti odmah na početku, inače nećete moći provući žice kako treba\"\n\nB: \"Kako onda da ispravno postavim komponente?\"\n\nA: \"Morate krenuti, pa u hodu probajte malo prepravljati raspored\"\n\nB: _krene postavljati komponente, nastane kaos i pločica ne funkcionira_\n\nB: \"Postavio sam komponente najbolje što sam mogao, ali zbog ovoga ovdje ne mogu ovo drugo staviti ovdje, a to mi tu treba jer je ovo treće ovdje, kako da sad to prepravim?\"\n\nA: _scratches beard_\n\nA: \"Trebate ispočetka kolega, ovo ste loše napravili\"\n\nB: \"Paaaa možete li mi dati savjet kako da bolje napravim?\"\n\nA: \"Mislim kolega ja Vama mogu dati savjeta puno, ali to Vam najbolje dođe s iskustvom, dizajniranje tiskanih pločica je iterativan postupak, teško da će Vam uspjeti iz prve\"\n\nMoguće je da će ovako izgledati interakcije s asistentima, ali to je u principu istina; asistent ti ne može puno pomoći, osim ako ti ne napravi sve, ali tada se gubi svrha. Na kraju godine svatko napravi svoju pločicu, čuo sam priče o zlatnim danima kada bi se te pločice i printale na kraju godine, ali to se ne radi više ja mislim. Šteta, jer i sami postupak fizičke izrade pločice je zanimljiv. Sve se radi u programu Altium Designer, prvo se crta električna shema, pa nakon toga dizajn same pločice. Za to sve napraviti lijepo će Vam trebati od 1-6 tjedana, ovisno koliko ste posvećeni tome. U slučaju da nekoga zanima kako izgleda izrada pločice (uz možda par greškica i propusta): u Altiumu se napravi dizajn pločice te se isprinta na prozirnom papiru, kao onaj za grafoskope. Onda se uzme prazna pločica koja je prekrivena fotolakom, te se skupa s tom shemom stavi u jaki \"skener\" (pod utjecajem UV zračenja na pločici ostaje točno trag Vaše električne sheme). Nakon toga kreće kemijski dio, gdje se pločica prvo stavlja u nekakvu lužinu, pa nakon toga u nekakvu kiselinu da se višak bakra izjetka, i onda nakon toga bi se trebala dobiti pločica sa ugraviranim putevima i svim povezanim izvodima ( na ZESOI-ju ne bude tako, nego tek nakon 3 dana jetkanja, malo su starije mašine s kojima se gore radi, ali bolje ikad nego nikad ). Poslije toga se buše rupe za izvode, leme se komponente na pločicu i to je to, ako je nešto krivo slobodno javite, ali mislim da je to srž, nije previše kompliciran postupak.\n\nIspit je lagan, pitanja se često ponavljaju, uče se neke slične stvari kao i na predmetu KEU jer to prije nisu bila dva odvojena predmeta, pa postoje preklapanja u gradivu.\n\nTežina: **3 / 10**\n\nKorisnost: **7 / 10**\n\nBih li preporučio/la predmet: **Da**\n\nOvakav odabir izbornih predmeta lijepo zaokružuje projektiranje malih uređaja, stvarno mislim da nema bolje kombinacije na 3. godini što se toga tiče. Ako Vam je interes što lakši prolaz, ovo nije to, ali daleko od toga da je teško i neisplativo.",
      "votes": {
        "upvoters": [
          "Kum",
          "[deleted]",
          "[deleted]",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "74504": {
      "poster": "Grumio",
      "content": "Koliko sam fucked ako slusam automatsko upravljanje bez da sam slusao signale i sustave (carolija konflikata rasporeda)?\n\nIma li nesto posebno sto bi trebao dobro naucit iz SiS-a da pokrpam razliku?",
      "votes": {
        "upvoters": [
          "pepa"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "74516": {
      "poster": "helot",
      "content": "@Grumio#74504 \n\nMoraš razumjeti prijenosne i baratati s njima, iskreno ako slušaš 2. put SIS fokusiraj se na SIS da ga položiš.\n\nAutomatsko je najvažniji predmet za automatičare, najbolje ti je baciti oko na zbirku i skriptu na stranici predmeta ili materijalima, SIS je važan ali prema osobnom sjećanju i mišljenju se svodi na to kako se nosiš s prijenosnim funkcijama, matematičkim modelima te derivacijama/integracijama. Ne sjećam se da Bodea te slične stvari uopće obrađuje SIS jer će se na AUPR ipak to više obrađivati i igrati s time. \n\ntl;dr riješi SIS pod hitno, AUPR skripta/zbirka su kvalitetne da shvatiš kaj se događa",
      "votes": {
        "upvoters": [
          "Grumio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "74525": {
      "poster": "Grumio",
      "content": "@helot#74516 \n\nMa SiS slusam prvi put tek u sljedecom ljetnom semestru, pa sam se usro kad sam vidio da pise na uvodnoj prezi da je potrebno znanje SiS-a. Pa zato pitam jel ima neko poglavlje koje je dobro proucit jer je vazno za AUPR.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "74527": {
      "poster": "helot",
      "content": "@Grumio#74525 \n\nNajbolje ti je da pogledaš u zbirku/udžbenik i vidiš da li ima povezanosti ali iskreno mislim da ćeš se snaći, naveo sam ti što je važno čime da barataš, neki osnovni pojmovi se podrazumijevaju tako da ako ćeš zapinjati ili ćeš tražiti pomoć asistenta/profesora ili ćeš to brzo skapirati u hodu. Što se tiče ispita/labosa mislim da ti ne treba znanje SIS-a toliko da nećeš moći proći.",
      "votes": {
        "upvoters": [
          "Grumio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "75016": {
      "poster": "Astronaut",
      "content": "Ima nekih dojmova o predmetu Elektromehanička i elektromagnetska pretvorba",
      "votes": {
        "upvoters": [
          "BigBoi",
          "GranAutismo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94831": {
      "poster": "LUJXIV",
      "content": "ima netko preporuke izbornih predmeta ako mislim upisat ESIT",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "94844": {
      "poster": "Feelcool",
      "content": "@LUJXIV#94831 \n\nOsnove automatizacije (bivši praaut), Osnove upravljanja električnim strojevima (bivsi pues), Osnove električnih i hibridnih vozila (takav predmet nije postojao na FER2). Evo ja bih odabrao ta tri za ESIT. Slušao sam prva dva i oba su bila korisna te ih preporučam.",
      "votes": {
        "upvoters": [
          "GranAutismo",
          "LUJXIV"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "111987": {
      "poster": "LUJXIV",
      "content": "@Feelcool#94844 Imas neko misljenje o Osnove električnih i hibridnih vozila po onome sta pise na stranici predmeta, neka iskustva s tim profesorima (pandzic i vrazic)? Meni se cini kao neki površni teorijski predmet pogotovo drugi ciklus",
      "votes": {
        "upvoters": [
          "Kum"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115286": {
      "poster": "zeroth",
      "content": "Je li praktikum robotike predmet kao što je ESA, s obzirom da je voditelj Kovačić?",
      "votes": {
        "upvoters": [
          "EstebanVihaio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115295": {
      "poster": "helot",
      "content": "@zeroth#115286 \n\nSamo prvih par predavanja on drži ako uopće sada, za sada je Orsag držao praktikum i ispite.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115307": {
      "poster": "LUJXIV",
      "content": "@helot#115295 kakav je taj predmet? Ne pise nista na stranici predmeta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115313": {
      "poster": "zeroth",
      "content": "@helot#115295 je li to potvrđeno? Netko je rekao i da će Bogdan držati par predavanja na esa pa ga nema uopće.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115315": {
      "poster": "helot",
      "content": "@zeroth#115313 \n\nBogdan je prije držao PLC dio, ali to je bilo prije 2 godine pa mi je teško reći. Uračunaj da korona/online nastava/potresi utječu na to, ali koliko znam micali su Kovačića sa svega i davali Orsagu/Bogdanu. Valjda kako te snađe sreća.\n\n@LUJXIV#115307 \n\nneki mali ispitić koji nosi 20% bodova i ostalo praktični rad na mindstormovima + matlab, bar je tako prije bilo. Prošle godine znam da su koristili 3d printane materijale i da je Orsag držao, trebalo bi pitati nekoga tko je slušao prošle godine, iskreno ne znam kakvi su planovi jer to smisle u prvih 2 tjedna da vide što i kako će biti. Osobno savjetujem ako te zanima pošalji Orsagu mail i pitaj kakvi su planovi da bezveze ne upisuješ predmet, ali inače je bilo 80% praktični rad, samo pitanje kako će biti sada s obzirom na situaciju.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115319": {
      "poster": "zeroth",
      "content": "@helot#115315 onda moguće da ne predaje jer ne radimo plc više uopće na esa. Bogdan drži programiranje i simuliranje robota na kojem se sve svodi na labose, koliko sam vidio na starom predmetu praktični rad je bio programiranje nečega većinom jel tako? Mislim da korona neće previše utjecati na to.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115331": {
      "poster": "helot",
      "content": "@zeroth#115319 \n\nlego mindstorms + matlab uglavnom, tako je bilo proteklih 4 godine, možda su se prebacili na parrot bebope ili arduino+rd printane dijelove. Znam da su na ljeto radili s 3d printanim dijelovima i to je vodio Orsag.",
      "votes": {
        "upvoters": [
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115380": {
      "poster": "netflix (seximan)",
      "content": "@zeroth#115319 ne Bodan nego Orsag",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "115389": {
      "poster": "zeroth",
      "content": "@netflix#115380 taj da, zbunio sam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "netflix (seximan)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "115516": {
      "poster": "stoja (AutističniAutomatičar)",
      "content": "@zeroth#115319 Slušao sam Praktikum robotike prije godinu-dvije. Kao i svi predmeti koje drži ta ekipa su strašno messy (Iako ovo većinom vode Orsag + asistenti). Generalno, ako te zanima robotika, super. Inače ne preporučam. Nešto su izmijenjali program i nije bilo legića. **Matlab + Dynamixel servo motori + web cam = aktuator s dva stupnja slobode + \"računalni vid\".** (Čitaj, mala robotska ruka kupi spajalice prema analizi slike). Dosta posla oko tog projekta, pogotovo ako nemaš u ekipi ljudi koji znaju dobro matlab, onda je RIP. Dijelovi su izrađivani na 3D printerima/CNC glodalici. Svašta nešto se može naučit, **ako te zanima**. \n\nSlažem se s @helot#115315 , pitaj profesora jer praktikumi bez fizičkog prisustva su....tuga",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "116933": {
      "poster": "Feelcool",
      "content": "@LUJXIV#111987 Nisam slušao taj predmet pa ne mogu reći ništa o njemu. Kod Vražića imam sad jedan predmet i jedino kaj mogu reći je da je dosta ležeran.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "116934": {
      "poster": "Feelcool",
      "content": "@LUJXIV#111987 Nisam slušao taj predmet pa ne mogu reći ništa o njemu. Kod Vražića imam sad jedan predmet i jedino kaj mogu reći je da je dosta ležeran.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "125098": {
      "poster": "Vedo",
      "content": "## Elementi sustava automatizacije\n\nIzbjegavati ovo sranje od predmeta kao kugu. Najozbiljnije vam kažem. Ovo u suštini izgleda zanimljivo, ali je predmet u takvoj banani da mu nema pomoći. Profesori i asistenti, koliko god se trudili, jednostavno nisu na razini zadatka za jedan faks poput ovog. Literatura praktički ne postoji, odgovor asistenta je \"guglajte\". Prezentacije su strašno ružne za gledat, a kamoli za počet čitat i \"učit\" iz njih. Mene, kao neko tko se jednog dana želi baviti automatizacijom, ovaj predmet vrijeđa. Ovo nema veze sa automatizacijom. Ako hoćete bolje znanje za automatizaciju, upišite Osnove mehatronike i Osnove energetske elektronike ili bilo što jebeno drugo. Ne upisujte ovaj predmet i pokažite profesorima da rade loš posao. Toliko od mene.\n\nTežina: **10 / 10**\n\nKorisnost: **-∞ / 10**\n\nBih li preporučio/la predmet: **NE NE NE NE NE NE NE NE NE NE NE NE**",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Al_Pakino (Al Pakino)",
          "BMF",
          "Daho_Cro",
          "GranAutismo",
          "Grumio",
          "Mioch",
          "Portus",
          "deus_vult",
          "jobi (azex)",
          "kix7 (Fish99)",
          "mare99 (mare_)",
          "mimara",
          "netflix (seximan)",
          "verratti (Rom Jova (Željezo/bakar))",
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "BedaTheNic",
          "Emma63194",
          "Mioch",
          "Portus",
          "Red_Baron",
          "SergeantPepper (Chet)",
          "Vishnjevac",
          "aperture",
          "brzisha",
          "doroty (dibi)",
          "kix7 (Fish99)",
          "markoo321 (Grinch)",
          "rhythm_controll",
          "spenadla",
          "stoja (AutističniAutomatičar)"
        ],
        "wtf": [],
        "tuga": [
          "Daho_Cro",
          "Filemon",
          "GranAutismo",
          "deus_vult",
          "helot",
          "iNavy (mornar Ica)",
          "jlo"
        ]
      }
    },
    "125109": {
      "poster": "zeroth",
      "content": "@Vedo#125098 mali ispravak, težina je inf/10",
      "votes": {
        "upvoters": [
          "Daho_Cro",
          "Grumio",
          "Mioch",
          "markoo321 (Grinch)",
          "verratti (Rom Jova (Željezo/bakar))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Mioch"
        ]
      }
    },
    "125110": {
      "poster": "Vedo",
      "content": "@zeroth#125109 Mislio sam stavit tbh hahahaah",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "125119": {
      "poster": "BigTuna",
      "content": "## Elementi sustava automatizacije\nCigani\n\n Težina: **Smeće / 10** \n\n Korisnost: **Govno / 10** \n\n Bih li preporučio/la predmet: **good one / Ne*",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "Al_Pakino (Al Pakino)",
          "BBlock",
          "Daho_Cro",
          "GranAutismo",
          "MarokMarsci (Collapse Enjoyer)",
          "deus_vult",
          "netflix (seximan)",
          "verratti (Rom Jova (Željezo/bakar))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "BMF",
          "BedaTheNic",
          "Filemon",
          "InCogNiTo124",
          "Kaladonter",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "Red_Baron",
          "SergeantPepper (Chet)",
          "Vedo",
          "Vishnjevac",
          "ZvonkoSisoje",
          "aperture",
          "boban_rajovic (ravindrababu ravula)",
          "brzisha",
          "deus_vult",
          "jlo",
          "kix7 (Fish99)",
          "pitroid",
          "spejs",
          "spenadla",
          "stoja (AutističniAutomatičar)",
          "zeroth"
        ],
        "wtf": [
          "ivicato",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "tuga": []
      }
    },
    "126891": {
      "poster": "zeroth",
      "content": "Projektiranje elektroničkih sustava i Ugradbeni računalni sustavi ima netko iskustva?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129164": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "Jel slušao netko osnove bežičnih sustava ili neki drugi predmet kod bonefačića da udijeli mišljenje?😁",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129437": {
      "poster": "KR7 (Detective Schmosby)",
      "content": "Zna netko iz prve ili druge ruke kakva je organiziranost zavoda Elektrostrojarstvo i automatizacija te kakva je generalno ekipa (mislim na profesore i asistente).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129480": {
      "poster": "BigTuna",
      "content": "@KR7#129437 profesori koje sam do sad imao su dobri, jedina mana kaj sam skuzio na diplomskom je da svi predmeti imaju usmeni, neznam jel tak i na ostalim smjerovima.",
      "votes": {
        "upvoters": [
          "KR7 (Detective Schmosby)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129482": {
      "poster": "helot",
      "content": "@BigTuna#129480 \n\nautomatika većinom ima usmene, računarci me samo blesavo gledaju kada im to velim",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "BigTuna"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "129538": {
      "poster": "BigTuna",
      "content": "@helot#129482 si bil na kakvoj dobroj praksi iz automatike ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "129542": {
      "poster": "helot",
      "content": "@BigTuna#129538 \n\npisao sam bio u praksama jer je bilo pitanje, bolje tamo postaviti to pitanje ili prebaciti razgovor. Radio sam u par firmi, jedna od njih je bila DOK-ING na koju sam se izvan faks prijavio prije par godina i proveo preko godinu dana, te Global Logic preko ljeta preko praksa kaj je FER organizirao, te je to bilo više manje računarstvo (QT GUI izrada). Drugi kolege će ti više moći preporučiti koji su baš vezani uz samu automatiku/PLS dok sam se ja fokusirao na embedded i UAV. \n\nevo i link na moj odgovor\n\n@helot#107238",
      "votes": {
        "upvoters": [
          "BigTuna",
          "GranAutismo",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "131183": {
      "poster": "[deleted]",
      "content": "![](assets/2021-01-27/00052.png)\n\nŠto od navedenog vrijedi upisati? Ne moram upisati nikoji, no mogu 1 ili 2 s obzirom na manjak opterecenja sljedeci semestar. Ili je mozda bolje da za zavrsni kazem mentoru da mogu nesto vremenski zahtjevnije raditi pa da to vrijeme ulozim na zavrsni rad?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "131213": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "@abcdefgh#131183 IRG i mrezno",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "131365": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@abcdefgh#131183 oblikovni obrasci, eventualno mrežno ako te zanima kako se low-level gradivo s kommre-a implementira",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "131913": {
      "poster": "Nocna_smjena",
      "content": "## Javne pokretne mreže (online)\n\nNadogradnja Komunikacijskih mreža sa 4. semestra. Učite točno kako se korisnik spaja na mrežu mobilnog operatora na svakog mobilnoj generaciji (2G, 3G, 4G, 5G), kako se njome koristi, prednosti i nedostatke. Predmet ima dvije obavezne zadaće i dva obavezna labosa (nisu teški labosi ni zadaće ali znaju malo više vremena uzeti). Ako su vam Komunikacijske mreže bile jednostavne ili relativno jednostavne ovaj predmet nebi trebao nikakav problem predstavljat. Na uvodnom predavanju profesor je otvoreno rekao da ćemo svi kontinuirano proći XD. Međuispit i završni ispit su meni bili online (dio ispita je na zaokruživanje a dio otvorenog tipa). Nema nikakvih pragova na ispitima. Profesori i asistenti su veoma uslužni i ljubazni i pomaknu rokove za predaju ako se zamoli.\n\nTežina: **3 / 10**\n\nKorisnost: **7 / 10** (ako vas ne interesira ovo područje onda **2/10**)\n\nBih li preporučio/la predmet: **Da** (ako vas zanimaju mobilne mreže ili tražite jednostavan predmet, **Ne** u protivnom)",
      "votes": {
        "upvoters": [
          "JoKing",
          "[deleted]",
          "joj (poni)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "132070": {
      "poster": "Vedo",
      "content": "@Vedo#125098 Dakle, update za Elemente sustava automatizacije od profesora Kovačića povodom loših komentara za predmet (na ferwebu): \n\n![](assets/2021-01-28/00075.png)\n\nTako da, ne znam kako će izgledati predmet iduće godine. Upis na njega je i dalje na vlastitu odgovornost.",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "BMF",
          "BigTuna",
          "Filemon",
          "GranAutismo",
          "Mioch",
          "Nocna_smjena",
          "Svarog (Veles)",
          "[deleted]",
          "jlo",
          "jobi (azex)",
          "jocelyn",
          "netflix (seximan)",
          "stoja (AutističniAutomatičar)",
          "verratti (Rom Jova (Željezo/bakar))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "132072": {
      "poster": "BigTuna",
      "content": "@BigTuna#125119 EDITTT: Predmet je i dalje loš i ne preporučam zato kaj ima 300 slajdova od kojeg je pol toga smeće za koje mislite da treba znat a zapravo se ne ispituje. Budućim generacijama će vjerovatno bit malo bolje jer će imat naše stare ispite pa će znat kaj očekivat (ako se odluče upisat predmet, ali NEMOJTE ako vam nije zadnji na svijetu).",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "BMF",
          "Nocna_smjena",
          "Vedo",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139184": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "## Primjena elektromagnetskih valova u inženjerstvu(FER3) / Primijenjeni elektromagnetizam(FER2) \n\nEvo kako sam friško odslušao predmet da podijelim dojmove i preporučim predmet dok je svježe.\n\nNa predmetu je prvi ciklus posvećen prijenosnim linijama, a drugom ciklusu se prelazi na teoriju elektromagnetizma(gradivo elektromagnetskih polja zapravo) i pokazuje se da se rješavanje problema u elektromagnetizmu može zapravo svesti na problem prijenosne linije te se u sklopu toga obrade valovodi, nešto sitno mikrovalnih rezonatora i minijaturni uvod u teoriju antena. Profesor Hrabar je veliku većinu sati držao na faksu i predavanja su uvijek bila jako dinamična i popraćena mnoštvom pokusa koje je zabavno za gledati. Čovjek toliko dobro objasni teoriju prijenosnih linija da ih znate u bilo koje doba noći, a na krugovima nikom nije bilo jasno što se tamo događa i zašto se to uopće predaje. Hrabar zapravo kroz predmet usput prolazi sve pizdarije koje nikome zapravo nisu bile jasne od osnova elektrotehnike, a bile su nam samo tako servirane. Dodatan poticaj za upisivanje ovog predmeta u 5. semestru su polja: naime predavanja iz polja su ovaj semestar bila očaj i pohađanje ovog predmeta je jako jako jako olakšalo praćenje polja. Sam predmet je što se tiče matematičkog aparata na dijelovima poprilično zahtjevan, ali profesor inzistira na razumijevanju fizike i izvodi i baratanje jednadžbama mu ne znače puno, ali i matematiku pokaže na pravi način tako da bi se ekipa sa ZPMa trebala posramiti(tek tamo nam je pokazano značenje rotora i divergencije kako spada i pravilno objašnjen Stokesov i Gaussov teorem s matan3). Ove godine su se održala 2 labosa zbog korone(4 su bila planirana), a za labos nema nikakve posebne pripreme osim na komad papira skicirati nešto 10 minuta prije, a labosi se rade tako da je na dvojicu studenata 1 asistent ili profesor koji vam sugerira i pokazuje tako da možda neki drek i naučite. Također nema nikakvog glupog piskaranja i predavanja izvještaja iz labosa. Nakon ovog predmeta poželite ponovno slušati fiziku s prve i druge godine jer mislite da bi ovaj put možda nešto i shvatili koliko čovjek paralela sa svime vuče.\n\nSve u svemu, toplo preporučam predmet svim Eovcima neovisno o smjeru, može se puno toga općeg naučiti i malo proširiti slika generalno o elektrotehnici i inženjerskoj struci generalno, a za buduće ZKISTovce i elektroničare predmet je definitivno muss.\n\nTežina: **6 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Daho_Cro",
          "KR7 (Detective Schmosby)",
          "Kaiba (sour)",
          "Upforpslone",
          "ivicato",
          "jobi (azex)",
          "pitroid",
          "rhythm_controll",
          "spejs",
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139200": {
      "poster": "LUJXIV",
      "content": "elektromehanika?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139255": {
      "poster": "zeroth",
      "content": "@LUJXIV#139200 \n### **Elektromehanika**\n\nBio sam na tom predmetu u 4. semestru, dakle korona semestar i \"predmet za iznimno uspješne studente\". Predmet je bio donekle zanimljiv i dosta lagan, ali ne znam ako će biti isti sada kada je baš izborni predmet. Svaki/svaka dva tjedna mijenja se predavač od kojeg bismo dobili ili zadatak koji bismo trebali riješiti i poslati mailom rezultat, a na kraju tjedna objave ppt vezano za to gradivo (znači sam otkrivaš pa ti kažu kako), ili se objave ppt na temelju kojih trebaš skužiti kako riješiti zadatak. \n\nZa MI je svatko od nas 10 dobio poseban zadatak koji je trebalo riješiti i napisati nešto o tom zadatku što smo na kraju mailom slali(rok je bio bar tjedan dana, ali možda i dva). To nisu bili zadaci koji se mogu u potpunosti riješiti konačno, ja sam osobno koristio simulink za svoj zadatak. Za drugi ciklus smo bili podijeljeni u dvije grupe po 5 ljudi i dobili smo projekt koji smo trebali napraviti i \"mentora\". Treba malo sjesti i riješiti to, ali nije toliko teško. Mentor mojoj grupi je bio Ilijić i ne mogu se žaliti na svu pomoć koju nam je dao i sve što nam je objasnio. Neki zadaci koje smo dobivali kroz semestar su bili korisni jer su malo približili realan svijet, a projekt je trebao služiti kao jedno od prvih praktičnih stvari koje bismo napravili na faksu (but korona said NO). \n\nTreba napomenuti kako nema nikakvih problema ako si ljudi međusobno pomažu, štoviše, rekli su da to i trebamo raditi tako da su zadaće često bile puno lakše nego da ih radiš sam.\n\nTežina: 3/10\n\nKorisnost: meh/10\n\nBih li preporučio predmet: Ako imate slobodnog mjesta, dosta lagan za proći (nadano će takav biti i u šestom semestru)",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "LUJXIV"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139333": {
      "poster": "BigZ1",
      "content": "@BigZ1#139262\n\novdje sam pokrio alate sto se moze na 3.godini izabrat, buduci da je predmet donekle izmedju da netko vidi.",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "Kum"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139362": {
      "poster": "Kum",
      "content": "## Elektronički sustavi\n\nGradivo ovog predmeta i njegov smisao su jako dobri i korisni za bilo koga tko bi htio ići u nekom elektroničarskom/erijevskom smjeru. Dosta gradiva (većinom početak) se poklapa s gradivom fer2 predemta OEMI (ovo drži ZESOI ekipa). U biti cilj je razumijeti elektronički sustav (elektronički put signala kroz sustav) i njegove podsustave: senzori koji mjere nešto u nekom procesu, zatim analogna obrada dobivenog električnog signala, potom AD pretvorba toga u digitalizirani podatak koji ide u digitalnu obradu signala (u neki mikrokontroler ili procesor). Nakon toga signali idu na DA pretvornike kroz izlazna sučelja na aktuatore ili na prikladne prikaznike i sl. Cilj je ovakvo nešto znati i često su tu osnovnu blok shemu elektroničkog sustava prikazivali.\n\nUči se o senzorima, izvorima signala i njihovim spajanjima na sustav, šumu i smetnjama u elektroničkom sustavu i načinima njihova suzbijanja, uzemljenja, pojačalima (spojevi s operacijskim pojačalima su mi nekako ovdje bolje objašnjeni nego na ele2 i tek sam ih sad zaista naučio), pasivnim komponentama u elektronici (R, L, C), izvorima referentnog napona, adp-u (ukratko ponavljanje onog s ele2 i ulaženje u nove stvari), aktuatorima (uči se dosta o izlaznim elektroničkim sučeljima za upravljanje aktuatorima, o sklopkama tj tranzistorima u funkciji sklopki, ledicama i za što ih možemo koristiti, relejima, kako se upravlja induktivnim trošilima, nešto o istosmjernom motoru i njegovim upravljanjem H mostom i upravljačkim sklopvljem za njega i sl. stvari), izvorima napajanja elektroničkih sustava (od transformatora s mrežnog napona preko ispravljača i filtra do regulatora napona i trošila), te se na kraju uče sami regulatori napona.\n\nSve u svemu zanimljivo i korisno gradivo, po prvi put učim o dosta stvari ovdje (a prije sam samo čuo za njih), neke su stvari bolje objašnjenje, neke lošije. Predavanja su možda mogla biti bolja, dok su auditorne super i jako korisne. Nema pragova nikakvih kontinuirano, a labos (prva dva labosa u jednom terminu samo bili uživo) je bio najopušteniji labos ikad, Vasić pomaže svakom individualno i objašnjava sve teoretski prije bilo kojeg koraka. Radili smo u biti elektroničku vagu, od tenzometarskog mosta kao senzora, preko pojačala i aa filtra do ad pretvornika i prikaznika (ima još par stvari no to je ukratko ideja u biti). Umjesto ostatka labosa smo imali 2 domaće zadaće gdje smo trebali na stranicama proizvođača pronaći odgovarajuće elektroničke komponente i sl.\n\nIma taj famozni usmeni na kraju koji u biti nije na kraju tako strašan (bitno je da se na sva 3 pitanja odgovori kolko-tolko) jer je profesor na kraju ipak pošten. Predavanja su možda zaista mogla biti malo bolja ponekad, traži se sudjelovanje u nastavi jako često. Moj savjet je pisanje bilješki na predavanjima i dolazak na njih. Vole kad se javi s nekim pitanjima na mail i sl.\n\nTežina: **6-7 / 10**\n\nKorisnost: **8-9 / 10**\n\nBih li preporučio/la predmet:  **Da**",
      "votes": {
        "upvoters": [
          "BigBoi",
          "Bobinator",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "139518": {
      "poster": "LUJXIV",
      "content": "Koji izborni predmeti su najbolji sto se tice prakticnog rada",
      "votes": {
        "upvoters": [
          "GranAutismo",
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140938": {
      "poster": "madoxx",
      "content": "Inovacije i upravljanje tehnologijom? Jel ima itko ikakve informacije o tom predmetu? Ispiti, pragovi?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141570": {
      "poster": "Madlad",
      "content": "Ovo nije ni zajebancija kolko tragedija\n\n![](assets/2021-02-11/00039.jpeg)",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amon",
          "BigBoi",
          "BigZ1",
          "Daho_Cro",
          "GranAutismo",
          "Grdobina2000 (Grdobina)",
          "Kum",
          "MarokMarsci (Collapse Enjoyer)",
          "Mioch",
          "Red_Baron",
          "Skiv",
          "Svarog (Veles)",
          "Vedo",
          "Viks",
          "jobi (azex)",
          "srni-vilenjak",
          "tekamolo"
        ],
        "wtf": [],
        "tuga": [
          "Eterle",
          "Upforpslone"
        ]
      }
    },
    "141580": {
      "poster": "PikachuOnAcid (Kaneki kun)",
      "content": "@Madlad#141570 Jesu polja izborni predmet na fer3? Vidim da vas je tu manje neg na epe-u",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141581": {
      "poster": "zeroth",
      "content": "@PikachuOnAcid#141580 Nisu, ali je manje ljudi upisalo vjv zbog straha.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "GranAutismo"
        ]
      }
    },
    "141728": {
      "poster": "Skiv",
      "content": "@Madlad#141570 EMP kako su posijali tako i žanju",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141729": {
      "poster": "zeroth",
      "content": "@Skiv#141728 Realno EMP nije bio toliko težak koliko ga su se svi bojali. Dobivali smo zadatke svaki tjedan kao na osnovama i s time se bez problema moglo proći predmet. Predavanja generalno nisu služila ničemu ali ne mislim da bi drugačije bilo ni uživo",
      "votes": {
        "upvoters": [
          "Ak08 (obama)",
          "BigBoi",
          "EstebanVihaio",
          "Skiv",
          "Vedo",
          "deus_vult"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141744": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@Madlad#141570 klasik lmao",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141959": {
      "poster": "netflix (seximan)",
      "content": "Ima netko neki info o kolegiju Uvod u svemirske tehnologije? Vjv cu biti izignoriran haha, ljudi vise vole  r-smjer predmete i pricanje o njima",
      "votes": {
        "upvoters": [
          "GranAutismo",
          "jocelyn"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Klembuksna"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "141961": {
      "poster": "rolotex (brr)",
      "content": "Osnove mehatronike i osnove automatizacije moze netko napisat korisnost, tezina, dojam...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "141965": {
      "poster": "netflix (seximan)",
      "content": "@rolotex#141961 imas na vrhu threada",
      "votes": {
        "upvoters": [
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142035": {
      "poster": "LUJXIV",
      "content": "izrada elektroničkih prototipa?",
      "votes": {
        "upvoters": [
          "BigBoi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142041": {
      "poster": "Upforpslone",
      "content": "Sinteza sustava automatskog upravljanja?",
      "votes": {
        "upvoters": [
          "Apex"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142097": {
      "poster": "stoja (AutističniAutomatičar)",
      "content": "@Upforpslone#142041 Kao i većina izbornih 3. godine, novi predmet po FER3 programu. Koliko sam skužio temelji se na sintezi linearnih sustava upravljanja, tj. 90% gradiva je isto (1. sem diplomskog po FER2), trenutno sam ga odslušao. Klasičan automatičarski teoretski predmet, pomalo dosadnjikav i bezvezan na prvu, prof. Baotić drži jako dobra predavanja kao i inače. Generalno, ako se misliš bavit ikakvim upravljanjem poslije, bilo to pretvarača ili nz čega, svakako upisati. Nama je bio obavezan na diplomskom (automatika). Ispiti šablona, ali šablona gdje se zadatci ponavljaju, barem do sad, ne znači da će i u novom predmetu. Asistenti odlični. btw. predavanja nije bilo smisla gledati jer ih je jako puno bilo, a \"predavanja\" su zapisana u sveučilišnom priručniku, jedna od najbolje literature na faksu koju sam čitao. Valjda će pomoći nekome svježa informacija.",
      "votes": {
        "upvoters": [
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142139": {
      "poster": "zeroth",
      "content": "zna netko nešto za Računalne metode u modernoj fizici?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142155": {
      "poster": "Franjo_Ferdinand (Franjo Ferdinand)",
      "content": "## Automatsko upravljanje\nPredmet nešto lakši od onoga što sam očekiavo. Gradivo raznoliko, od općenitog do konkretnijih slučajeva, ima ga puno, ali korisno kao temelj za upravljanje sustavima.\n\nLaboratorijske vježbe relativno naporne, ponekad teže ponekad lakše, ali su opsegom gradiva dobra priprema za ispite.\n\nZa ispite najbolje vježbati stare zadatke, ima ih jako puno i stvarno su korisni, prezentacije su generalno opširne i previše nepregledne, u njima je najbolje tražiti specifične dijelove gradiva koji pomažu u razumijevanju zadataka.\n\nTežina: **7 / 10**\n\nKorisnost: **7 / 10**\n\nBih li preporučio/la predmet: **Obvezan**\n\n\n## Elektromehaničke pretvorbe energije\nNe.\n\nTežina: **∞ / 10**\n\nKorisnost: **NE / 10**\n\nBih li preporučio/la predmet: **NE, NE, NE,  ali obvezan**\n\n\n## Elektronički sustavi\nKolega @Kum je gore odlično detaljnije opisao pa ću ja samo ukratko.\n\nJedan od rijetkih predmeta gdje se osjećaš kao da učiš nešto korisno i realno. Gradiva ima dosta ali je većinom interesantno.\n\nLaboratorijske vježbe odlične, zanimljive i korisne.\n\nIspiti malo teži od očekivanja jer nije bilo previše zadataka za vježbu, također ima zloglasni usmeni ispit.\n\nPreporučam svakome tko se želi baviti mjerenjem ili projektiranjem elektroničkih sustava.\n\nTežina: **7 / 10**\n\nKorisnost: **9 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n\n## Kvantna računala\nUčio ukupno dva-tri dana, dobio 5.\n\nGradivo je više skup zanimljivih činjenica nego konkretan predmet, ali je koristan za promišljanje i vježbanje rada s matricama. Ilijić zanimljiv kao i uvijek.\n\nNa ispitima je dopušteno koristiti vlastite materijale.\n\nPreporučam svakome tko se zapitao \"Što bi bila Digitalna logika ali kvantna (i lakša)?\"\n\nTežina: **2 / 10**\n\nKorisnost: **3 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "Kum",
          "Vedo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Vedo"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "142169": {
      "poster": "Ilija123 (Mrnjotaur)",
      "content": "Jel zna itko išta o osnovama električnih i hibridnih vozila?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142179": {
      "poster": "Smeki153",
      "content": "Radionavigacija ili uvod u svemirske, što je lakše?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142187": {
      "poster": "spejs",
      "content": "@LUJXIV#142035 mislim da se to prvi put drzi, ali definitivna preporuka posto je to Kroisov predmet.",
      "votes": {
        "upvoters": [
          "MarokMarsci (Collapse Enjoyer)",
          "ivicato"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142197": {
      "poster": "ZvonkoSisoje",
      "content": "Jel itko bio na praktikumu elektronickih elemenata i sklopova?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142201": {
      "poster": "kinderlada (Javor)",
      "content": "@ZvonkoSisoje#142197 je, što te zanima",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142282": {
      "poster": "KR7 (Detective Schmosby)",
      "content": "## Primjena elektromagnetskih valova u inženjerstvu (FER3) / Primjenjeni elektromagnetizam (FER2)\nKolega @Grdobina2000 je gore dao detaljan opis predmeta, ali pišem svoj review kako bih dodatno potaknuo kolege da upišu ovaj predmet. Profesor Silvio Hrabar i PEVUI/PEM su skriveno blago ovog fakulteta. Kada bi svaki predmet bio upola dobro organiziran kao ovaj FER bi bio svjetska elita. Gradivo kreće od prijenosnih linija koje u roku od par tjedana znate bolje od tablice množenja (ponekad jednostavno zaboravim koliko je 7*8), kasnije se kreće na elektromagnetizam gdje profesor cijelo vrijeme povlači analogiju s prijenosnim linijama i kako se više manje sve da fizikalno interpretirati pomoću njih. Nakon ovog predmeta mogu reći da sam shvatio vektorsku analizu koju sam na MATAN3 naštrebao za ispit i razumijem Maxwellove jednadžbe koje su mi prije ovog kolegija predstavljale nešto nemoguće i tabu. Posebne literature za ovaj predmet nema, ali uz Hrabarova predavanja nije ni potrebna. Svako novo poglavlje započne pokusom gdje profesor pokušava intuitivno objasniti što se to upravo dogodilo, zašto su rezultati tog pokusa takvi kakvi jesu... Nakon što dobijete fizikalnu sliku, ukratko pokaže da nam je intuicija na mjestu jer matematika štima. Nema puno matematičkih izvoda, a onih koji ima su nužni i jednostavni (jednostavni samo iz razloga što ih profesor učini jednostavnima). Pismeni ispiti su lagani i više ispituju koliko dobro razumijete gradivo, ali zna se pojaviti par zadataka gdje je samo slijepo uvrštavanje u gotovu formulu. U konačnu ocjenu ulazi samo usmeni ispit koji je zapravo individualan razgovor s profesorom. U sat vremena prođete zajedno kroz cijelo gradivo, ako vam neki dio gradiva nije sjeo, odmah ga pojasni i nastavite dalje. Sve u svemu gradivo nije lagano i treba vremena da vam se sve posloži u glavi. Ako je na nekom predmetu potreban kontinuiran rad, onda je to ovaj. \n\nTežina: **8 / 10**\n\nKorisnost: **10 / 10** \n\nBih li preporučio/la predmet: **Da**\n\n\n## Osnove energetske elektronike (FER3) / Osnove učinkse elektronike (FER2)\n\nVrlo jednostavan i iskreno malo dosadan predmet. Proučavaju se osnovni radovi sklopova svih vrsta pretvarača (AC-AC, AC-DC, DC-AC, DC-DC). Gradivo ovog predmeta ako vas interesira savladate jednostavnim guglanjem tih pretvarača. Ispiti su se sastojali od doslovno identičkih zadataka kao na auditornim vježbama, samo s drugim brojevima (ponekad čak i ne). Predmet je obavezan na većini smjerova na diplomskom studiju te sam ga iz tog razloga upisao sad na preddiplomskom i iskreno drago mi je da jesam jer onda kasnije mogu nešto zanimljivije odabrati.\n\nTežina: **2 / 10**\n\nKorisnost: **4/ 10**\n\nBih li preporučio/la predmet: **Više DA nego NE**\n\n\n## Kvantna računala\n\nLagan i zanimljiv predmet. Predaje ga profesor Saša Ilijić što je veliki plus jer ga je uvijek gušt slušat. Daje kratki uvod u svijet kvantnih računala. Prvi ciklus je više upoznavanje s kvatnom mehanikom i načinom zapisa koji se koristi u kvantnoj mehanici. Drugi ciklus je više osnove rada takovog računala, podsjeća malo na digitalnu logiku.\n\nTežina: **2 / 10**\n\nKorisnost **3 / 10** - vjerojatno se nećete baviti time u budućnosti (ko zna)\n\nBih li preporučio/la predmet: **DA**",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "Kaiba (sour)",
          "srni-vilenjak"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142290": {
      "poster": "LUJXIV",
      "content": "@LUJXIV#63619 pas mater trebo sam ga upisat",
      "votes": {
        "upvoters": [
          "BigBoi",
          "Grdobina2000 (Grdobina)",
          "KR7 (Detective Schmosby)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Grdobina2000 (Grdobina)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "142401": {
      "poster": "Skiv",
      "content": "## Primjena EM valova u inženjerstvu\nKolege iznad su sve rekli.\n\nTežina: **7 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Osnove obradbe signala\n**Disclaimer:** Predmet se prvi put predavao ove ak. godine (2020/21) i zapravo se cijeli formirao tek tijekom semestra. Također, bilo nas je samo 6. Od toga 3 erasmusovca od kojih je jedan otišao sa razmjene usred semestra zbog korone.\n\nPrema riječima profesora, predmet je osmišljen kao mostni kolegij za DOS. Na predmetu su uči o rastavu signala u bazne funkcije, različitim transformacijama (Fourier, Z, Laplace, malo DCT i sl.), sustavima i njihovim željenim svojstvima i na kraju se ukratko opiše FFT. Predmet podsjeća na neki SIS-lite ali je više okrenut realnoj primjeni. \n\nPredmet je držao prof. Petković sa ZESOI-a. Kao predavač bio je solidan, a za ostale stvari spreman izaći u susret. Atmosfera na predmetu više opuštena nego neka stroga disciplina. Meni osobno, relativno malo stresa.\n\nPredavanja su uglavnom bila teoretski orijentirana, i meni osobno malo naporna za pratiti, ali za pisani i usmeni dio ispita dovoljno je samo pohvatati formule, neke osnovne definicije i osnovno razumijeti neke koncepte.\n\n6 Python bilježnica čini laboratorijske vježbe. Svaku čini teorijski uvod, programski primjeri i na kraju neki zadatci koji budu slični tim primjerima. Za njihovu izradu treba odvojiti nešto vremena ali meni se nisu učinile osobito zamršene.\n\nSvaki tjedan je išla domaća zadaća, sve zajedno njih 10. One su najbitnije za ispit jer se na ispitu ponavljaju vrlo slični zadaci. Ove zadaće se čine kao smor ali njihova točnost se nije ocjenjivala, bitno je da se barem pokušaju riješiti. Na predavanju nakon roka za predaju profesor bi objasnio ako je nešto bilo nejasno.\n\nMI i ZI nose po 30 bodova. Bude 5 zadataka izvučenih iz DZ. Dovoljno je proći kroz njih prije ispita i to je više manje to. Za usmeni postoji popis 22 eliminacijska pitanja ali, kako je predmet išao prvi put, nas je pitao samo po tome. Na usmenom smo dobili 2 random pitanja, na papiru pripremili odgovor i onda s njime popričali.\n\nSve u svemu, predmet na kojem će se ponešto naučiti i koji ne zahtjeva veliki napor.\n\nTežina: **6 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "Jezza (Clarkson)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142403": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "@netflix#141959 \n### Uvod u svemirske tehnologije\nPredmet se malko promijenio ove godine sto se tice organizacije i gradiva, koliko je doslo do mene nece biti Zavrsnog nego ce se napisati neki rad i (i bit ce manjih zadaca gdje tipa trebas izracunati orbitu i gotov si s time za pola sata). Gradivo samo po sebi je zanimljivo (ako te iole zanima podrucje svemira i satelita, teme su tipa orbite, orijentacija i navigacija satelita, komunikacija za Zemljom) i nije tesko. Meni je bio gust, za opustiti se i ocjene su bile visoke. Profesori se stvarno trude i ako ti nesto nije jasno posaljes predavacu mail i odgovaraju brzo. Vidi se da im je stalo do predmeta i nisu zakomplicirali zivot studentima.\n\nTežina: **2/10**\n\nKorisnost: ako te područje zanima, **10/10**, ako ne nego samo trazis nesto lagano, **7/10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Filemon",
          "Joskica",
          "Kaiba (sour)",
          "PeanutMaster1801 (caca)",
          "Red_Baron",
          "Skiv",
          "Svarog (Veles)",
          "jocelyn",
          "netflix (seximan)",
          "steker",
          "tekamolo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142413": {
      "poster": "ZvonkoSisoje",
      "content": "@kinderlada#142201 dojmovi, koliko toga se radi prakticno, jel worth it za nekog tko se misli dalje baviti analognom elektronikom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142575": {
      "poster": "Eterle",
      "content": "@ZvonkoSisoje#142197 \n## Praktikum elektronickih elemenata i sklopova\npredmet se trebao sastojati od labosa svaki tjedan na kojima se korak po korak mjere karakteristike i zatim radi simulacijski model tranzistora, onda se simulira jednostavno pojacalo (spoj zajednickog emitera iz ELE1) s tim tranzistorom i taj sklop slozi IRL i izmjeri da se sve slaze sa simulacijom. Teorija koja se obradjuje na predavanjima sluzi za upoznavanje s onim sto se radi na labosima.\n\nE sad, zbog korone i potresa se nazalost nista od toga nije dogodilo. Imali smo kratka online predavanja (cesto krace od 45 minuta) po jednom tjedno koja je drzao Poljak, zanimljivo je i ugodan je za slusat. Labosi su se sveli na dva velika labosa koja smo radili od kuce i imali po dva tjedna za napraviti. Bili su naporni za napraviti (za prvi mi je trebalo tri dana, za drugi malo krace) (jer su zapravo bili po tri labosa zbijena u jedan), ali jako zanimljivi - dobili smo mjerenja tranzistora i prema uputama trebali odraditi cijeli simulacijski dio originalne zamisli labosa. Upute su bile malo smotane, ali shvatljive. Labosi su nosili 70 bodova.\n\nPismeni medjuispit i zavrsni iz ovog predmeta ne postoje, tu je samo usmeni zavrsni (nosi 30 bodova). Dobili smo listu od 17 jednostavnih pitanja tjedan-dva prije usmenog, odrzao se online u grupama po 5-6 ljudi i jako je opusteno bilo. Poljak je isao u krug i svakome postavio po dva pitanja sa liste, i bio JAKO liberalan s ocjenjivanjem (mislim da od 20ak ljudi samo troje nije dobilo 30/30, nego 25/30 bodova).\n\nSve skupa, bio je jedan od najlaksih predmeta ovaj semestar, jako opusteno organiziran, meni najzanimljviji od svih, jako lijepo zamisljen ali nazalost zbog uvjeta napola izveden. Ljudi sa ZEMRISa su jako susretljvi i opusteni.\n\nAko se mislis baviti dalje analognom elektronikom, definitivno preporucam.\n\nTezina: **2/10**\n\nKorisnost: **9/10** ako te zanimaju simulacije i analogna elektronika, inace **6/10**\n\nBih li preporucio predmet?: **Da**",
      "votes": {
        "upvoters": [
          "BigBoi",
          "ZvonkoSisoje",
          "jobi (azex)",
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142654": {
      "poster": "LUJXIV",
      "content": "@zeroth#115319 jesi slao mail orsagu kao sto je predlozio helot? ja sam mu pocetkom ovog tjedna poslao al nije jos odgovorio",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142759": {
      "poster": "Al_Pakino (Al Pakino)",
      "content": "@LUJXIV#142654 slao sam mu ja nekad ranije mail\n\n![](assets/2021-02-14/00039.jpeg)",
      "votes": {
        "upvoters": [
          "BMF",
          "KingGeedorah (King Geedorah)",
          "LUJXIV",
          "helot"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142767": {
      "poster": "LUJXIV",
      "content": "@Al_Pakino#142759 znaci ne mijenja se nista zbog korone?",
      "votes": {
        "upvoters": [
          "Al_Pakino (Al Pakino)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142779": {
      "poster": "helot",
      "content": "@LUJXIV#142767 \n\nAko tijekom prošlog ljetnog semestra kada smo bili u lockdownu nije bilo online očigledno da neće promijeniti. Kao što je kolega rekao, ako je Orsag sam rekao da će biti praktično s 3d print+dynamixel, znači tako će i biti, neće stavljati neke simulacije s matlabom/ROS-om (npr što sam ja imao prije par godina URDF+matlab pa onda kasnije matlab+mindstorms).\n\n S obzirom da će vas biti 3-5 po grupama, možda je najbolje da se podijelite da je netko fizički sa motorima/3d printom dok su ostali udaljeno spojeni i riješavaju sofware, makar evo iz iskustva od prošlog semestra ako uživo nemreš prisiliti ljude da nešto rade onda ćeš imati relativno loše rezultate. Ne opravdavam ili ispričavam već samo govorim kako bih ja napravio i jesam napravio ali eto s lošijim rezultatima, sada riješavam zaostatke za dipl. projekt radi situacije kakve je, kolege koji su pozitivni te fizički nemreš skupiti dijelove od njih onda ulete seminari, rokovi i nerazumni nosioci drugih predmeta koji smatraju da postoji samo njihov predmet i klasičan odgovor \"postoje ljetni/jesenski rokovi\". Ako išta Orsag je izašao ususret i maksimalno produžio rok i izvan službenih okvira, to je za seminare/diplomske projekte te iskreno sumnjam da je išta drugačije za predmete koje on vodi (izuzev laboratorija koji imaju fiksan datum odvijanja tipa Osnove robotike). \n\nKolege  koji su slušali prošle akademske će bolje znati reći kako je bilo s rokovima/količinom uloženog vremena, znam da je Hrabar skupljao 3D modele i meni ih šibao da ih isprintam/ispravim i tu su grupe čekale tjedan dana dok nije sve isprintano/ispravljeno, to samo govorim da imate na umu kako da planirate vrijeme za predmet.",
      "votes": {
        "upvoters": [
          "Al_Pakino (Al Pakino)",
          "LUJXIV"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142790": {
      "poster": "netflix (seximan)",
      "content": "@helot#142779 a kakvi su ispiti?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142795": {
      "poster": "helot",
      "content": "@netflix#142790 \n\nne znam kakvi su bili u drugim generacijama, ne vidim da na materijalima ima išta pametno za ispite niti ja nemam išta od starih materijala tako da je bolje pitati kolege prije. Ono što sam ja pisao je nosilo nekih 20 bodova i vidim da se to nije promijenilo bar po prezama, bilo je na zaokruživanje i dopunjavanje iz prezentacija znači neke stvari iz blendera, VRML i dio iz knjige osnove robotike i obrade slika, ništa složeno, samo pročitaš preze.\n\n Taj ispit je držao Orsag prije tih par godina kada sam ja to slušao, s obzirom da je fokus na praktičnom dijelu, kao i prije to je samo bilo da se provjeri jeste pratili predavanja i da imate 4 ili 5 za kraj, ovaj usmeni kaj vidiš je doslovce pokazivanje robota dal radi tj vašeg projekta što ćete raditi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142803": {
      "poster": "netflix (seximan)",
      "content": "@helot#142795 najs tenks",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143155": {
      "poster": "Viks",
      "content": "znate li sto o audiotehnici?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143208": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "Optoelektronika mi se čini zanimljivom. Ima li još tko da ide? Ako je Babić na predmetu vjerojatno neće biti teško.",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143212": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@thelonewanderer#143208 znam da nas troje(i ti 4ti) trenutno ide",
      "votes": {
        "upvoters": [
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143228": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "@Grdobina2000#143212 Ako me referada pusti radi kolizije, nadam se da bude.\n\nBabic je rekao da ce labosi zapravo vecinski biti demonstracije, a kada je rekao da ce biti i rastavljenog hw-a za vidjeti.. well.. I'm sold 😂",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143235": {
      "poster": "Daho_Cro",
      "content": "### Programiranje i simuliranje robota (ex vještina ROS)\nNe bih preporučio onima koji se ne misle baviti robotikom kasnije, ali oni koji misle ovaj predmet MORAJU upisati, a vjerojatno će vas mentori tražiti da ga upišete. Predmet pruža korisno znanje o tome kako se danas programiraju roboti, kako se ponašaju u novom prostoru i okruženju, kako ih navigirati itd. Prva je godina da se predmet održava i smatram da je sve bilo korektno odrađeno. Predavanja su snimljena, jednom tjedno su održavane online konzultacije. Predmet ima 8 labosa koji su u jednu ruku naporni, a u drugu korisni jer stvarno naučite dosta toga. Programira se u Pythonu i C++ pa ljudi koji imaju iskustva sa navedenim jezicima će sigurno lakše odraditi labose. I sam asistent je rekao da se na tržištu rada konstantno traže ljudi sa znanjem koje pruža ovaj predmet pa se isplati potruditi. Na kraju je dosta ljudi imalo dobre ocjene i mislim da je prolaznost na kontinuiranoj nastavi bila veoma visoka tako da budućim automatičarima svakako preporučam ovaj predmet.\n\nTežina: 5/10\n\nKorisnost:  10/10\n\nBih li preporučio/la predmet: Da\n\n### Elementi sustava automatizacije\nRealno predmet i nije toliko težak sam po sebi koliko je neorganiziran pa ga to čini težim, što je stvarno žalosno jer gradivo koje se obrađuje je takvo da predmet ima potencijal biti jedan od najzanimljivijih na fakultetu. Od literature prof. Kovačić je dao jednu ogromnu knjigu koja je stvarno preopširna i nikako ne preporučam učiti iz nje. Od ostale literature imate 3 prezentacije od 200tinjak slajdova u kojima se ni za jednu lekciju ne zna kada počinje, a kada završava i uz to imate 27 zadataka za vježbu koje su dali tek za zimski ispitni rok - u prijevodu: literatue nema, snađite se. Uz sve to na predmetu imate dva asistenta od čega je jedan krasan i stvarno vam hoće objasniti i pomoći dok je drugi totalno nezainteresiran i ne računajte na njega (naravno možete pretpostaviti kojeg asistenta ćete viđati češće na labosima i na ostatku predmeta). Način bodovanja je izrazito čudan; kontinuirana nastava ima 120 bodova i morate imati 51 bod da biste mogli na usmeni dok rokovi imaju 100 bodova i prof. Kovačić čisto svojom dobrom voljom odlučuje tko može na usmeni, a tko ne. Iako je profesor najavio drastične promjene za iduću godinu, ne bih preporučio predmet jer vam ne treba ta razina stresa i brige da do samog kraja ne znate što i odakle učiti.\n\nTežina: 6/10\n\nKorisnost:  2/10\n\nBih li preporučio/la predmet: Ne",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)",
          "Upforpslone",
          "Vedo",
          "[deleted]",
          "netflix (seximan)",
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143602": {
      "poster": "Makrovalni_Hladnjak",
      "content": "@thelonewanderer#143208 Idem i ja. Čini se zanimljvo po tome što sam vidio na stranici predmeta. Trebalo bi bit i malo kvantne fizike tu hehe",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143616": {
      "poster": "Kobe",
      "content": "Je li zna netko kakav je predmet \"tehnologija u medicini\"?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143642": {
      "poster": "Widlar",
      "content": "@Kobe#143616 Lagan i zanimljiv, dobijes pregled nekih osnovnih uredaja i metodologija koristenih u medicinskoj tehnologiji (npr. ultrazvuk, pacemakeri, metode oslikavanja tijela i sl.). Lagano za imat 4 ili 5.",
      "votes": {
        "upvoters": [
          "Daho_Cro",
          "Kobe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143644": {
      "poster": "Kobe",
      "content": "Super, a koliko ce mi vremena oduzeti po tjednoj bazi?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143648": {
      "poster": "Widlar",
      "content": "@Kobe#143644 2 sata predavanja tjedno na kojima ne moras bit. Jedino sto je bilo obavezno su bila 2 ili 3 predavanja od strane ljudi koji rade u firmama koje se bave tematikom iz predmeta, ako se ne varam to je bilo pred kraj semestra. Za ispit se moze naucit 2-3 dana prije iz prezentacija.",
      "votes": {
        "upvoters": [
          "Kobe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143655": {
      "poster": "Kobe",
      "content": "Ee super, hvala 😊",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143768": {
      "poster": "maverick",
      "content": "Ima netko ikakve informacije za kratkodometne radijske sustave?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "144404": {
      "poster": "Kobe",
      "content": "a kakvi su \"komunikacijski sustavi\" (obavezan predmet)?",
      "votes": {
        "upvoters": [
          "Ilija123 (Mrnjotaur)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "146975": {
      "poster": "Ilija123 (Mrnjotaur)",
      "content": "@Kobe#144404 sto su mi kolege od ranijih godina govorile(drukcije se predmet zvao) isto lagan predmet na kojeg nisu trošili previse vremena.",
      "votes": {
        "upvoters": [
          "Kobe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "197073": {
      "poster": "Jure (bidonitez)",
      "content": "može netko podijeliti iskustva za elektroenergetski sustavi 1?",
      "votes": {
        "upvoters": [
          "mimara"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "216965": {
      "poster": "brucosica",
      "content": "Može li netko ukratko opisati ove predmete: Elektronički sustavi, Mikro i nano elektronički elementi, Osnove elektronike i Praktikum elektroničkih elemenata i sklopova? Planiram dalje na modul Elektronika, a za projekt radim projektiranje čipova. Što bi mi od ovih predmeta bilo najkorisnije ili ako imate neki drugi prijedlog.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "216970": {
      "poster": "zeroth",
      "content": "@brucosica#216965 \n\nElesus @Kum#139362 \n\nKoliko ja vidim, osnove elektronike je elektronika 1 za računarce koji ju nisu slušali",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217020": {
      "poster": "brucosica",
      "content": "@zeroth#216970 Tako se i meni čini po sadržaju predmeta pa mi nije jasno zašto je ponuđen kao izborni na elektrotehnici u 5.semestru.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "217031": {
      "poster": "Kum",
      "content": "@brucosica#217020 Svi su izborni (i s E i R smjera) na jednom mjestu, ali naposlijetku mentor odobrava predmete tako da ti mentor vjerojatno ne bi dozvolio upis tog predmeta svakako",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Elle"
        ],
        "tuga": []
      }
    },
    "217079": {
      "poster": "zeroth",
      "content": "@Kum#217031 Nije sve mentore briga što se upisuje",
      "votes": {
        "upvoters": [
          "AK10 (endyyyy)",
          "BigBoi",
          "Daho_Cro",
          "jobi (azex)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218707": {
      "poster": "Vedo",
      "content": "## Osnove automatizacije\n\nAko se namjeravite baviti automatizacijom, ovo pod mus upisati. Predmet daje poprilično širok uvod u svijet automatizacije, svega se dotakne - programiranje PLC-ova kroz seminare/labose (programiranje u TIA Portalu, programiranje makete pokretne trake, simulacija trake za sortiranje, implementacija human-machine interface-a), nešto o komunikacijama (PROFINET, PROFIBUS), upravljanje asinkronim motorima u STARTER-u i TIA Portalu, uvod u sigurnosne mehanizme u automatizaciji itd. Pragovi na MI i ZI su malo zeznuti jer iznose 50%, a ispiti nose 20 bodova što znači da morate imati barem 10 bodova na ispitima. Ima 3 seminara (programska) na predmatu, a treba naglasiti da je 1. seminar dosta teži od drugih jer je zadatak jako opširan i potrebno je koristiti STL (jako slično assembly jeziku) pa to studentima teško pada, uključujući i meni. Prvi ciklus je kudikamo teži od drugog jer je više baziran na programiranju logike PLC-a, dok je drugi više baziran na HMI-u i STARTER-u. Predavanja su 2h tjedno, uz to da zadnja 2 tjedna u semestru nema predavanja. Sve u svemu dosta zanimljiv i koristan predmet! Uzme puno vremena, ali nikad nisam imao osjećaj poput \"što mi je ovo trebalo u životu...\". Dapače, kad se konačno složi program i isproba na maketi i radi bez problema, osjećaj da ste nešto korisno napravili je nenadmašiv. \n\n\nTežina: **9-10 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Osnove upravljanja električnim strojevima\n\nSuper zanimljiv predmet. Ovo je puno jednostavnija verzija EPE-a s naglaskom na upravljanju strojeva. Predmet se bavi upravljanjem istosmjernih i asinkronih motora, bez korištenja nekih \"čudnih\" algoritama i metoda (tipa nema Dahlanderovog spoja ili upravljanje paralelnih i serijskih istosmjernih motora). Znači samo upravljanje nezavisno uzbuđenih istosmjernih strojeva (otporima, naponom, tokom) i upravljanje asinkronim strojevima (U/f). Predavanja su ponovno 2h tjedno - 1h teorija i 1h auditorne. Labosi su predobri. Baš ove godine su profesori i asistenti složili kutije za spajanje na motore u kojima se nalaze svakakve komponente od frekvencijskih pretvarača pa do osigurača koje štite kutiju od kratkih spojeva. Veliki plus je i taj što labose vode vrlo ljubazni asistenti, ne znam je li postoje smireniji i pristupačniji ljudi na faksu od njih. Labosi za asinkrone strojeve su mi isto tako genijalni - 3 vježbe (po 4h) gdje samostalno (okej, i uz pomoć asistenta) kroz upute učite raditi u STARTER-u i istražujete mogućnosti programa i frekvencijskog pretvarača. Nakon tih triju vježbi slijedi provjera za 15 bodova gdje onda profesorica Kutija ocjenjuje vaše znanje _parametriranja_ tog frek. pret. kroz zadatke koji su vrlo slični onima na prijašnje tri vježbe - ništa pretjerano teško. MI i ZI nemaju pragove, nose 20 bodova. Usmeni pak... profesorica Kutija dosta cjepidlači, ali to je uredu jer taj usmeni služi za provjeru upravo tih sitnih detalja koji se ne provjeravaju na pismenim ispitima.\n\nTežina: **5 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Osnove električnih i hibridnih vozila\n\nPošto me zanima motorsport i automobili ovo sam morao upisati. Makar predmet izgleda kao sprdancija i služi samo za lagani prolaz, neću vas lagati, dosta sam toga naučio što sam prije slabo znao. Predmet se bavi svačime - korisnostima električnih automobila, njihovim utisku na okoliš, kako projektirati bateriju, vrste baterija, kako se baterija puni, zašto se koristi kWh mjerna jedinica (ili Ah u baterijama) i što to zapravo znači itd. Puno onih stvari za koje sam prije otprilike čuo, na ovom predmetu sam sada zabetonirao u mozgu. Predavanja su zanimljiva jer prof. Vražić i Pandžić znaju zanimljivo predavati. Imali smo jedan labos i to je bio neki sitni izračun punjenja i pražnjenja baterija i crtanje grafova u Matlabu, tek nakraju semestra. Ispiti su iskreno dosta lagani i temelje se na tih par auditornih. Usmeni - kod profesora Pandžića najbolje se ne javiti odmah po završetku pisanja onog pismenog djela usmenog na papiru. Prvih 10-15 studenata cjepidlači dok mu ne dosadi, a nakon njih krene maltene djeliti bodove. \n\nTežina: **2 / 10**\n\nKorisnost: **6 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Komunikacijski sustavi\n\nNikako mi se ne sviđa način predavanja. Predmet mi je preapstraktan. Previše je tu koncepata koje je jako teško zamisliti u glavi i da to zapravo radi. Fali realnih primjera kako pojedini dio komunikacijskog sustava radi i kako je realno izveden. Cijelo vrijeme sam imao osjećaj da mi fali nekakvo predznanje nekog drugog predmeta kojeg nismo imali jer kad kod (a to je bilo često) je profesor/profesorica nabrajao i opisivao neke primjere, nisam imao pojma o čemu govori, mogli su komotno govoriti to na turskom i meni bi bilo svejedno. Detalja i detaljčića na prezentaciji ima kao pljeve - ne vidim razlog za navođenjem svih mogućih protokola, oznaka standarda i pizdi materina kad po gašenju prezentacije ću istog trena to sve zaboraviti. Ponekad na ovom predmetu od šume ne vidite stablo. Moram navesti i to da me skoro šlak strefil kad sam na prvom predavanju vidio gradivo VIS-a. Kad mislite da će vam auditorne malo razbistriti cijelu priču, za auditorne je odabran najdosadniji čovjek na svijetu, a kod njega se bome i nezna kad zadatak završava, a kad započinje. Sve u svemu, predavanja su mi osobno bila beskorisna. Ispiti su hvala bogu bili lagani i hvala profesorima na tome.\n\n90% gradiva je urlaona (u lošem smislu), dok je 10% koliko toliko zanimljivo. OFDM je dosta interesantan i važan koncept te baza velikog broja komunikacija. That's about it.\n\nTežina: **6 / 10**\n\nKorisnost: **1 / 10**\n\nBih li preporučio/la predmet: **Obavezan**\n\n## Inovacije i upravljanje tehnologijom\n\nRazočarenje. Pobjegnem od INZEKO1 da nemoram pisat seminar od 2000 riječi i tu me dočeka seminar od 4000, a uz to sam imao i završni projekt za pisati. Ne vidim kako je ovo predmet od 2 ECTS-a. Ima više posla na njemu nego na  električnim i hibridnim vozilima, a on nosi 5 ECTS-a. Kad prolazim kroz prezentacije, shvatim da je cijeli predmet lupanje prazne slame - jedne te iste stvari se ponavljaju u malo drugčijem kontekstu i sve nekakve gluparije i imam dojam da se tu puno priča i baljezga, a ništa se zapravo ne napravi, kao i u politici. Samo neka teorija bez nekih konkretnih primjera. Gradivo je toliko dosadno i nepotrebno kao i kod svakog transverzalnog jebenog šugavog predmeta i bio bih najsretniji kad bi se ta beskorisna smeća od predmeta ukinula i ta 2 pišljiva ECTS-a pridjelila normalnim predmetima. U trenutku pisanja ovog osvrta, još ne znam jesam li prošao predmet ili ne jer gospoda još uvijek ocjenjuju seminare, hvala bogu imaju i prag od 10/40. Jbg, treba pročitati 100 identičnih tekstova, a da ne poludiš. Isto tako, postoje bodovi za aktivnost i praćenje predavanja je \"obavezno\". \n\nPreporučam da ne upisujete ovo, a bome ni UKAK jer sam čuo da je još veće smeće, ali hvala bogu ima INZEKO2 gdje sada nema seminara i mislim da je to čak najbolji odabir.\n\nTežina: **previše / 10**\n\nKorisnost: **0 / 10**\n\nBih li preporučio/la predmet: **Apsolutno ne**\n\n## Završni projekt\n\nMentor mi je Damir Sumina, područje automatizacija. Dao je četiri teme na odabir pa smo kolega @BigTuna i ja odabrali rad u Tecnomatix Plant Simulation-u, program za simuliranje postrojenja. Moram nas malo pohvaliti, ali prvi smo na faksu koristili taj program :P. Svatko je radio svoje postrojenje. Okej je program, malo je komplicirano ga naučiti jer fali youtube video-a, tutoriala, materijala i prijašnjih radova i bilo je potrebno se malo živcirati, ali nekako sam uspio složiti svoje postrojenje za proizvodnju mobitela. Uz to, bilo je potrebno napisati i seminar. Napisao sam ga kao blagi tutorial kako koristiti program i kao tijek slaganja postrojenja, od 54 stranica. Mentor Sumina je dosta zahtjevan po pitanju kvalitete seminara tako da treba paziti na pravopis, ali nakon što mu prvi puta pošaljete da malo pogleda dosadašnje pisanje, on vam sve pregleda i označi ama baš sve greške. Bez problema se dobije ocjena izvrstan.\n\nTežina: **7 / 10**\n\nKorisnost: **10 / 10**\n\nBih li preporučio/la predmet: **Obavezno**",
      "votes": {
        "upvoters": [
          "BBlock",
          "BigTuna",
          "EstebanVihaio",
          "GranAutismo",
          "Vishnjevac",
          "[deleted]",
          "[deleted]",
          "nairobi (light_grandma)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "BigTuna"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "218720": {
      "poster": "zeroth",
      "content": "@Vedo#218707 inžeko2 je u korona semestru imao seminar",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218725": {
      "poster": "Vedo",
      "content": "@zeroth#218720 Da, ali ovaj semestar ga nije bilo koliko sam čuo",
      "votes": {
        "upvoters": [
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218766": {
      "poster": "Kaiba (sour)",
      "content": "## Osnove električnih i hibridnih vozila\n\nKolega @Vedo je sve lijepo rekao. Easy predmet, nauči se zanimljivih stvari. Za svaki slučaj zaobići Pandžića na usmenom, pošaljite mail i odite kod Vražića, vjerojatno najugodniji usmeni ikad.\n\nTežina: **2 / 10**\n\nKorisnost: **5 / 10** (Realno nije nešto koristan, više je motivacija za one koji žele znat više o EV i baterijama)\n\nBih li preporučio/la predmet: **Da**\n\n## Uvod u svemirske tehnologije\n\nOpet jedan lagan predmet sa zanimljivim temama, može se puno naučiti, a realno ne mora se skoro ništa naučiti da bi se imalo 4 ili 5. Polaže se kroz 4 zadaće i jedan poster koji se radi u grupama. \n\nTežina: **3 / 10**\n\nKorisnost: **6 / 10** \n\nBih li preporučio/la predmet: **Da**\n\n## Moderna fizika i primjene u elektrotehnici\n\nOve godine držali su prof. Horvat (sa fizike, čovjek je u penziji i dolazio nam je predavat), prof. Hrabar i prof. Šipuš. Ni vrit ni mimo - fizika koju predaje Horvat je preteška za shvatiti, Hrabarov i Šipušev dio (metamaterijali i sl.) je bio zanimljiv za slušati, ali ne mogu reći da sam nešto puno naučio. Ali s druge strane, predmet nema ispita, polaže se kroz projektić koji se napravi u suradnji s jednim od 3 profesora, tako da je gradivo s predavanja za tebe ako želiš naučit o tome, a ako ne želiš ne moraš.\n\nNe preporučam da se upisuje ako niste slušali PEM/PEVUI jer će vam bit jako apstraktno.\n\nTežina: **3 / 10**\n\nKorisnost: **3 / 10**\n\nBih li preporučio/la predmet: **Da i ne** (Da ako želite easy i ugodan predmet, ne ako želite nešto korisno)\n\n## Komunikacijski sustavi\n\nNema mi smisla pisati o obaveznim predmetima, al htio bi dati jedno drugačije mišljenje od kolege @Vedo. Meni osobno jako zanimljiv predmet, zanimaju me komunikacije i ovo mi je bio super uvodni predmet u to sve skupa. Prva 3 tjedna je gradivo teorije informacija, što su valjda morali staviti negdje pa su stavili tu. U tom dijelu ima nešto ViSa, ali ništa previše niti ništa teško, i ako vas to ne zanima daju se zadaci naučiti šablonski. Onda ide dio sa prijenosom, prijenosnim medijima, modulacijom i OFDM-om, što je meni bilo najzanimljivije jer se sve koristi u praksi, i zadnji dio gradiva su komunikacijske mreže, što je zapravo hrpa teorije koju ne treba nešto detaljno učiti, više je poanta shvatiti koncepte i vidjeti čega sve ima. Što se profesora tiče, mislim da su korektni i da su svjesni da je 95% predmeta beskorisno ljudima koji se neće baviti komunikacijama, pa su ispiti lagani. Sama predavanja ovise od profesora do profesora - meni je npr. Bojanjac, kojeg je kolega iznad opisao kao dosadnog, bio super.\n\nUgl, predmet većini ljudi neće trebati, ali zato su ga napravili laganim (za razliku od EPE pizdarija), a mislim da će biti zanimljiv onima koje zanimaju komunikacije. \n\nTežina: **5 / 10**\n\nKorisnost: **8 / 10**\n\nBih li preporučio/la predmet: **Obavezan**\n\n\nDodatak: upisao sam ove predmete čisto po svojim interesima, al mislim da sam našao najlakše složeni semestar ikad, sve sam položio sa visokim ocjenama, a osim završnog nisam ni osjetio semestar. Tako da ako samo želite easy prolaze, preporučam ovo, jedino si MFPUE zamijenite s nečim.",
      "votes": {
        "upvoters": [
          "Vedo",
          "[deleted]",
          "netflix (seximan)",
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "218932": {
      "poster": "Ferovac123",
      "content": "@Vedo#218707 znaš možda kolko je teško računarcu završiti automatiku? Zanima me to podrucje, ali nez kolko mi predznanja fali.\n\nAko mozes iskustveno nekaj reci",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "219279": {
      "poster": "Vedo",
      "content": "@Ferovac123#218932 Pa iskreno neznam sto da ti kazem... Na E smjeru općenito nema skoro uopće programiranja i bilokakve teorije računarstva, strojnog učenja ili umjetne inteligencije. Umjesto toga, radi se više gradivo bazirano na fizici i hardveru i nekakvim opipljivijim stvarima - elektronika, automatsko upravljanje (PI, PID regulatori), istosmjerni i asinkroni strojevi, osnove mehatronike. Neznam koliko na R smjeru ima rjesavanja zadataka na papiru, ali ovdje ima podosta (uz formule). Isto tako, jedino programiranje što smo imali je bilo na ARH1E (Assembly) i osnovama automatizacije gdje se ne koristi klasični kod već ljestvićasti dijagram (Ladder Diagram). \n\nProdi kroz predmete od E smjera pa prosudi sam. Mozda ako si isao u tehnicku skolu bi ti bilo nesto lakse to pohvatati.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "219430": {
      "poster": "Daho_Cro",
      "content": "### Praktikum robotike\nPredmet je namijenjen isključivo studentima koji se planiraju baviti robotikom dalje u studiju te navodno služi kao nekakv uvod u Osnove robotike na diplomskom. Nije težak, naučit će te osnovne stvari vezane za programiranje i izradu robota te će te imati projekt u kojem će te (sad po novome) morati dizajnirati i napraviti robotsku ruku (kažem po novome jer su prije bile nekakve lego kockice u pitanju). Organizacija više-manje ok. Predmet drže prof. Orsag i asistenti. Kao što sam rekao nije previše zahtjevno, ali treba se potruditi oko tog projekta što naravno nema smisla raditi ako se dalje ne vidite u robotici. Svakako preporučam budućim robotičarima.\n\nTežina: 5 / 10\n\nKorisnost: 7 / 10\n\nBih li preporučio predmet: Da\n\n### Ergonomija u računarstvu\nPredmet na kojem nećete naučiti puno stvari vezanih za struku, ali hoćete naučiti dosta praktičnih stvari vezanih uz svakodnevne radnje. Predmet je više koristan nego zanimljiv. Nije bitno jeste li E ili R jer kao što sam rekao gradivo baš nema neke veze sa strukom, ali malo ćete drugačije gledati na neke stvari oko sebe nakon ovog predmeta. Predmet je dosta dobro organiziran, dosta se bodova može skupiti na zadaćama i zadatcima koje dobivate svaki tjedan, ispiti su poprilično lagani. Ovo je jedan od onih predmeta koje upisujete ako želite lagan prolaz uz što manje uloženog truda, ali naravno sukladno tome znanje koje ćete dobiti je slabo korisno za vaše daljnje obrazovanje i budući posao.\n\nTežina: 2 / 10\n\nKorisnost: 2 / 10\n\nBih li preporučio predmet: Da ako želite lagan prolaz, inače ne\n\n### Tehnologija u medicini\nJoš jedan predmet kojeg većina studenata upisuje zbog laganog prolaza, a mali broj onih koje stvarno zanimaju medicinski uređaji. Predmet pruža solidno znanje iz područja rada medicinskih uređaja te je sigurno koristan onome tko se kasnije vidi u području medicinskih tehnologija i uz sve to lagan je za položiti. Jedina mana po meni je to što postoje malo hc pragovi za ovakav predmet. Dosta je ljudi imalo problema sa pragom od 50% na labosima koji zapravo i nisu toliko jednostavni kako se na prvu čini, no koliko sam shvatio na kraju je ipak većina uspjela skupiti sve pragove i riješiti predmet čak i sa visokim ocjenama. Za razliku od ergonomije, ovo nije baš tako jako jednostavno za položiti upravo zbog tih pragova, ali opet ne zahtjeva puno truda. Predavanjima ne morate prisustovati, ispiti se ponavljaju i labosi su uglavnom okej, no neki studenti si znaju zakomplicirati situaciju. Sve u svemu ok predmet.\n\nTežina: 3 / 10\n\nKorisnost: 4 / 10\n\nBih li preporučio predmet: Da",
      "votes": {
        "upvoters": [
          "[deleted]",
          "nairobi (light_grandma)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "225627": {
      "poster": "pero",
      "content": "@Skiv#142401 Može jedno pitanje za osnove obradbe signala: bi li taj predmet bio razumljiv R-ovcima koji nisu slušali SiS? Vidim da se u prvom ciklusu radi nekakvo skraćeno gradivo SiS-a, pa je li do dovoljno da se skuži drugi ciklus bez drugog predznanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230588": {
      "poster": "Jure (bidonitez)",
      "content": "Ima netko ikakve informacije za Tehnološke osnove iskorištavanja obnovljivih izvora energije?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "230597": {
      "poster": "Skiv",
      "content": "@pero#225627 Mislim da je predmet i zamišljen za R",
      "votes": {
        "upvoters": [
          "Jure (bidonitez)",
          "pero"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "231842": {
      "poster": "BigTuna",
      "content": "@Vedo#218707 bome si se potrudio hahahah :P",
      "votes": {
        "upvoters": [
          "Vedo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "233155": {
      "poster": "Cika",
      "content": "Koji izborni predmeti se preporučaju za buduće robotičare?",
      "votes": {
        "upvoters": [
          "Daho_Cro"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "233200": {
      "poster": "Daho_Cro",
      "content": "@Cika#233155 Programiranje i simuliranje robota i Praktikum robotike svakako upisati ako se želiš baviti robotikom. Osim toga ne znam što bih ti još rekao, ima nekoliko predmeta koji su itekako dobri za automatiku općenito, ali tamo nema baš puno stvari vezanih za robote (drugi kolege su mi rekli da nema, ne znam zapravo jer nisam slušao te predmete) npr. Osnove automatizacije i Sinteza sustava automatskog upravljanja.",
      "votes": {
        "upvoters": [
          "Cika",
          "zdravoljubac (rajka)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "233796": {
      "poster": "ZvonkoSisoje",
      "content": "Jel itko sada ove godine bio na predmetu Audiotehnika? Zanima me kako to izgleda i jesu li promjenili ista od fer2?",
      "votes": {
        "upvoters": [
          "General_Frans",
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "233816": {
      "poster": "GileTheGreat",
      "content": "@Cika#233155 \n\n@Daho_Cro#233200 \n\nMozes upisati vjestinu ROS (Robotski operacijski sustav), vecionom se zapravo radi u ROSu ako ti zavrsni/diplomski bude na ZARI-ju i vezan za robote. Svi za pokretanje koriste ROS tako da to ti je dobar uvod + googlanje",
      "votes": {
        "upvoters": [
          "Cika",
          "zdravoljubac (rajka)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "234150": {
      "poster": "Magi",
      "content": "Je li itko zna išta o Tehnološkim osnovama iskorištavanja obnovljivih izvora energije?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "234386": {
      "poster": "Daho_Cro",
      "content": "@GileTheGreat#233816 koliko znam po FER3 programu više nema vještine ROS nego je predmet Programiranje i simuliranje robota zapravo ta vještina.",
      "votes": {
        "upvoters": [
          "Cika",
          "GileTheGreat",
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "234841": {
      "poster": "Makrovalni_Hladnjak",
      "content": "@Grdobina2000#139184 \n\nVrijedi i ovu godinu. Predmet je brutalan za svakog ko želi razumit prirodu i znat što se događa \"ispod površine\".",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235589": {
      "poster": "humerus",
      "content": "ima li netko za podijeliti iskustvo za predmet Moderne metode fizike u elektrotehnici, informaciji i računarstvu (5.semestar) ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235716": {
      "poster": "vidovice (ab332)",
      "content": "@Vedo#218707 vidim da si odabrao Suminu, tako i ja planiram..zanima me koje predmete predlazes u 5. semestru za izborne jer fakat nez sta bih, a da ima sto vise veze sa elektrostrojarstvom. pls help",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235725": {
      "poster": "[deleted]",
      "content": "@vidovice#235716 ista situacija, mislin upisat osnove mehatronike i osnove energetske elektronike",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235729": {
      "poster": "vidovice (ab332)",
      "content": "@potrka#235725 doslovno istooo hahah, al et opet cekam neko misljenje jos savjet sta vec ako tko ima",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235796": {
      "poster": "mihamih",
      "content": "@Magi#234150 bump",
      "votes": {
        "upvoters": [
          "Magi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235885": {
      "poster": "Vedo",
      "content": "@vidovice#235716 @potrka#235725 Da, apsolutno. Osnove mehatronike je lakši predmet te ćete imati više vremena koncentrirati se na dosta nezgodna elektromagnetska polja, EPE i automatsko upravljanje. Ukoliko odaberete osnove energetske elektronike i položite ga sad, nećete ga morati polagati na diplomskom. Na diplomskom je on obavezan za sve koji ga nisu odabrali u 5. semestru. Jedino nisam siguran hoćete li imati preklapanja u rasporedu radi njega. Prošle godine ga nisam mogao upisati zbog 1000 i jednog preklapanja.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "vidovice (ab332)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236056": {
      "poster": "MrG",
      "content": "Ima li netko iskustva s predmetima ' Električna rasvijeta ' i ' Niskonaponske mreže i mikromreže '. Po programu ne izgledaju tesko?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236063": {
      "poster": "temsi (dipsy)",
      "content": "@MrG#236056 cula sam da je rasvjeta lagana (+ https://fer.studosi.net/d/4923-eleras-o-predmetu/3), za ovaj drugi i mene zanima",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236100": {
      "poster": "Grumio",
      "content": "Jel itko upisivao alati za razvoj digitalnih sustava i kakva su iskustva?\n\nJel ima netko jos prijedlog za izborni predmet za ERI osim jos elektroničkih sustava?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236102": {
      "poster": "Widlar",
      "content": "@Grumio#236100 https://fer.studosi.net/d/1108-eiit-predmeti-2-godine-diplomskog-studija/9",
      "votes": {
        "upvoters": [
          "Filemon",
          "Grumio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236504": {
      "poster": "chaos466",
      "content": "@Makrovalni_Hladnjak#234841 Ima li ga više smisla onda upisat u petom semestru ili ga slusat kao jezgreni kolegij na prvom semestru komunikacijskih tehnologija?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236581": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@chaos466#236504 Ma slušaj ga u petom semestru. Onda ćeš zasigurno htjeti upisati modernu fiziku i primjene u elektrotehnici u 6. semestru, a u 5. semestru ćeš bolje kužit polja (čak i epe rekao bih). Ako se odlučiš u 6. semestru uzimat još predmeta s ZKISTA, SVI predmeti s ZKISTA  poput optoelektronike, osnova bežičnih sustava na kraju i obaveznog komunikacijskih sustava su 1000 puta razumljiviji. O ostalim predmetima na diplomskom da i ne govorim...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236582": {
      "poster": "chaos466",
      "content": "@Grdobina2000#236581 Hvala ti puno",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236611": {
      "poster": "humerus",
      "content": "@Grdobina2000#236581 jesu li se osnove bežičnih sustava održavale?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236650": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "Tehnička normizacija i legislativa, iskustva neko?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236663": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@humerus#236611 Jesu, bilo nas je 3 s prediplomskog i 1 s diplomskog. Onako nije baš lagan predmet. Dosta je opširan i jako puno toga pokriva(stvarno puno ima gradiva), ali je definitivno bio koristan(možda i najkorisniji taj semestar). Dosta stvari s komsusa se i tamo spominje. Prije se zvao radiofrekvencijski sustavi ak ćeš tražit na materijalima. I bonefačić je dosta drag i oće pomoć ak pitaš nešto. Također nije dinamičan ko na primjer pemvi, prezentacije se vrte i tak, al jednom kad ga položiš skužiš kak si dosta tog naučio i čuo sa svih strana.",
      "votes": {
        "upvoters": [
          "humerus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236701": {
      "poster": "deus_vult",
      "content": "netko o Sigurnost bežičnih sustava ??",
      "votes": {
        "upvoters": [
          "Grdobina2000 (Grdobina)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236714": {
      "poster": "humerus",
      "content": "@Grdobina2000#236663 hvala ti\n\nznas li mozda onda koji je minimum da bi se odrzalo, ako se odrzava za 4 ljudi?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236763": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@humerus#236714 ne znam mjenjali su to zbog korone i tak. Mislim oko 10. U svakom slučaju s koronom ili bez profesor je volontiro to da nam drži jer nas je bilo premalo (dakle mislim da mu uopće nije bilo plaćeno) tak da mu je stalo do predavanja iako nisu najdinamicnija na trenutke.",
      "votes": {
        "upvoters": [
          "humerus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236764": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@deus_vult#236701 Ja i još dvoje ljudi znam da će upisat. Jel znaš išta o profi i njenim predmetima? Nama je to potpuni upitnik haha. Al kaj nije to na diplomskom ili se nudi i na preddiplomskom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236777": {
      "poster": "humerus",
      "content": "zna li netko hoce li prihvacat polozene Elektronicke sustave iz 5.semestra preddiplomskog za Elektronicke sustave kao jezgreni predmet u 1.semestru diplomskog na Elektronici i ERI-ju? sifre predmeta su drugacije",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236778": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@humerus#236777 Ako su ekvivalenti da, ali to u prijevodu znači samo da ga nećeš moći odabrati, broj ECTS-a koje treba položiti ostaje isti",
      "votes": {
        "upvoters": [
          "Filemon",
          "humerus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236794": {
      "poster": "humerus",
      "content": "Koliko su korisna predavanja iz Elektromagnetskih polja, preklapa mi se s nekim izbornima koje bih upisala, isplati li se zrtvovati dio predavanja iz polja za željeni izborni ili nije pametno?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236802": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@humerus#236794 Ak će bit kvalitete ko ova online, ne isplati se ić na niti jedno",
      "votes": {
        "upvoters": [
          "BigBoi",
          "GranAutismo",
          "humerus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "humerus"
        ],
        "tuga": []
      }
    },
    "236805": {
      "poster": "GranAutismo",
      "content": "@humerus#236794 @Grdobina2000#236802 Ni prije korone kad je bilo uživo se nije isplatilo",
      "votes": {
        "upvoters": [
          "humerus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236823": {
      "poster": "deus_vult",
      "content": "@Grdobina2000#23676 neam pojma....cijeli taj zkist je velika enigma...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236824": {
      "poster": "deus_vult",
      "content": "@Grdobina2000#236764 neam pojma cijeli taj zkist je enigma..",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236903": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "https://www.fer.unizg.hr/predmet/mmui\n\nKolegica mi javlja da fali par ljudi pa dijelim. Djeluje da ima hrpu hrpu dodatnih bodova pa nije teško imati visoku ocjenu.\n\nOće netko ovo upisat? Čula sam da je zanimljiv predmet i čini se dosta koristan i ne previše težak. Plus, drži Bojanjac tak da su predavanja vjerojatno zanimljiva i interaktivna.",
      "votes": {
        "upvoters": [
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237013": {
      "poster": "Kobe",
      "content": "Kakav je predmet elektroenergetski sustavi 1?",
      "votes": {
        "upvoters": [
          "Jure (bidonitez)",
          "Magi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237175": {
      "poster": "LanaRelej (Lana Relej)",
      "content": "Što je s Elektroničkim sustavima? Predmet s istim nazivom postoji pod dvije različite šifre [183435](https://www.fer.unizg.hr/predmet/elesus_a) i [229830](https://www.fer.unizg.hr/predmet/elesus_b). Na webu pod izbornim predmetima 5. semestra je naveden ovaj prvi, a u aplikaciji za upis ovaj drugi. Mislim da bi isti trebao biti i kao izborni u 5. semestru i kao obvavezni na ERI diplomskom (FER3).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237191": {
      "poster": "Franjo_Ferdinand (Franjo Ferdinand)",
      "content": "Jučer sam obranio Završni projekt i mentor mi je upisao ocjenu, ali na FER intranetu i Studomatu mi je još uvijek naveden kao nepoložen. Problem je što je jučer bio zadnji dan za polaganje te sad kreće upis na diplomski koji naravno neću moći ostvariti ako imam nepoložen predmet.\n\nJe li ovo normalno (i Završni mi je zapravo položen) ili opet trebam podsjećati fakultet da napravi svoj posao?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237197": {
      "poster": "Svudec",
      "content": "@Franjo_Ferdinand#237191 Rok za upis na diplomski je prošao. Nadam se da si se prijavio jer sad ti je prekasno. Ako jesi, nemoj se previše brinuti oko toga jer tek je bio nedavno razredbeni ispit i nije još objavljena konačna lista upisanih pa stignu oni sve to još unijeti u sustav.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Franjo_Ferdinand (Franjo Ferdinand)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237199": {
      "poster": "Franjo_Ferdinand (Franjo Ferdinand)",
      "content": "@Svudec#237197 Prijavio sam se i sve predao, samo to ništa ne znači ako imam nepoložen predmet. Nadam se da su kako kažeš samo spori, no iz prijašnjeg iskustva s administracijom FER-a nisam optimističan.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237269": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "@Franjo_Ferdinand#237199 Bit ce sve ok ako si prijavio upis u diplomski i polozio zavrsni, treba im vremena. Ne brini.",
      "votes": {
        "upvoters": [
          "Filemon",
          "Svudec"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237713": {
      "poster": "Semofcanec",
      "content": "@MrG#236056 Niskonaponske su bile prejeben predmet i pičkin dim za položiti. Definitivno preporučam, a ako ides poslije na energetiku onda obavezno upisi.",
      "votes": {
        "upvoters": [
          "Magi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237717": {
      "poster": "Semofcanec",
      "content": "@Kobe#237013 Ako mislis poslije na energetiku onda obavezno upisi jer ionak ti dolazi ko obavezni na diplomskom, a temelj je svega kasnije. Ako ne mislis na energetiku onda nema razloga ovo upisati jer je predmet dosta opsiran i ima toga pun kurac.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237736": {
      "poster": "Kobe",
      "content": "@Semofcanec#237717 \n\nA mentor mi je preporučia... Možeš mi reći kako si učia za njega i koliko tjedno otprilike sati ucenja zahtjeva? Kakvi su labosi?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237756": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "@Kobe#237736 ko ti je mentor?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237763": {
      "poster": "Kobe",
      "content": "@Thedoctor#237756 \n\nTrenutno čekam da me prihvate. Ciljam na elektrostrojarstvo, a taj predmet mi je stari mentor preporucio",
      "votes": {
        "upvoters": [
          "Thedoctor (Rolo balarica)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237915": {
      "poster": "Klembuksna",
      "content": "@Kobe#237013 Na EES1 učiš općenito o komponentama u elektroenergetskom sustavu i rješavaš problem kratkog spoja. Ispiti su okej, varijacija na zadatke iz zbirke. Što se tiče projekta, radi se u NEPLANU gdje s kolegom u paru zajedno pravite jednu shemu mreže prema parametrima koji vam zadaju profesori i rješavate kratki spoj (mislim da je rok par tjedana za to, ali sve vam je dobro pojašnjeno tako da ćete bez problema to napraviti).",
      "votes": {
        "upvoters": [
          "Kobe",
          "temsi (dipsy)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237932": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "@Klembuksna#237915 a EES2?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237967": {
      "poster": "Klembuksna",
      "content": "Na EES2 je više fokus na prijenos električne energije ( geometrijski raspored vodiča, induktivitet, kapacitet i sl. koji se javljaju pri prijenosu). Labos je bio jednostavan, sastojao se od 3 vježbe gdje su pokazane osnove modeliranja nadzemnih vodova, nadomjesnih shema itd itd u Matlabu. Uglavnom nije ni taj kolegij previše kompliciran. Isto tako postoje auditorne na kojima se rješavaju zadaci. Slični zadaci se pojavljuju u ispitu, samo varijacija na temu. Također postoji i skripta koja se lako shvaća. Sve u svemu, također okej predmet i ne zahtijeva predznanje iz EES1 😀",
      "votes": {
        "upvoters": [
          "Kobe",
          "Thedoctor (Rolo balarica)",
          "temsi (dipsy)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239086": {
      "poster": "zs20 (ekuss)",
      "content": "je li tezi predmet EPE ili ELEPOLJ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239087": {
      "poster": "Kuhar",
      "content": "@zs20#239086\n\nJa bih rekao elektromagnetska polja.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239101": {
      "poster": "nairobi (light_grandma)",
      "content": "@zs20#239086 ja bih rekla epe, al sve ovisi kakvi ispiti dođu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239126": {
      "poster": "netflix (seximan)",
      "content": "@zs20#239086 epe jer se na poljima samo ponavljaju zadaci iz starih ispita koji su na materijalima sto ljudi i dalje ne kuze nego i dalje rjesavaju trkuljinu zbirku i gube vrijeme",
      "votes": {
        "upvoters": [
          "BedaTheNic",
          "General_Kenobi (Aborteur)",
          "Jure (bidonitez)",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239925": {
      "poster": "Patrick_Bateman",
      "content": "Iz kojih se obaveznih predmeta(autupr, elepol, epe) isplati pratiti predavanja? \n\nMislim da mi nema smisla sjediti 4 sata tjedno u predavaoni samo da bi kasnije opet morao listati skripte i vaditi bilješke jer nisam ništa pohvatao. Predmete koje ne mislim slušati na predavanjima raditi ću samostalno u terminima predavanja. \n\nTijekom online nastave relativno sam dobro naučio raditi samostalno ali ne želim se opet dovesti u situaciju gdje neki predmet ne mogu samostalno učiti zbog loše literature ili nečitljivih prezentacija(električni krugovi).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239931": {
      "poster": "zeroth",
      "content": "@Patrick_Bateman#239925 za automatsko ti ne znam reći jer ih uopće nisam slušao(ne znam koliko je kvalitetno), ali polja i epe samo konzultacije odnosno auditorne da skužiš rješavati zadatke i samostalni rad. Ne slažem se skroz s kolegom iznad da je trkuljina zbirka gubljenje vremena ali meh, to ovisi ako možeš tako napamet naučiti za polja.",
      "votes": {
        "upvoters": [
          "Patrick_Bateman"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239936": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@Patrick_Bateman#239925 Automatsko preskoci predavanja, ispiti su sablonica i predmet je laganica (iskreno 70 % predmeta je ponavljanje neceg kaj si vec cuo na krugovima i sisu na možda malo drugačiji način, 30% je neka mala nadogradnja na to). Uglavnom stari ispiti i lagana petica, labose radi sam i s razumijevanjem, šalji mail i konzultacije ak neš nije jasno.\n\nEmp ti je trkulja i stari ispiti kaj je dostupno, ne slušaj ove spike strebam za rok iz 3 stara dostupna roka to te sam zeznut može. Trkulja te dobro pripremi, imas vecinu zadataka iz nje rjesenu na materijalima i skuzis bitnu teoriju uz to. U svakom slucaju predavanja su beskorisna. Rjesi preporucene zadatke iz trkulje za taj tjedan i ona 2 zadatka za DZ svaki tjedan i Moodle zadatke i to ti je petica.\n\nEpe je iskreno malo zeznut jer su materijali manje vise sranje. Sad će vam vjerojatno bit lakse jer imate ispite od nase generacije. U svakom slucaju ja bi prvi ciklus stipetica slušao jer je razumljiviji i ima manje gradiva i jednostavnije je. Žarko je top znalac i strucnjak al dosta je brz i meni ga je bilo tesko pratit. Doduse kad mu posaljes mail dobis dugačak odgovor i covjek objasni stvari koje i nisi znao da ti nisu bile jasne osim toga sta si ga pitao. Drugi ciklus rjesitit žarkove zadatke (30 njih) i svi imaju detaljan postupak pa se moze naučiti s razumijevanjem. Prvi ciklus rješavati mozda pokoji zadatak iz one stare zbirke ali definitivno ne sve. Sve auditorne proci temeljno i s razumijevanjem! Uglavnom mislim da predmet nije teži od polja ali mu jednostavno fali materijala iz kojih učiti pa je zeznut. Uz trud se da imat 5.\n\nUglavnom po težini ti je automatsko daleko najlakse. Polja su matematicki i teorijski puno zahtjevnija, ali imaju bolje materijale i ekipa ne zeza toliko na tome (zoeem da zeli bi predmet bio totalni pakao). Epeu fali materijala i zadataka iz kojih uciti.",
      "votes": {
        "upvoters": [
          "Jure (bidonitez)",
          "Patrick_Bateman",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "jolemjer",
          "zdravoljubac (rajka)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "239954": {
      "poster": "netflix (seximan)",
      "content": "@zeroth#239931 trkulja = gubljenje vremena",
      "votes": {
        "upvoters": [
          "kauc_u_predvorju (OVOG KORISNIKA OPSJEDA DŽIN)"
        ],
        "downvoters": [
          "Christoph_Schwab"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Filemon"
        ]
      }
    },
    "243276": {
      "poster": "tomke",
      "content": "@\"Klembuksna\"#p237915 jel taj projekt laboratorijska vjezba ili kako je organiziran predmet ? I za ispite koja je to zbirka i koliko je dana potrebno da se spremi ispit ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "244143": {
      "poster": "General_Kenobi (Aborteur)",
      "content": "@\"tomke\"#p243276 taj projekt ti je napraviti neku mrežu i modelirati te dimenzionirati njezine elemente kak su te učili na predmetu, zbirka je na stranici predmeta u pdfu. Treba ti 3 do 4 dana za spremit svaki od ispita ako kontinuirano radiš",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "270265": {
      "poster": "temsi (dipsy)",
      "content": "@\"Klembuksna\"#p237967 Je li teži elesus1 ili elesus2?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "270686": {
      "poster": "Klembuksna",
      "content": "@\"dipsy\"#p270265 rekao bih da je elesus1 teži. Ima više gradiva, a i ispiti znaju bit naporni jer se dugo pišu, a posebno je potrebna max. kocentracija prilikom proračuna KS.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "temsi (dipsy)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272930": {
      "poster": "TheMario77 (Sett)",
      "content": "Kakvi su predmeti Analogni integrirani sklopovi i Uvod u projektiranje sustava s mješovitim signalom na razini integriranih sklopova?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276143": {
      "poster": "General_Frans",
      "content": "# Zimski semestar\n\n## Automatsko upravljanje\n\nProsječan redovni predmet. Treba redovno pratiti predavanja (online ili uživo, kako ti paše), rješavati pripreme za labose uz pomoć nekog ili prošlogodišnjih snimki te pred MI i ZI riješiti 4-5 prošlogodišnjih ispita i lagano se prođe.\n\nZa bliceve na labosima je dovoljno proći kroz pripremu te po potrebi bacit pogled na relevantne prezentacije. S obzirom da labosi traju 2 sata, a na njih se dolazi samo na usmeno odgovaranje i blic, tko ne stigne doma može pripremu dovršiti na samom labu. Inače se javiš kad si spreman, a u međuvremenu možeš ponavljati ako nisi siguran za nešto.\n\nTežina: **6 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Audio elektronika\n\nVrlo lagan izborni predmet. Predavanja nisu obavezna ali moja preporuka je da se redovno prate. Prezentacije postoje ali nisu nešto detaljne i na ispitu ima zadataka za koje prezentacije nisu od pomoći. Ako nekog teorija baš zanima, može na fer2net materijalima pronaći audiotehniku. Predmet je po gradivu jako sličan audio elektronici i skriptu je radio isti prof. koji predaje audio elektroniku (Ivan Đurek). \n\nŠto se tiče obaveza, predmet ima seminarski rad od 30 bodova koji se radi kroz cijeli semestar laganim tempom. Zapravo treba napraviti 2 male prezentacije i isprezentirati pred 10 kolega, pronaći neku što jednostavniju el. shemu da si ne zagorčaš život i na kraju treba samo nacrtati to u multisimu i simulirati (odeš kad god hoćeš u zavod na neki PC u sobi gdje se drže labosi) pa složit neki jednostavan dokument od tog. Predmet također ima i 5 labosa koji nose 20 bodova i koji su baš lagani i radiš ih u grupi s par kolega.\n\nI na kraju, MI i ZI se s lakoćom riješe ako se prate predavanja i baci pogled na prošlogodišnje ispite iz audiotehnike (fer2net materijali, nabaviš ih na pirate bayu u obliku torrenta, za one koji ne znaju).\n\nNa ovom predmetu je bodovanje općenito blago i atmosfera je opuštena. Čak je i R-ovcima lagano.\n\nTežina: **3 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Praktikum elektroničkih elemenata i sklopova\n\nRelativno lagan izborni predmet. Predavanja nisu obavezna i nema ih puno (svega 5-6  predavanja), ali korisno je ići na njih.\n\nLabosi nose 70 bodova i mi smo ih imali samo 3 (trebali smo imat više ali nismo stigli). Prvi labos ne radiš ništa i on se ne ocjenjuje, nego samo gledaš što asistent il prof. radi. Druga 2 labosa se pak ocjenjuju, rade se u udobnosti vlastitog doma i ako ne želite prolupati savjetujem vam da udružite snage s drugim kolegama. Što više kolega to bolje. Za oba labosa imaš rok od 2 tjedna i u prosjeku im treba posvetit 4-6 dana (ugl. jer su upute tužne). Ne bih rekao da je ocjenjivanje labosa strogo ili preblago. Ovisi o tome koliko su najbolji radovi kvalitetni pa oni posluže kao referentni modeli za ocjenjivanje ostalih radova. Ako napravite izgledom savršen rad i dobijete 4, to je zato što se našlo par nadobudnih (šupaka, primite moje isprike ali jbg, jeste, uz dužno poštovanje, lp) kolega koji su vjv pisali paragrafe u skoro svakom podzadatku. \n\nUnatoč tome, s obzirom da se na labosima ne daju bodovi nego baš ocjene od 1 do 5 (pa se nakon usmenog sve skalira), s obje četvorke bez problema možete imati 5 na predmetu. \n\nŠto se ispita tiče, MI ne postoji, a ZI je u usmenom obliku i nosi 30 bodova. Prof. objavi 17 pitanja, vi se dogovorite da svatko riješi 1 i onda učite iz tog zajedničkog dokumenta. Usmeni je isključivo u usmenom obliku, tj. nema fore da prvo napišeš, skiciraš nešto na papir pa izrecitiraš što znaš. Moj subjektivni dojam je da se usmeni blago ocjenjuje, a ako ti treba za ocjenu više, prof. će ti automatski dati +5 bodova il kolko već.\n\nAtmosfera je opuštena.\n\nTežina: **3-4 / 10**\n\nKorisnost: **4 / 10**\n\nBih li preporučio/la predmet: **Da**\n\n## Upravljanje znanjem\n\nLagan transverzalni predmet. Predavanja nisu obavezna.\n\nOd obaveza ima seminar koji nosi 30 bodova i koji se radi u grupi (mi smo imali grupe od 10 ljudi jer nas je 757 upisalo predmet). Neki imaju 1 paragraf, neki cijeli A4 papir za obraditi, ali ugl. shema je kopirat tekst u prevoditelj, pejstat iz prevoditelja u word i malo ispraviti neke riječi. Laganih 30 bodova i ugl. svi dobivaju toliko.\n\nMI i ZI su na zaokruživanje točno / netočno te nema negativnih bodova. Kome se da može pogledati preze prije ispita. Kome se ne da može random zaokruživati i šanse su užasno male da se padne predmet.\n\nTežina: **1-2 / 10**\n\nKorisnost: **upravljanje / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "ZvonkoSisoje"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276243": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "## Automatsko upravljanje\n\nLagan predmet poprilično, uz dobro predznanje iz SiS-a. Predmet je dosta skraćen koliko mi se čini u odnosu na FER2 program i definitivno ne spada među najgore ispite na faksu. Preporuka je riješit labose sam.\n\nTežina: **4 / 10**\n\nKorisnost: **7 / 10 ovisi oćeš na automatiku ili ne**\n\nBih li preporučio/la predmet: **obavezan**\n\n## Elektromagnetska polja\n\nPrilično težak predmet koji zahtjeva puno rada i po mom mišljenju ispiti su među težima na faksu. Iako nosi 5 ECTS-a, količina rada uložena u ovaj predmet je puno veća od ostalih predmeta sličnog broj ECTS-a. \n\nZahtijeva dosta dobro poznavanje vektorske analize iz Matana 3 (rotori, divergencije, krivuljni i plošni integrali). Labosi su laganica. \n\nNajbolja literatura je po mom mišljenju Trkuljina zbirka i ona njihova skripta. Svaki tjedan imate objavljene koje zadatke iz literature da riješite kao na osnovama, bitno je bit redovan. \n\nOnaj tko vam kaže da je spremio ispit u par dana, budite sigurni u jedno - laže, ili je položio na dekanskom (navodno su kasnije ispiti lakši i lakši).\n\nGradivo nije toliko teško za skužit, koliko je taj matematika iza svega toga teška\n\nPredavanja nisu pretjerano korisna, osim za bodove, osim ako se vama ne vrate Trkulja i Dadić, za njih sam čuo da su top. Nama su držali stariji profesori (jednom je Trkulja uletio umisto Seada i stvarno se primjeti razlika) koji su pred penziju, tako da vama vjv neće držat.\n\nUsmeni na kraju je opet pismeni, da vam nekakav papir sa teorijom koju pišete, sve u svemu ne preteško u odnosu na zadatke, bitno je razumit gradivo.\n\nTežina: **9.5 / 10 ovakav jedan je dosta za cili preddiplomski**\n\nKorisnost: **5-6 / 10 više opća kultura sa puno matematike**\n\nBih li preporučio/la predmet: **obavezan**",
      "votes": {
        "upvoters": [
          "pitroid"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276449": {
      "poster": "zs20 (ekuss)",
      "content": "Koji od ovih transverzalnih predmeta je najlakše za proci: inzenjerska ekonomika 2, inovacije i upravljanje tehnologijom ili upravljanje kakvocom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276450": {
      "poster": "zs20 (ekuss)",
      "content": "Koji od ovih transverzalnih predmeta je najlakše za proci: inzenjerska ekonomika 2, inovacije i upravljanje tehnologijom ili upravljanje kakvocom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276944": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "@\"ekuss\"#p276450 ja sam stavio inovacije",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "280377": {
      "poster": "EgzKomProv (4AsaAkira)",
      "content": "Pitanje za 6. semestar od nekoga tko zeli upisat ESA kasnije\n\nIz gore navedenog ocito je da treba upisat Osnove upravljanje elektricnim strojevima i Osnove automatizacije, ali sto trece?\n\nDa li je URS koristan ili bolje nesto drugo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "280382": {
      "poster": "Thedoctor (Rolo balarica)",
      "content": "Upiši niskonaponske i budi čovik",
      "votes": {
        "upvoters": [
          "General_Kenobi (Aborteur)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "297357": {
      "poster": "General_Frans",
      "content": "@\"sour\"#p218766 Koliko je kriticno ako na modernoj fizici u 3. tjednu drugog ciklusa jos nisam piknuo profesora za projekt? Jedino se Hrabar sjetio namamit nas da piknemo kod njega nesto. Ovi ostali nis.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}