{
  "title": "[EPE] O predmetu",
  "creator": "zeroth",
  "slug": "epe-o-predmetu",
  "tags": [
    "FER",
    "Elektromehaničke pretvorbe energije"
  ],
  "posts": {
    "138851": {
      "poster": "zeroth",
      "content": "Iskustva s usmenog?",
      "votes": {
        "upvoters": [
          "verratti (Rom Jova (Željezo/bakar))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138865": {
      "poster": "Grdobina2000 (Grdobina)",
      "content": "@zeroth#138851 super su bili",
      "votes": {
        "upvoters": [
          "Bobinator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138871": {
      "poster": "Bongaja98 (xvfg)",
      "content": "jeli moze netko s FER 2 reci kako najlakse spremiti ovo za ispit u 5 dana, jeli dovoljno proci auditorne i onda one zadatke s weba?",
      "votes": {
        "upvoters": [
          "rolotex (brr)",
          "verratti (Rom Jova (Željezo/bakar))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138930": {
      "poster": "lincthesinc17",
      "content": "@Bongaja98#138871 pred MI i ZI sam 3-4 dana prije krenio ucit i proso samo auditorne za MI a za ZI uz auditorne i onaj file zzv asinkronih strojeva. usmeni naucio 60 pitanja i na kraju kolokviro s 3. tako da mislim da se u 5 dana dobrog rada dobro moze pripremit za to. apsolutno nisam gledo ni zbirku ni predavanja videa sto je stavljo",
      "votes": {
        "upvoters": [
          "Bongaja98 (xvfg)",
          "pcharlie"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "138964": {
      "poster": "Bobinator",
      "content": "@zeroth#138851 nez jel kod obojice bilo isto, ali kod stipetica je svatko dobio papir sa svim pitanjima i na njima je zaokruzeno rendom 5 pitanja na koje odgovoris, i onda nakon 40 min sve pokupi i samo prozove osobu, pogleda sta si napisao i ako nesto nedostaje ili je nejasno te pita o tome, ali sve super. Navodno ako ne odgovoris nista na 2 pitanja odma padas, ali msm da kod stipetica nije bilo takvih situacija(bar do mog odgovaranja). \n\nPS:odgovore na pitanja cu uploadat na materijale nekad kasnije, ali svakako vam radi i onaj link pa ih mozete i tamo vidjet. uz to, ja sam odgovorio na nekih 75 pitanja tako da je moguce da ima i krivih odgovora pa si provjerite sve to jos jednom",
      "votes": {
        "upvoters": [
          "BigBoi",
          "Elle",
          "EstebanVihaio",
          "Trava",
          "verratti (Rom Jova (Željezo/bakar))"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142286": {
      "poster": "Bongaja98 (xvfg)",
      "content": "kakav je bio usmeni sad za FER2 jeli i mi imamo neka pitanja i koji ispitivac bio",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "142304": {
      "poster": "dontc4m4pc",
      "content": "@Bongaja98#142286 Nema pitanja, Hanić je pitao transformatore i sinkrone strojeve, teorija, usmeno 5-6 pitanja, prođi kroz prezentacije... \n\nŠunde asinkrone i učinsku, na papiru napišeš, pogleda ti i postavi par kratkih pitanja, meni je bilo ovisnost momentne karakteristike asinkronog motora o U, f  i U/f, a iz učinske ponovi fazne ispravljače, diodu u mosnom spoju i pretvarače. (dobit ćeš jednog od tih i trebaš izvest jednadžbe i nacrtat shemu.)",
      "votes": {
        "upvoters": [
          "Bongaja98 (xvfg)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143054": {
      "poster": "Ilija123 (Mrnjotaur)",
      "content": "Jel netko zna jel na kraju spušten prag za usmeni ili ne?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "143064": {
      "poster": "spenadla",
      "content": "@Ilija123#143054 Spušten na 36%",
      "votes": {
        "upvoters": [
          "tux"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Ak08 (obama)"
        ]
      }
    },
    "143073": {
      "poster": "Franjo_Ferdinand (Franjo Ferdinand)",
      "content": "\"U konačnici, svi ti bodovi, pragovi, decimale unose samo nepotrebna rangiranja, ujednačenja, uprosječenja, nemir i anksioznost u studentski život, bilo bi bolje da se svi zajedno bavimo znanjem, a ne bodovima.\"\n\nNe samo da bi ih trebalo biti sram napisati ovakvu rečenicu nakon svega što su nam servirali, svih problema koje su uzrokovali, nego bi trebali izadti svim studentima javnu ispriku.\n\nNačin na koji je ova zadnja obavijest pisana je toliko manipulativan, ljigav i gadan da je na razini sjevernokorejskih medijskih objava. Nakon što oni sami svima otežavaju učenje, otežavaju prolaz i generalno otežavaju život, oni se usuđuju još sebe predstavljati kao žrtve i (ne)suptilno tvrditi kako su studenti sami krivi što postoji nehumana kombinacija praga od 50% i negativnih bodova od 30% uz umjetno pretjerano težak ispit, te što sami nisu naučili gradivo koje je višestruko prenapuhano za dostupnu satnicu (i koje je vrlo očajno predavano).\n\nSvašta sam iskusio na ovom fakultetu, ali ovolika razina samodopadnosti kod profesora je zabrinjavajuća i zapanjujuća.",
      "votes": {
        "upvoters": [
          "doroty (dibi)",
          "tux"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "222769": {
      "poster": "Klembuksna",
      "content": "Pozdrav ekipa ! S obzirom da su nas s EEP prebacili iz grupe EPE još u prvim tjednima, zanima me jel ima netko snimljene prve dvije auditorne kod Stipetića ili link neki?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "227116": {
      "poster": "Kuhar",
      "content": "7. auditornih nema na fer webu?\n\nEDIT : naso na teamsu file.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}