{
  "title": "Studiranje u inozemstvu",
  "creator": "Krisle",
  "slug": "studiranje-u-inozemstvu",
  "tags": [
    "FER",
    "Općenito"
  ],
  "posts": {
    "140073": {
      "poster": "Krisle",
      "content": "Nisam pronašao još ovu temu pa rekoh da pokrenem.\n\nSjećam se da sam čitao dosta dobrih informacija na F2N.\n\nIma li itko iskustva sa studiranjem u inozemstvu ili je dobro upoznat s time?\n\nŠto mislite o diplomskom studiju negdje vani otići? Koliko je plodonosno ili ipak prezahtjevno u usporedbi s FERom?\n\nZnam da su možda subjektivna pitanja, ali evo i još jedno činjenično:\n\nKako to u inozemstvu izgurati bez velikih troškova? Čitao sam da ih puno radi uz faks pa uspiju to sve pokriti (internacionalni studenti). Gdje se mogu naći stipendije i ponude studentskih domova da u tome olakšaju? I naravno za kraj, koje destinacije to sve skupa najbolje pokrivaju?",
      "votes": {
        "upvoters": [
          "EstebanVihaio",
          "Jale (čakijale)",
          "pop (gabagool)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140084": {
      "poster": "pop (gabagool)",
      "content": "@Krisle#140073 Generalno većina fakseva koji nude mastere na engleskom imaju i nekakve stipendije, ali to bude dosta kompetitivno za dobit afaik.\n\nJos znam da u Danskoj navodno ima neka shema di ako radis part-time uz studij dodatno dobijes neke pare od drzave, pa se mozes malo o tome raspitat.\n\nMislim da upast na neki faks koji rangira bolje od FERa nije prezahtjevno. Ovisi koliko visoko ciljas. Glavni problem je isfinancirat sve skupa, pogotovo ako ne konkuriras za stipendije (aka nemas super prosjek).\n\nSto se tice kvalitete, to sto neki faks bolje rangira od FERa (tj. UniZg) ti u svakom slucaju ne garantira da je bolje studirat na njemu, ali te ljestvice (Times Higher education, qs ratings i sl.) nije lose pogledat za dobit neku ideju sta se nudi.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140090": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Krisle#140073 Kako to u inozemstvu izgurati bez velikih troškova? Čitao sam da ih puno radi uz faks pa uspiju to sve pokriti (internacionalni studenti).\n\nPazi si da u zemlji nemaš neki zakon koliko studenti mogu raditi. Npr. frend je nakon 2 godine u Nizozemskoj uz maks rad bankrotirao i vratio se u RH.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Filemon"
        ]
      }
    },
    "140096": {
      "poster": "Krisle",
      "content": "@micho#140090 E al to me muči kako može internacionalni student bankrotirat ako ima sređen smještaj? A nekako mi je logično da bolja sveučilišta imaju kampuse i domove di možeš bit",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140098": {
      "poster": "Vamonos (Idemo)",
      "content": "Pa nisu ti domovi besplatni. Nije necuveno da krevet u visekrevetnoj sobi bude po 300 eura.\n\nBez stipendije je studiranje na nekom top faksu squeaky bum time. Pogotovo ako ides u UK/Irsku gdje i sam faks moras placati",
      "votes": {
        "upvoters": [
          "Filemon",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140102": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Krisle#140096 Sve je skuplje. To što je zaradio mjesečno mu je jedva pokrivalo osnovne troškove života, i ne znam uopće jel u to ulazila stanarina. Nije nam previše pričao koliko ga nešto košta, zapravo smo saznali da je ostao bez para tek kad se vratio.\n\nSuma sumarum znam da je zaključak bio da jedino što je jeftinije vani je trava lmao",
      "votes": {
        "upvoters": [
          "[deleted]",
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "140164": {
      "poster": "njofra",
      "content": "@Vamonos#140098 Kad vec spominjes Irsku, proveo sam jednu godinu u studentskom domu u Dublinu, jednokrevetna soba je 250EUR, dvokrevetna 200EUR, tjedno(!). Moze se proci nesto jeftinije, ali razlika nije toliko znacajna. Uz to je skolarina za master 6-8k EUR godisnje. Za obrok ti treba minimalno 7-8EUR, i to nije puni menu kao u nasim menzama. Svaka voznja u javnom prijevozu je 2-2.5EUR, mjesecne karte su uglavnom neisplative. Place su uglavnom dovoljne za to pokriti, ali ako slucajno ne mozes dovoljno raditi uz faks ili ostanes bez posla, neces dugo prezivjeti.\n\nNaravno, to vrijedi za Dublin, a slicno je i u vecim gradovima u UK. Kontinentalna Europa je uglavnom osjetno jeftinija, ali su i studentski poslovi slabije placeni.",
      "votes": {
        "upvoters": [
          "Bobicki",
          "Filemon",
          "Krisle",
          "Vamonos (Idemo)",
          "[deleted]",
          "in1"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "295334": {
      "poster": "wutangfan (HugoStiglitz)",
      "content": "Ima li netko dojmove o diplomskom na tu wien? Planiram bas upisati diplomski tamo no i dojmovi s erasmusa su dobrodosli",
      "votes": {
        "upvoters": [
          "Vicegradonacelnik (comsten)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}