{
  "title": "[INZEKO2] Radionica za studente - 2020/2021",
  "creator": "EstebanVihaio",
  "slug": "inzeko2-radionica-za-studente-20202021",
  "tags": [
    "FER",
    "Inženjerska ekonomika 2"
  ],
  "posts": {
    "151802": {
      "poster": "EstebanVihaio",
      "content": "Vjerujem da svi studenti (ako ne svi, onda većina) znaju za radionice koje se petkom održavaju u sklopu kolegija Inženjerska ekonomika 1 i 2 koje vodi profesor Dubravko Sabolić. Za one koji ne znaju što su Inžeko radionice, ukratko: svaki petak prof. Sabolić pozove gostujuće predavače kako bi nam pričali o svojim poslovnim iskustvima i razvoju karijere. Dolazili su bankari, inženjeri elektrotehnike i računarstva, ekonomisti, a svima je zajedničko bilo to što su se našli na menadžerskoj poziciji i voljni su podijeliti svoja iskustva i načine kako su se snašli u tim vodama. Nema prezentacija, nema nekog pripremljenog govora - samo studenti s pitanjima i gosti s odgovorima.\n\nProfesor Sabolić je najavio da će na jedno od sljedećih predavanja doći predstavnici iz [CROZ](https://croz.net/) kompanije. U trećem semestru prisustvovah radionici na kojoj su dolazili predstavnici iz firme, Vedrana Miholić i Ivan Krnić, i to predavanje je bilo, po mojoj subjektivnoj procjeni, prezanimljivo jer smo mogli gotovo 1 na 1 pričati s ljudima o njihovim iskustvima i razvoju karijere od završetka fakulteta do danas. \n\nZnam da od čitave generacije koja sluša ovaj predmet, dosta malen postotak se odluči za ove radionice (zbog toga smo i imali priliku pričati s njima opušteno) primarno zato što su petkom i u to u terminu od 16h do 18h kad, realno, nikom nije ni na kraj pameti biti na faksu (covid-19 edition: na Teamsu) ukoliko to nije za neki važniji predmet ili labos. U tome, dakako, nema ništa loše jer je normalno da svatko ima vlastite obveze i prioritete, a Inžeko 2 baš i nije na vrhu liste mnogima od nas.\n\nRazlog zašto otvaram ovu temu jest to što je profesor Sabolić zamolio jednog/u kolegu/icu da moderira radionicu na kojoj će predstavnici CROZ-a ponovno doći, pretpostavljam ponovno gđa. Miholić i g. Krnić, s namjerom da predavanje bude više interaktivno i da atmosfera na online predavanju bude što opuštenija i prirodnija (koliko je to moguće na Teamsu). Zato me zanima koliko bi vas bilo zainteresirano prisustvovati i sudjelovati na radionici, ako ništa drugo, samo da se pridružite meetu i odslušate šta ljudi imaju za reći pa bi bilo super kad bi veći broj studenata popunio anketu. \n\nAko vam se ideja čini zanimljivom, pišite ovdje stvari koje vas zanimaju i potencijalna pitanja koja imate o CROZ-u i zaposlenju u tvrtki, pripravništvima, vještinama koje se traže i slično, a ja ću ih proslijediti dalje moderatoru/ici čisto da vidimo koliko ljudi bi sudjelovalo u ovome i vrijedi li se prihvatiti nekog ozbiljnijeg posla da ova radionica liči na nešto. Ovisno o zainteresiranosti, postavit ću ovdje link za meet pa da se što više ljudi može priključiti. \n\nDatum radionice nije još određen, ali sigurno će biti petkom i vjerojatno u ovom terminu (16h-18h) jer je petak rezerviran za radionice, a i o našoj zainteresiranosti za ovu radionicu ovisi i to hoće li kolega/ica prihvatiti ovaj prijedlog jer nitko se voljno ne želi izlagati neugodi crnog zaslona i mrtve tišine sa zvučnika. \n\nTakođer, treba uzeti u obzir i to da mi ne činimo uslugu gđi. Miholić i g. Krnić time što im ''dopuštamo'' ponovno doći pričati sa studentima našeg fakulteta - oni su naši gosti i mislim da su ovakvi eventi fantastična prilika da pokažemo koliko kvalitetnih, svestranih, inteligentnih i nadarenih ljudi pohađa ovaj fakultet koji imaju raznolik spektar razvijenih vještina, osim bacanja butthurt komentara kako se utapamo u labosima. \n\nŽelim naglasiti da radionice nisu ograničene samo na studente koji trenutno slušaju Inžeko 2*, niti na studente FER-a. Ako znate ljude za koje mislite da ih ovako nešto interesira, budite dobri apostoli i širite vijest dalje - što više ljudi, to bolje. Tema koju su prezentirali prošle godine se zvala: _Od geeka do fotelje bez suvišnih zašto._ Vjerojatno će i ove godine biti nešto slično ako uopće budu isti predavači, a pretpostavljam da hoće (s profesorom ćemo dodatno potvrditi).\n\n*Ako ste student/ica koji je trenutno na predmetu, podsjećam da se aktivnost na radionici boduje s 10 bodova, a sigurno će vam to dobro doći za kontinuiran prolaz predmeta i, eventualno, višu ocjenu. \n\nViše o CROZ-ovim konkretnim projektima možete vidjeti na adresi: https://croz.net/services/.\n\nAko želite sudjelovati na radionici, ali zbog nekog razloga - social anxiety ili drugo - nije vam ugodno paliti kameru i mikrofon, pošaljite mi pitanja koja biste imali o tvrtki ili o nekim općim stvarima u private message sa svojim imenom/inicijalima/šta god vam najviše odgovara, ja ću ih proslijediti moderatoru/ici pa će se tijekom radionice pročitati vaša pitanja. Imate moju potpunu diskreciju ukoliko vam je forumska anonimnost prioritet.",
      "votes": {
        "upvoters": [
          "Sulejman",
          "indythedog"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "151913": {
      "poster": "EstebanVihaio",
      "content": "[link za Teams meeting](https://teams.microsoft.com/l/meetup-join/19%3a3da1a72efa9e4ea998cb16328f0e0a04%40thread.tacv2/1614857552447?context=%7b%22Tid%22%3a%22ca71eddc-cc7b-4e5b-95bd-55b658e696be%22%2c%22Oid%22%3a%22e4e5aefe-26db-41af-bbf7-ff201a22396b%22%7d)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "163089": {
      "poster": "EstebanVihaio",
      "content": "_**\"Zašto je ,,Gdje se vidiš za tri godine?'' potpuno promašeno pitanje na bilo kojem razgovoru za posao\"**_\n\nOvo je naziv INŽEKO2 poslovne radionice koja će se održati ovaj petak, 9. travnja, od 16h (trajanje radionice nije fiksno). Radionicu će moderirati naš/a kolega/ica u pokušaju da atmosfera na radionici bude što ležernija. Radionica se odvija online preko platforme MS Teams, a gosti su Mura Kokotović i Krešimir Musa. \n\n_Mura Kokotović je CROZ-ova HR-uša. „Katica za sve“ koja brine o ljudima, znanjima, vještinama, željama i afinitetima, prigovorima i dogovorima, debljanju kolega slatkišima, miru u kući i općem zadovoljstvu u CROZ-u. Dokaz je da je diplomirani filozof i etnolog u stanju 14 godina živjeti sa softver inženjerima i razumjeti zašto se svađaju je li bolji Groovy ili Java. Njena misija je složiti projektni dream team (i onda to pokušati ponoviti na sljedećem projektu). CROZ-ov ljetni akcelerator (program studentskih ljetnih praksi) njen je ponos i dika._\n\n_Krešimir Musa je CTO u CROZ-u. Tijekom svoje karijere intenzivno je sudjelovao u projektima razvoja softvera, i to kao razvojni inženjer, te projektni i portfolio menadžer. Iskusan je u primjeni agilnih i iterativnih metoda razvoja softvera. Velik dio karijere bio je usmjeren na realizaciju projekata temeljenih na principima servisno orijentirane arhitekture, automatiziranog upravljanja poslovnim procesima i cloud-nativea. Jedan je od suosnivača udruge Agile Croatia._ \n\n\nSvi zainteresirani su dobrodošli! Ako znate prijatelje, poznanike, kolege koji ne slušaju ovaj kolegij ili pak nisu uopće s FER-a, a željeli bi slušati priču o ovoj temi, feel free proslijediti im poziv. Ako imate neka pitanja na koja biste željeli čuti odgovor u petak, a ne želite direktno na meetingu pitati, napišite ih ovdje pa će ih moderator/ica pročitati.\n\n@EstebanVihaio#151913 ovaj link zanemarite, na dan radionice ću u novoj objavi postaviti točan link",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "164567": {
      "poster": "EstebanVihaio",
      "content": "![](assets/2021-04-07/00049.jpeg)\n\n![](assets/2021-04-07/00050.jpeg)\n\nLink za pristup MS Teams meetingu u petak: \n\nhttps://teams.microsoft.com/l/meetup-join/19%3a3da1a72efa9e4ea998cb16328f0e0a04%40thread.tacv2/1617713274801?context=%7b%22Tid%22%3a%22ca71eddc-cc7b-4e5b-95bd-55b658e696be%22%2c%22Oid%22%3a%229c0437bd-4221-4626-9c2f-700d61b65380%22%7d\n\nViše o CROZ-ovim konkretnim projektima možete doznati na adresi:\n\nhttps://croz.net/services/.\n\nAko želite sudjelovati na radionici te imate pitanja koja zbog različitih razloga ne želite upitati sami, pošaljite ih u private message pa će biti proslijeđeni moderatoru/ici i bit će pročitani pod pseudonimom.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}