{
  "title": "Starlink, brzi net u selima",
  "creator": "Boobo-oobo",
  "slug": "starlink-brzi-net-u-selima",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "153638": {
      "poster": "Boobo-oobo",
      "content": "Pise da bu Starlink dostupan kod nas 2022, primaju pare za prednarudzbe. Jel bi to bila dobra alternativa za net u krajevima de optika nebu dosla jos valjda 10god?\n\nTrenutno sam u stanu u ZGBu sa optikom, al selim se na selo ove godine i internet mi bu najvise falel u mojoj selendri. Selo koje je 20km od Zagreba, di susjedna opcina ima optiku, al obzirom na stanje vlasti u opcini ne vidim da se bu tu nekaj brzo popravilo. \n\nKoje su druge alternative za imat min 100Mbps down, 10Mbps up, 4G/5G? \n\nI jel problem imat vise providera/prikljucaka na istoj adresi? Trenutno je tam T-com, al je brzina prek parica cca 10down, 2up.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153645": {
      "poster": "Vamonos (Idemo)",
      "content": "LTT je objavio par Starlink videa nedavno. Sustav se cini skroz ok. Sumnjam da ce kod nas biti masovno prihvacen pa ce broj korisnika po satelitu biti manji sto bi trebalo biti poprilican plus.\n\nT-com i drugi ISPevi ne bi trebali znati za Starlink. Ako pitas za T-com + npr. Iskon moguce je, ali nije jednostavno.\n\n4/5g je trenutno najbolja opcija samo naravno prije potpisivanja isprobaj mrezu ISPa ciji net mislis uzeti u kuci u kojoj ju mislis koristiti. Razlike znaju biti ogromne ( za primjer Tele2 ZG ~50Mbit, VG ~5Mbit; 4g). Ako nemas nista njihovo i ne daju ti par dana da vidis kako radi najlakse je kupiti SIM na kiosku staviti 20 kuna gore i tako isprobati.",
      "votes": {
        "upvoters": [
          "Boobo-oobo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153646": {
      "poster": "TentationeM",
      "content": "Satelitski Internet ti je obično očajno ograničen količinom prometa.\n\nPogledaj npr. https://intersat.hr/privatni-korisnici/paketi/satelitski-internet/.",
      "votes": {
        "upvoters": [
          "Boobo-oobo",
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153649": {
      "poster": "Vamonos (Idemo)",
      "content": "@TentationeM#153646 Starlink nije, barem ne jos",
      "votes": {
        "upvoters": [
          "Boobo-oobo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153650": {
      "poster": "AVRFreak",
      "content": "@Boobo-oobo#153638 \n\nNe znam iz koje si ti župe, ali provjeri jel imaš neku WiFi udrugu koja još nije mrtva u blizini:\n\nhttp://ffox.com.hr/udruge/\n\nTeško da budeš dobio 100Mbps down čak i ako si sretnik, ali alternativa je možda.",
      "votes": {
        "upvoters": [
          "Boobo-oobo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153659": {
      "poster": "[deleted]",
      "content": "Malo offtopic\n\nIma li tko iskustva sa onim 4G mobilnim \"prijenosnim kućnim internetom\" po selima, konkretno područje oko Plitvica (udaljeno 10-15km). Po T-Com karti je kao područje prekriveno, al mene zanima u praksi jel to funkcionira. Željene brzine su za remote posao i video konferencije, nikaj ludo. Fala",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "InCogNiTo124",
          "Mioch"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "153670": {
      "poster": "[deleted]",
      "content": "@Nostro#153659\n\nNekad je to bilo super jer je bila mala opterećenost mreže, danas je lutrija.\n\nMala napomena kad gledate ove stvari. Nije samo brzina bitna. \n\nbrzine čak mogu biti ok (tipa 50-60mbit down / 20-30 up). Ali često iako je brzina ok, i to dobro funkcionira za bilo kakav prijenos podataka koji se može bufferati. \n\nZa real time komunikaciju se ipak znaju javljati problemi zbog velike latencije, visokog packet lossa i slično. Pogotovo ako je odašiljač daleko, ako je ružno vrijeme ili ako se koristi tijekom dnevnog peaka potrošnje\n\nuvijek bih prije odabrao 10/5 žicu nego 100/100 4g. Osim ako imam baznu stanicu u blizini bez prepreka",
      "votes": {
        "upvoters": [
          "Boobo-oobo",
          "Filemon",
          "HeHe (Direktor života)",
          "InCogNiTo124",
          "Lyras",
          "Mioch",
          "NekocBraca",
          "Stimmar",
          "Svarog (Veles)",
          "[deleted]",
          "pitroid"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153673": {
      "poster": "[deleted]",
      "content": "@Psychosis#153670 \n\nPRO TIP.\n\nDanas je jako malo ljudi zakačeno na 3G mrežu, a puno je stabilnija za real time stvari od 4G.\n\nPo gradovima možda nije viable, ali  po zabitima pruža solidnih 7-8mbita down i 1.5-2 up.\n\nZbog pinga i brzine nije baš za gejmanje i strimanje, ali\n\nje sasvim dovoljno za telekonferencije uz minimum rizika da vam poziv prekida ili vam pukne veza",
      "votes": {
        "upvoters": [
          "Boobo-oobo",
          "Filemon",
          "InCogNiTo124",
          "NekocBraca",
          "Stimmar",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "153740": {
      "poster": "iLabaviUmeDaZabavi (prvi do boga)",
      "content": "Jbt nisam znao da je Gordan Sisul na studosima",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "GranAutismo",
          "HeHe (Direktor života)",
          "Mioch",
          "SinanSuckich (Yelena)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "153833": {
      "poster": "Boobo-oobo",
      "content": "@Vamonos#153645 \n\nZnaci satelit moze primiti X korisnika po full bandwithu, dalje svi trpe?\n\nI sjetil sam se da je bilo nesto na TVu za Starlink, HAKOM treba odobriti koristenje Starlink sustava il nesto u tom stilu, i da bu mozda to jos problem.\n\nMislil sam kak sad imam tam T-com, da uzmem recimo A1 4G prikljucak. To bi trebalo biti ok zapravo, jer nema veze sa fizickim paricama.\n\nIma i ova informacija : https://www.tportal.hr/tehno/clanak/hrvatski-telekom-u-naredne-tri-godine-razvija-optiku-za-135000-korisnika-diljem-hrvatske\n\nJa sam u opcini Jakovlje, Igrišće tocnije. Kolko god ovo lijepo zvucalo da bi T-com trebal do 2023. napraviti opticku mrezu za sva ova mjesta, nekak sumnjam da bu to tak brzo. Trenutno je koma situacija, znamo biti po par dana bez interneta jer su parice i ormarici na stupovima u koma stanju. Mravi su jednom prilikom napravili gnijezdo u ormaru, prije 2 tjedna su neki tehnicari popravljali u ormaru, onda nekaj sjebali i nisam imal interneta ni telefona, trebalo je 2 dana da dojdeju tehnicari to rijesiti.\n\n@TentationeM#153646 \n\nDal to ogranicenje ovisi globalno ili lokalno? Jel to broj korisnika po satelitu, recimo da sad ima 100 korisnika oko mene fizicki koji koriste net pa si smetamo, ili to ovisi jos i o globalno svim korisnicima?\n\n@AVRFreak#153650 \n\nKolko vidim, za opcinu Jakovlje nema nist dostupno.\n\nIsprobal sam speedtest danas, down je 4.23, Up je 0.54. Ak bu zena drzala predavanja, ja nekaj za posel delal, netko gledal YT i sl, to je drek od interneta.\n\nMislim da bum riskiral mozda tih 100USDa i dodatnih 300 il kolko jos za router, ak bu to rijesilo dobar dio problema. Ja bi isto radije fizicku vezu, i razmem da je to najbolje, al moram neku alternativu imat dok se to ne ostvari.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "154002": {
      "poster": "Vamonos (Idemo)",
      "content": "Svaki satelit ima (po zadnjim dostupnim informacijama) 500 MBita bandwidtha kojeg dijele svi korisnici unutar njegove celije. Celija je trenutno 25km x 25km. Ovo za HAKOM ne znam. \n\nA1 4G bi trebao biti skroz ok, da.\n\nMislim da je prvotno optika trebala biti dostupna u svim gradovima u RH do 2020. tako da se ne bih previse pouzdao u ove najave T-comove :\\",
      "votes": {
        "upvoters": [
          "Boobo-oobo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}