{
  "title": "Prebacivanje na drugi smjer na diplomskom",
  "creator": "misticni",
  "slug": "prebacivanje-na-drugi-smjer-na-diplomskom",
  "tags": [
    "FER",
    "Općenito"
  ],
  "posts": {
    "185097": {
      "poster": "misticni",
      "content": "sad sam na drugoj godini na E smjeru, i nisam siguran jel mi se svida ovaj smjer, pa bi htio skupiti sto vise info o potencijalnom prebacivanju na računarsku znanost.\n\njel ima neko ko se vec prebacivao? kako je polagao razliku? jel mogu upisati sve predmete na prvoj godini diplomskog studija uz predmete razlike i jel to pametno ? ili mozda da ih nekako odradim na trecoj godini uz sve ostale predmete koje moram upisati... sljedece akademske godine moram i mentora odabirati te temu za projekt... ocu li uzimati teme iz E smjera ili nekako i to prebaciti na teme iz R smjera??\n\nbilo kakav info ili prijedlog je dobrodosao!",
      "votes": {
        "upvoters": [
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "185102": {
      "poster": "rolotex (brr)",
      "content": "@misticni#185097 Ne znam kako je po FER2 funkcioniralo, ali koliko vidim ne moraš polagat nikakvu razliku za FER3 diplomski Računarstva https://www.fer.unizg.hr/studiji/dipl/rac",
      "votes": {
        "upvoters": [
          "misticni"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "InCogNiTo124"
        ],
        "tuga": []
      }
    },
    "185119": {
      "poster": "InCogNiTo124",
      "content": "@rolotex#185102 Za fer2 je trebalo polozit utr i opp ako se dobro sjecam",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Filemon",
          "Kushim",
          "misticni"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "185133": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @misticni#185097 sljedece akademske godine moram i mentora odabirati te temu za projekt… ocu li uzimati teme iz E smjera ili nekako i to prebaciti na teme iz R smjera??\n\nTo stvarno ovisi o tebi. Npr. nema razloga zašto ja ko računarac ne bi mogao uzeti mentora s E smjera. Dakle, nemoj se sad obazirati previše na to što znaš, razmisli što točno želiš raditi.\n\nJa ti ne bih preporučao da uzimaš R temu. Razlog za to je što vjerojatno kod praktičnog dijela štekaš. E sad, ti to možeš popraviti, možeš raditi i praktički u 3. godini nadoknaditi te stvari koje nisi imao. Po meni su ti najvažnije baze podataka, web dev, potencijalno za RZ i UTR/PPJ. Programsko inženjerstvo možda nije toliko bitno jer ionako nećeš steći to iskustvo u timu koje je u predmetu relativno bitno. Jbg, proliveno mlijeko. Ali iskreno, mislim da će ti to biti samo dodatan teret, jer nećeš moći zamijeniti postojeće predmete s tim.\n\nA što se tiče diplomskog R nakon preddiplomskog E, konceptualno nije toliko veliki problem. Ionako imaš ljude na R-u koji ne znaju ništa programirati i groze se svoje struke, i onda ćeš samo biti u zaostatku ko ti ljudi. Ali iz prve ruke ti mogu reći da ne propuštaš puno toga na preddiplomskom i da uz dovoljno volje i rada možeš nadoknaditi stvari. I ne samo to, u računarstvu ima puno tema gdje ti možeš spojiti E i R smjer ako nisi potpuno tranzicionirao, samo ovisi što te zanima.\n\n**Prije nego što išta radiš, daj se uvjeri da te zanima R, nemoj samo ići za time jer ti je E pljuga.** A i na kraju krajeva, na diplomskom imaš i IKT koji bi ti mogao biti interesantan i potencijalno lakša tranzicija.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "Filemon",
          "MarokMarsci (Collapse Enjoyer)",
          "[deleted]",
          "misticni",
          "whatTheHel"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "185137": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "BTW preimenovao sam temu u generalniji naziv da se mogu i druge kombinacije spominjati",
      "votes": {
        "upvoters": [
          "Katulich",
          "misticni"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "189990": {
      "poster": "misticni",
      "content": "@micho#185133 Hvala na opsirnom odgovoru, ali evo bas sam se dosta informirao u zadnjih tjedan dva o mom smjeru i msm da je to bio neki panic move od mene kad sam objavio post.",
      "votes": {
        "upvoters": [
          "Filemon",
          "MarokMarsci (Collapse Enjoyer)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Bananaking",
          "InCogNiTo124"
        ],
        "wtf": [],
        "tuga": [
          "Filemon"
        ]
      }
    },
    "232052": {
      "poster": "rolotex (brr)",
      "content": "jel se netko odlucio prebacit na r sa e smjera?",
      "votes": {
        "upvoters": [
          "gad_gadski"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "232079": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "@misticni#189990 druga godina e smjera je cisti CBT tako da razumijem zasto si razmisljao o prebacivanju\n\nbit ce bolje, ne brini se",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "232097": {
      "poster": "gad_gadski",
      "content": "@rolotex#232052 ja, zvat cu ovaj tj ili slj studentsku sluzbu da vidim sta ce bit s predmetima koji cu dodatno morat upisat, posto na ferovoj stranici pise da ce za svakog studenta odbor odlucivati koje predmete razlike ce student morati upisati",
      "votes": {
        "upvoters": [
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235808": {
      "poster": "pero",
      "content": "Ima li itko da se prebacivao sa R na E po FER3? Koji predmeti razlike se dobiju?",
      "votes": {
        "upvoters": [
          "gad_gadski"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "260761": {
      "poster": "misticni",
      "content": "@\"MarokMarsci [inactive]\"#p232079 cbt? hahah",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "260848": {
      "poster": "Kobe",
      "content": "Može li se prebaciti na diplomskom studiju sa jednog smjera elektrotehnike na drugi smjer elektrotehnike bez da se produžuje godina?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "260851": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"Kobe\"#p260848 Ako misliš modul (elektrotehnika je smjer), da, ali imat ćeš vjerojatno neke razlikovne predmete, pa je to ovisno o njima. Vjerojatno ti je lakše samo uzeti predmete s drugog modula jer ti je titula na istom smjeru ista, ako je to razlog premještaja.",
      "votes": {
        "upvoters": [
          "Kobe"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "260977": {
      "poster": "Kobe",
      "content": "E super to je točno što me zanimalo, zahvaljujem :)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}