{
  "title": "Škole stranih jezika",
  "creator": "johndoe12 (enaiks)",
  "slug": "skole-stranih-jezika",
  "tags": [
    "Opušteno"
  ],
  "posts": {
    "190093": {
      "poster": "johndoe12 (enaiks)",
      "content": "Par mojih dojmova:\n\n**Intellecta - Njemački A1 online** - 2x tjedno u večernjem terminu je bilo. Iznenađujuće brzo bi prošao sat jer je profa pripremila dosta online materijala. Ono što mi se izuzetno svidjelo je što smo puno komunicirali,što sa profom, što međusobno. Dakle fokus nije bio na čitanju tekstova i stalnom rješavanju zadatka kao u nekim školama nego je svega bilo podjednako. Profa je Nikolina Debeljak ako nekoga zanima.\n\n**Intellecta - Njemački A2 online** - ovdje mi je bila neka druga profa, koja je njemica, ali grozno priča hrvatski i msilim da je malo starija pa joj digitalni svijet nije išao od ruke. Cijela ta grupa bila je užasno spora jer je bilo i ekipe starije od 30g. Odustah nakon 1. tjedna.\n\n**ABC škola stranih jezika - Francuski A2 online** - užaaaasno sporo sve ide, tijekom jednog sata možda izgovorim ukupno 2 rečenice na francuskom jer se fokusira na objašnjavanje gramatike, iščitavanje teksta i onda skupno prevođenje cijelog teksta i profa troši onaako po 5-10 minuta da bi nekome u grupi objasnila zašto postoji subjonctif u frnacuskom a u hrvatskom ne. Možda je i do mene jer upisah razinu za koju već imam certifikat od pred 5 godina pa rekoh da se podsjetim, al očito bi bilo pametnij da sam u drugj grupi. U svakom sčučaju meni ovakav način rada nikako nije pasao jer je bilo minimalno komunikacije, više komunicarah s random erasmusovcima i francuzima na jarunu nego na tečju i shit u not.\n\nSPeaking of that.. ima li netko preporuku škole stranih jezika gdje mogu učit francuski i actually ga vježbat pričajući na satu, a ne spavajući ili pijančenjem od dosade?",
      "votes": {
        "upvoters": [
          "Filemon",
          "InCogNiTo124",
          "Kushim",
          "[deleted]",
          "[deleted]",
          "allophone",
          "feel_d_boot (iNut)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190096": {
      "poster": "feel_d_boot (iNut)",
      "content": "@johndoe12#190093 \n\nIskreno i mene zanima tvoje pitanje plus koliko si platija/la  te tečajeve?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190097": {
      "poster": "johndoe12 (enaiks)",
      "content": "@feel_d_boot#190096 u Intellecti su oko 2700 (u to je ukljucen popust od 30%)\n\nABC je bio oko 1500kn",
      "votes": {
        "upvoters": [
          "[deleted]",
          "feel_d_boot (iNut)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190098": {
      "poster": "feel_d_boot (iNut)",
      "content": "@johndoe12#190097 \n\nAsti gospu neću ja još proparlat druge jezike bar dok posa ne sidne",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "STAGGER_LEE",
          "[deleted]",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Filemon",
          "Gussy (huba buba)",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "Mioch",
          "NekocBraca",
          "Svarog (Veles)",
          "iLabaviUmeDaZabavi (prvi do boga)",
          "johndoe12 (enaiks)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "190215": {
      "poster": "Kushim",
      "content": "Slusao sam spanjolski za besplatno na FFZG, upisao sam ga bas kao izborni kolegij jedan semestar, a nakon toga opet spanjolski u centru za strane jezike ffzga.\n\n**Spanjolski kao kolegij** - Boze sacuvaj. Ne znam vise je li bilo jednom ili 2 puta tjedno, ali takvu katastrofu od predavanja nisam vidio nikad. Inace taj kolegij upisuju neki filozofi (tipa lingvistika) u sklopu svojih izbornih predmeta pa su svi osim mene i jos par ljudi bili FFZGovci. Vecina ih je normalna i oke, al na tom faksu se stvarno nadje i debila - jedan tip mi je pricao kako nije oprao zube jer je cetkicom strugao psece govno u koje je ugazio. U pocetku nas je bilo preko 50, da bi se u prvih par tjedana vecina ljudi prebacila kod druge prof. ili na druge jezike, tako da nas je tim tempom rasipanja ostalo najvise 10 i to njih 9 koji su rasturali spanjolski. Profa je imala filozofiju da mi i dalje ucimo kao trogodisnjaci i da cemo shvatit samo slusajuci kako ona i jos njih 9 koji rasturaju pricaju na spanjolskom. U 5 tjedna jedino sto sam shvatio je abeceda koju neki debili **pjevali** kroz neku pjesmicu (CRINGE). Jebi ga, uporan sam i samokritican pa sam nastavio dalje... U jednom trenutku se jedna studentica ustala i rekla kako kurca ne razumije vec 5 tjedana i posrala joj se po satu. Profa je na to odgovorila da ne moze ona svoj sat prilagodjavat nama koji ne znamo - iako smo bili na A1 razini te da u standardizirane razine znanja ne vjeruje. Nakon 7 tjedana nismo radili ni boje ni rodjake nit ikoji kurac al sam znao sta je subjuntivo. Ovih 9 sto je ostalo do kraja su debili koji su znali spanjolski (neki iz argentine, spanjolske i italije) i htjeli su svima to pokazati - tako da su se cesto smijali, dobacivali i odgovarali na tudja pitanja. Situacija maksimalno nadrealna. \n\nIma toliko anegdota samo ne znam kako ih strukturirati. Prof. je poticala maskiranje za halloween (CRINGE^2), tako da je talijanka (jedina) dosla obucena u neku vjesticu i to od glave do pete. Sjedila je u prvoj klupi i pola sata parlala/hablala s profom, da bi u jednom trenutku digla nogu iznad glave da bi pokazala cizme koje se poklapaju s cosplayom, a ne moram naglasiti da je bila u suknji.\n\nNa kraju semestra bio je pismeni i usmeni. Morali smo procitati Malog princa na spanjolskom. Pokusao sam, ali s mojim \"predznanjem\" jednostavno nije islo. Hvala bogu, na ferovoj referadi je bilo nekih problema pa nikad nisam sluzbeno upisao kolegij i jednostavno se nikad nisam vise pojavio.\n\nUkratko - profa je FFZG verzija [doktora Jusupa](https://www.google.com/search?q=provjereno+doktor+jusup) i njegove sestre.",
      "votes": {
        "upvoters": [
          "GetSchwifty (_2D_)",
          "InCogNiTo124",
          "STAGGER_LEE",
          "Svarog (Veles)",
          "[deleted]",
          "[deleted]",
          "aperture",
          "turunturu (Cement)"
        ],
        "downvoters": [
          "Johnny_Bravo (a beautiful and unique snowflake)"
        ]
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "Amon",
          "BreadCat",
          "Dome",
          "Emma63194",
          "GetSchwifty (_2D_)",
          "Mioch",
          "STAGGER_LEE",
          "Svarog (Veles)",
          "Widlar",
          "__builtin_popcount (std::popcount)",
          "aperture",
          "ataxia",
          "feel_d_boot (iNut)",
          "ivicato",
          "jobi (azex)",
          "sphera",
          "turunturu (Cement)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "190218": {
      "poster": "Kushim",
      "content": "**Centar za strane jezike FFZGa** - prvih godinu i pol smo imali prof. Cvetko, 2 puta tjedno. Mlada, energicna i pametna prof., usudim se reci da mi je bila najbolja prof stranih jezika u mom skromnom austrougarskom obrazovanju. Trudila se i ulagala vise vremena od onog sto se od nje trazilo. Nakon prvog semestra sam mogao poloziti A1, nakon drugog A2, iako smo sluzbeno bili na A1. Odlicne i efektivne domace zadace, individualan pristup nekim problemima ako ih je bilo. Za DZ smo skracivali (i na satu prepricavali) novosti koje smo procitali i/ili poslusali na spanjolskim vijestima, skracivali wiki clanke vezane uz neku temu (neki grad, povijesna znamenitost, licnosti...). Sve u svemu prof za 10.\n\nNakon nje dobili smo zamjensku prof koja je isto bila dobra, ali nakon zamjenske dosla je nova stalna koja je pocela stopama profesorice iz prethodne objave.",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "190223": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "[**Linguapax**](https://www.linguapax.hr/)\n\nProveo sam 9 godina uceci engleski tamo, dosao do Cambridge ESOL FCE (B2), CAE (C1) i CPE (C2) sve Grade A bez ikakvog posebnog truda. Odlicni ucitelji, odlicna nastava, razumna cijena, cijelozivotna prijateljstva. Uistinu imam samo najbolje za rec. Ako ste u podrucju vukovarsko-srijemske i trazite skolu stranih jezika, toplo preporucam Linguapax.\n\n>! ovaj post nije sponzorirao Berislav Božanović, ali ako upisete Linguapax i naidjete na Beru, pozdravite ga od mene",
      "votes": {
        "upvoters": [
          "Fica (Prof)",
          "Kushim",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "242232": {
      "poster": "johndoe12 (enaiks)",
      "content": "**Jezicni atelier** - au contraire de ABC, evo u ovoj skoli napokon pronadoh nacin rada koji mi odgovara... 70% konverzacija, vokabula, 30% gramatika. Idealno! Grupe su male, u mojoj nas je svega 4 što je super jer je lakše komunicirati u manjim grupama. Nastava je u nekim grupama online u nekim uživo. Cijena 2000 kn po modulu ( modul je A1.1 npr) ili 1800 kn za studente, nastava 2x tjedno po 1.5h.\n\nImaju u ponudi francuski, španjolski i engleski.\n\nTopla preporuka ove škole za sve koji se osjećaju da barataju gramatikom a fali im komunikacije!",
      "votes": {
        "upvoters": [
          "1vq",
          "STAGGER_LEE",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "297315": {
      "poster": "matt (Matt)",
      "content": "Koje su jače škole jezika za engleski u Zagrebu?\n\nZnam ga već dosta dobro ali htio bi proširiti vokabular, detaljnije se podsjetiti gramatike i generalno biti fluent u svim aspektima jezika. Ovo mi nije uvjet ali bilo bi fora kad bi imao literaturu/lektire koje moram čitati.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}