{
  "title": "[IRG] Ljetni rok - 2020/2021",
  "creator": "garica",
  "slug": "irg-ljetni-rok-20202021",
  "tags": [
    "FER",
    "Interaktivna ra캜unalna grafika",
    "Ispiti"
  ],
  "posts": {
    "211904": {
      "poster": "garica",
      "content": "Jel bi se u pripremi za ovo doslovno trebala procitat knjiga od 470 stranica? Ili se neke stvari preskacu?\n\nIma li smisla gledat video predavanja? Jos neki savjeti oko spremanja roka?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "212120": {
      "poster": "domagojj (VolimStopala游游뷣릖쇓릖)",
      "content": "@garica#211904 provjezbaj zadatke sa wiki, imas rijesene primjere na githubu i stari rokovi",
      "votes": {
        "upvoters": [
          "feel_d_boot (iNut)",
          "garica"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "212179": {
      "poster": "TheNubKiller (Lumpy)",
      "content": "I na MI i ZI od ona 4 velika zadatka, bar su se dva mogla u potpunosti rije코iti koriste캖i isklju캜ivo znanje sa labosa i wikija, tako da prvo 코to bih preporu캜io je usavr코iti sve te zadatke sa ferka. Ima코 jedan file na materijalima gdje su obja코njeni postupci za svaki zadatak. Iako zna코 rije코iti zadatak, pro캜itaj 코to pi코e u fileu jer ima par dobrih tipova iz teorije. Ja sam poku코ao gledati prezentacije ali je meni bilo nemogu캖e za pratiti... Ferko, ispiti, rokovi i teoretski se krpaj knjigom. Prijatelj mi je pro코le godine pro코ao na roku i za usmeni ka쬰 da pitanja dolazu uglavnom iz prezentacija i da je navodno prof. 콯eljka jako dare쬷jiva. Bitno da zna코 ne코to o pitanju, barem malo, ona 캖e ostatak 코to ne zna코 objasniti i dati dosta bodova. 콯elim vam svima sre캖u na roku :)",
      "votes": {
        "upvoters": [
          "Haki",
          "JoKing",
          "feel_d_boot (iNut)",
          "plavisnajper"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220528": {
      "poster": "Haki",
      "content": "Jel se zna ocemo dobit rezultate roka prije uvida i usmenog u ponedjeljak?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "220590": {
      "poster": "Haki",
      "content": "@Haki#220528 Dosli su bodovi",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "221664": {
      "poster": "blast",
      "content": "Usmeni se provodi odmah nakon uvida ili ako ne zeilite uvide odmah pisete.\n\nIzvlacite jednu karticu sa 2 pitanja i dolazite do profesorice kad ste gotovi.\n\nMoje pitanje.\n1. Perspektivno ispravna interpolacija z-koordinate. I kako se racuna.\n2.  Razlika izmedu homogenor i radnog prostora. Kako se racuna iz jednog u drugi. Kako se racuna derivacija. Raspisi.\n\n\n1. To nisam znao sta je uspio sam se snaci nekako pricajuci o perspektivnoj matrici. Al to je kao ako se pomaknes za jedan piksel dole na ekranu kolko se mjenja z. Imate na 3. preza 44 slajd.\n2.  Je bilo lagano. Homogena se koristi da se zeli pirkazati tocka u beskonacnosti i afine transofrmacije i sl. Samo se podjele sa h. To samo prvo trebate podjelit pa derivirat. Eventualno morate raspisati kao derivaciju 2 funkcije.\n\nOd kolega sta sam cuo. Naravno sta je gamut uredaj. Moze li se krug prikazati bezierovom krivuljom (NE). Gdje se zapiseuje mape sjena. LUT. Kako radi pracenje zrake algoritam... to je to sto sam se sjetio. \n\nSretno na jesen.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}