{
  "title": "[BAZPOD] Jesenski rok - 2020/2021",
  "creator": "bega (brga)",
  "slug": "bazpod-jesenski-rok-20202021",
  "tags": [
    "FER",
    "Baze podataka",
    "Ispiti"
  ],
  "posts": {
    "234571": {
      "poster": "bega (brga)",
      "content": "Za buduće generacije\n\nJesenski rok 2021 usmeni kod pintara\n- prvi zadatak relacija student + relacija mjesto, napisi koristeci relacijsku algebru kako izdvojiti maticni broj studenta i prezime onih studenata koji zive u mjestu cucurjevo ili tako neko mjesto\n  \n- drug zadatak - na slici ternarna veza, svaki entitet ima primarni kljuc, jedan ima jos ekstra obicni atribut, veza je N,N i 1 - napisi relacijsku shemu\n- onda je krenuo pitat usmeno, nesto za heuristiku u optimizaciji kaj nisam znala jer sam izginorirala tu lekciju (19. prez), kak ja nisam znala tak je pitao sve ostale u grupi\n- zatim pitanje zasto provodimo normalizaciju \n\n\nBasically nisam nis znala skroz jer sam se previse stresirala bezvez full je chill profestor, u prvom mi je falio dio di izdvajam matbr i prezime :clown:, drugi sam zeznula atribute veze, treci nisam znala i cetvrti sam nes zucnula i dao mi je prolaz, tak da ak zelite samo dvojku, osnove osnova su dovoljne - odmah na pocetku pita na sto ciljate, dvoje nas je reklo da nam je dosta dva, treci kolega je htio 3,4 i nakon ova  4 basic pitanja nam je svima dao sto smo htjeli\n\nTak da chill skroz, ak zelite vecu ocjenu nece ni to bit problem, ima spremna pitanja koja pita i vjj se ponavljaju",
      "votes": {
        "upvoters": [
          "Josipa (Zelda)",
          "bluedot97 (coreOf)",
          "macaklin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235651": {
      "poster": "Josipa (Zelda)",
      "content": "Takoder za buduce generacije - usmeni kod prof. Vrdoljaka\n\nDao je svima u terminu odgovaranja ista pitanja. Odgovara se na papir, on dode do tebe kad si gotov i pregleda. Po potrebi daje jos koji zadatak. Zadatci koji su meni bili:\n1. I 2.zad  -> dovest relaciju u 2.normalnu formu; zadani su atributi kao ABC->DEFGH... (zeznul se pa je stavio da su 1. i 2.zad identicni zadaci)\n\n3.zad -> terarna veza, odredit spojnost veze i koji su kljucevi veze (nama su bili student, profesor, predmet; dani su atributi entiteta)\n\n4.zad -> objasniti ACID svojstva \n\n5.zad -> objasniti sto su entitentski integritet i integritet kljuca\n\nJa sam na pismenom imala 26,5. Svi ovi zadatci su mi bili tocni, reko je da sam imala malo bodova na pismenom i dao mi 2. \n\nFrend je imo 28 na pismenom i dao mu je jos 2 pitanja za 3 (aktivnost kontrolnih tocaka i postupak obnove bp pomoću kontrolnih  tocaka). Mislim da je to neki klasik na usmenim ispitivanjima na feru - najvjerojatnije neces dobit nista puno vise bodova nego na pismenom... \n\nMoj zakljucak je da daje neka najosnovnija pitanja, vjerojatno ih cesto i ponavlja. Ako si napisao pismeni solidno, pitat ce te dodatna pitanja za vecu ocjenu. Ako se nauci ista teorije mislim da je tesko past kod njega.",
      "votes": {
        "upvoters": [
          "bega (brga)",
          "macaklin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235820": {
      "poster": "macaklin",
      "content": "Usmeni kod profesorice Mirte Baranović\n\nIšli smo jedan po jedan, prvo oni koji su bolje napisali ispit. Svakome bar malo pogleda šta je napisa i onda postavlja pitanja i nekad traži da se piše po ploči.\n\nNeka pitanja kojih se sjećam:\n\n- Nacrtati ternarne veze i koji su ključevi u tom dijagramu (ono N.N.N, 1.N.N itd., dobije se samo jedna)\n- Protumjere i Aspekti zaštite podataka u 17. prezentacije kao nabrojat?\n- 1NF, 2NF, 3NF šta su i kako se provode (može se na svom primjeru) + ono može li se odmah s 1. na 3. i to\n- mislim da je bilo nešto vezano za okidače?\n\nProfesorica je baš draga i strpljiva, ne pita previše, da se dobit i prolaz i veću ocjenu tako da samo smireno :) .",
      "votes": {
        "upvoters": [
          "bega (brga)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}