{
  "title": "[NOS] Jesenski rok - 2020/2021",
  "creator": "PudingIzMenze",
  "slug": "nos-jesenski-rok-20202021",
  "tags": [
    "FER",
    "Napredni operacijski sustavi",
    "Ispiti"
  ],
  "posts": {
    "235689": {
      "poster": "PudingIzMenze",
      "content": "Jesenski rok- 2020/2021",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235690": {
      "poster": "PudingIzMenze",
      "content": "![](assets/2021-09-10/00001.png)\n\n![](assets/2021-09-10/00002.png)\n\n![](assets/2021-09-10/00003.png)",
      "votes": {
        "upvoters": [
          "Daorson",
          "cajaznun",
          "jobi (azex)",
          "neZnamNista"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "236066": {
      "poster": "macan",
      "content": "Na usmenom ispitu je bilo cca 20 ljudi. Golub je bio super volje tako da je dosta ležerno izgledalo. Koliko se sjećam nije nikoga oborio. Na usmenom je svima dao 3 eliminacijska pitanja koja su se pisala na papiru. Ako si 2 pitanja znao a jedno ne - ponudi ti joker pitanje. Ako ne znaš 2 od 3 pitanja onda padaš. Ako uspješno riješiš taj prvi dio usmenog ponudi ti ocjenu 2 ili će ti dati još 3 pitanja za ocjenu u rangu od 1-5. Dosta je ljudi odmah prihvatilo ocjenu 2 al mislim da su pitanja bila iste težine za bilo koju ocjenu kao i za dvojku. Sve se piše na papiru pa kad netko završi digne ruku i čeka da profesor dođe kod njega.\n\nPitanja za dva su bila :\n\n1) Opisati protokol s putujućom značkom- u par crtica, nije tražio duge odgovore\n\n2) Nacrtati kerberos protokol bez sadržaja poruka M1,M2... nije trebalo znati koji je točno sadržaj u porukama, bilo mu je bitno vidjeti sudionike i tko kome šalje poruke, koliko ima poruka i koji je smjer komunikacije\n\n3)Nacrtati markovljev lanac za RAID 0 za 3 ista diska. Trebalo je označiti vjerojatnosti prelaska (ne brzine), nije trebalo dif jednadžbe pisati\n\nZa dvojku su imali svi ista pitanja, a za različitu ocjenu je mijenjao. Meni su bili \n\n1) Opisati korake Lamporta - nekome je bio ricart–agrawal\n\n2) Napisati sadržaje poruka u Kerbernosu\n\n3) Markovljev lanac za Raid 6 od 4 diska isto sa vjerojatnostima(ne brzinama)\n\nNekome je postavio za napise naredbe 4 za spajanje na standardni ulaz ili izlaz... Uglavnom dosta se tih pitanja ponavlja i nisu ništa teža od ovih za dva... \n\nA ocjenu ti ponudi ovisno koliko si imao na pismenom ispitnom roku, ja sam imao 32.5/50 boda i na usmenom mi je rekao da maksimalno mogu imati 4 zaključnu.",
      "votes": {
        "upvoters": [
          "_xXx_Matej_xXx_ (Mateejj)",
          "cajaznun",
          "rolotex (brr)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}