{
  "title": "[BIOINFA1] O predmetu",
  "creator": "mgd",
  "slug": "bioinfa1-o-predmetu",
  "tags": [
    "FER",
    "Bioinformatika 1"
  ],
  "posts": {
    "235818": {
      "poster": "mgd",
      "content": "Bioinformatika 1 dojmovi?",
      "votes": {
        "upvoters": [
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "235830": {
      "poster": "ink",
      "content": "@mgd#235818 Upiši ako radiš Završni iz Bioinformatike, inače ne. Više-manje se uče algoritmi usko vezani za bioinformatiku, koje na ispitima moraš provodit i skicirat na papiru. Cijeli predmet se svodi na algoritme za DNA/RNA sekvence (slično kao Dijkstra na Diskretnoj matematici 1, ili ona stabla s entropijama na Uvodu u Umjetnu inteligenciju, simuliraš algoritme na papiru da bi pokazao da ih znaš napamet.) Eventualno može bit malo zanimljivije ako te zanima natjecateljsko programiranje, jer se prolaze neki algoritmi za matchiranje stringova koji su primjenjivi i šire od DNA/RNA sekvenciranja. \n\nIspiti nisu preteški, ali nije tolko lagano imat 4 ili 5, osim ako ne radiš projekt za 100/100 bodova, šta bi preporučio, jer je samo nekoliko dana programiranja. \n\nI da, prezentacije su puno opširnije od onoga šta ti zapravo treba na ispitima, isplati se samo učit iz starih ispita i drillat te zadatke bez obraćanja previše pažnje na dokaze iz prezentacije od 20 stranica zašto neki ultra-komplicirani algoritam radi, i njegove optimizacije složenosti itd.",
      "votes": {
        "upvoters": [
          "cloudies",
          "mgd"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "273390": {
      "poster": "iNavy (mornar Ica)",
      "content": "@\"Klaud Konzultanta\"#p273369 nez za ostale ali bioinformatika ima mogućnost da odradiš jedan veliki projekt od 100 bodova pa ne moraš ići na ispite, a taj se projekt odradi u tjedan do dva",
      "votes": {
        "upvoters": [
          "Mike (Klaud Konzultanta)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274483": {
      "poster": "ljama_glama",
      "content": "@\"mornar Ica\"#p273390 @\"ink\"#p235830  o kakvom projektu je rijec?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274537": {
      "poster": "iNavy (mornar Ica)",
      "content": "@\"ljama_glama\"#p274483 znači postoje dvije vrste projekta, jedna koja nosi 40 i jedna koja nosi 100 bodova\n\nove od 40 su manje zahtjevne i može se raditi u većim skupinama, no tih 40 bodova nije dovoljno za prolaz pa treba pisati mi i zi (zi ima prag)\n\nove od 100 bodova imaju malo više posla, rade dvoje u grupi te se obično radi na optimizaciji nekog postojećeg algoritma, [ovo su prošlogodišnje teme koje su grupe dobivale](https://www.fer.unizg.hr/_download/repository/Projekti_100_bodova_2020_2021[1].pdf), te se prezentira rad pred kraj semestra",
      "votes": {
        "upvoters": [
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "274727": {
      "poster": "Tratarira",
      "content": "@\"ljama_glama\"#p274483 uz ovo sto je gore napisano prosle godine je bio i projekt za 100 bodova ali s tvrtkom NVIDIA. Dakle, imas lika koji ti da zadatak i ‘mentorira’ vas kroz semestar. Prosle godine je bio zadatak s Hammingovim udaljenostima izmedu niza i to je trebalo ubrzati na gpu. Preporucam da se uzme takva neka varijanta ako ce biti i ove godine, fora je iskustvo i nesto naucis i stvarno su svi bili simpaticni i pristupacni :)",
      "votes": {
        "upvoters": [
          "NailAndGear"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277372": {
      "poster": "Marko",
      "content": "Bioinformatika 1 tesko? Labosi?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277373": {
      "poster": "iNavy (mornar Ica)",
      "content": "@\"Marko\"#p277372 nema labosa, samo projekt i ispiti",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}