{
  "title": "[ICIR] O predmetu",
  "creator": "Dootz",
  "slug": "icir-o-predmetu",
  "tags": [
    "FER",
    "Interakcija čovjeka i računala"
  ],
  "posts": {
    "236301": {
      "poster": "Dootz",
      "content": "@SergeantPepper#138048 \n\nNastavak na ovo, zašto je Glavinić teški red flag? Interakcije čovjeka i računala mi se čini kao fora za slušat ali ne želim upisati nešto što je koma zbog nositelja.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277541": {
      "poster": "Ollie",
      "content": "@\"Dootz\"#p236301 \n\nMožda smo bili na predmetu skupa pa ti je sad jasnije zašto je red flag, ali za ostale\n\nnemojte upisivati ako ne planirate:\n- pisati esej svaki tjedan na temu članaka iz '88\n- razviti aplikaciju s inovativnom interakcijom u roku od 3 mjeseca\n- pisati seminar od 20 stranica o nekoj temi čiji članci datiraju iz vremena kada su se vaši roditelji upoznali\n- uz projekt, seminar i esej postoje i labosi (bar nisu teški) kao i MI i ZI \n\nPredavanja ne postoje, samo slajdove imate, ali ima konzultacija svaki tjedan dva, gdje vam prof gleda tko je u koliko sati skinuo materijale sa ferweba i komentira što ste predali\n\nPredmet bi bio super (lagan i s malo praktičnog rada) da materijali ne datiraju iz 80ih i da predavač ima više doticaja s novim aplikacijama i tehnologijama, pa da se nauči nešto o dizajnu sučelja i da to možeš barem nekako iskoristiti kasnije\n\nTakođer ako netko planira upisati Oblikovanje interakcije toplo preporučujem da preskoči, jer je prof u zadnjim konzultacijama rekao da će dati mali test onima koji upisuju oblikovanje a nisu položili interakciju...  stoga ponovite na brzinu sve materijale s interakcije i uljepšajte si dan. /s\n\nUpis na vlastitu odgovornost, bili ste upozoreni...",
      "votes": {
        "upvoters": [
          "Daeyarn",
          "MiqeloS",
          "Retard00"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}