{
  "title": "[OTVRAC] O predmetu",
  "creator": "spartanac555",
  "slug": "otvrac-o-predmetu",
  "tags": [
    "FER",
    "Otvoreno računarstvo"
  ],
  "posts": {
    "237069": {
      "poster": "spartanac555",
      "content": "Otvoreno računarstvo?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "237107": {
      "poster": "Avendo",
      "content": "@spartanac555#237069 zadaci lagani (ako si imao susreta s webom, html, css, javascript i php). Teorija dosadna, ali definitivno nije nista tesko",
      "votes": {
        "upvoters": [
          "spartanac555"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276149": {
      "poster": "jarza",
      "content": "## Otvoreno računarstvo\n\nTL;DR:\n\nPrvi ciklus priča o nekim generalnim informacijama i teorijica o otvorenim podacima, drugi ciklus te pretvara u kommre cyber security specialista. Predmet se skroz promijenio u odnosu na prošle godine tako da možda bude bolje/drugačije dogodine.\n\n**Predavanja** - idi na njih - postoje bodovi iz aktivnosti (ispunjavanje anonimnih questionnaire-a, jednostavni zadačići...), vrijede 20 bodova i prag je 8/20\n\n**Labosi** - 4 labosa (+ 1 opcionalan), zalažu se na dobro znanje web1 programiranja, radis na jednom te istom projektu pa ga kroz labose samo nadograđuješ. Radiš dataset, API za njega i na kraju ubaciš Auth0 login.\n\nIdeja nositelja je bila da nam daju video materijale preko moodela na pocetku tjedna pa da mi u petak na predavanju raspravljamo o tome. U stvarnosti skoro nitko nikad nije gledao materijale pa bi na predavanju bilo puno awkward tisina nakon sto prof pita nesto i nitko ne zna odgovorit. Ivana Bosnić predaje prvi ciklus, koji je dosta laksi i manje dosadan za slusat od drugog. Igor Čavrak predaje drugi ciklus ali tu mi je prestala volja za životom pa sam njegov ciklus manje/više zaobišao.\n\nLabosi su full konkretno programiranje, daju potpunu slobodu vezanu za izbor tehnologija, daju ti samo par bullet pointova o featureima koje moraš imati. Prvo napraviš dataset na neku proizvoljnu temu (npr. filmovi), na drugom napraviš mali web interface za taj dataset (stranica sa tablicom podataka, filterom, downloadom...), na trećem napraviš REST API te na zadnjem dodaš Auth0 autentifikaciju da se možeš prijaviti i pokrenuti neš malo koda. The catch is that moraš sam znat programirat - oni te ne uče ništa ali sam naučiš primijeniti ove stvari. Ovo mi se čini full korisno ali definitivno je i malo zahtjevno. Shoutout to the homie Branimir Pervan koji vodi labose, full chill i pristupačan lik.\n\nNa MI je bilo osam teorijskih pitanja - nije zahtjevno za naučit sve materijale na moodelu.\n\nNa ZI je bilo desetak teorijskih pitanja te jedno veliko programsko, na papiru \\:( moraš iskodirat frontend gdje uneseš ime nekog grada, to pinga tvoj backend i dinamički ti pokaže tablicu sa temperaturom. Na backendu si morao napisat par ruta za dohvaćanje fiktivnih API-a za temperaturu. \n\nTežina: **6.9 / 10**\n\nKorisnost: **5 / 10**\n\nBih li preporučio/la predmet: **Da, samo ako iskreno želiš raditi i malo patiti usput**",
      "votes": {
        "upvoters": [
          "joj (poni)",
          "mrkva"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277316": {
      "poster": "krle",
      "content": "### Otvoreno računarstvo\n\nPošto vidim da je moje mišljenje o predmetu dosta različito od ovog iznad, napisat ću i ja svoj dojam :D\n\nPredavanja - bio sam možda na prva 3, bodovi na predavanjima se ne dobivaju, osim kad je to najavljeno u obavijesti. Bodovi za sudjelovanje dobivaju se većinom na zadaćama koje nisu teške, većina mi je uzela oko pola sata. Ove kompleksnije nisam ni rješavao, imao sam oko 8/20 što je prag :D Prije svakog predavanja na moodleu se objave video predavanja, prezentacije i dodatni materijali. Na predavanju onda uglavnom odgovarate na pitanja koje prof. postavlja preko moodlea i diskutirate neke stvari (predavanja, tj. odgovori na pitanja ne nose bodove, osim ako ste između sa ocjenom pa ako ste bili na predavanjima možete imati veću ocjenu).\n\nLabosi - Postoje 4 obavezna labosa i peti koji nije obavezan. Prvo se radi baza podataka i podaci, nakon toga se radi aplikacija sa funkcionalnostima pretraživanja i preuzimanja podataka u JSON i CSV formatu. Nakon toga se radi API, i nakon toga se dodaje login. Prvi labos mi je uzeo 2h, drugi oko 6-8h, treći 2h i zadnji oko 1h. Ovo dosta ovisi o tome koliko dobro poznajete web programiranje. Tehnologiju birate sami. Na labosima pokažete što ste napravili i to je to. Ako vas zanima web, onda labosi nisu teški i dosta su zanimljivi. Peti labos je sudjelovanje na open source projektu koji nije obavezan i koliko sam vidio većina nas to nije napravila.\n\nMI i ZI - pogledajte kod kolege iznad :D Nisam se puno pripremao za njih i prošao sam bez problema. Za ispite je dovoljno proći prezentacije (i za ZI je potreban labos, no možete imati isprintani kod sa labosa)\n\nGeneralno nisam uložio puno vremena u predmet, a dosta korisnog sam naučio. Ima i dosta stvari koje mi neće trebati no to ovisi o vama :)\n\nTežina: 4 / 10\n\nKorisnost: Ovisi\n\nBih li preporučio/la predmet: Da",
      "votes": {
        "upvoters": [
          "jarza",
          "joj (poni)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}