{
  "title": "Mentor: Mirjana Domazet-Lošo",
  "creator": "laranotreallycroft",
  "slug": "mentor-mirjana-domazet-loso",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "6093": {
      "poster": "laranotreallycroft",
      "content": "Iskustva domazet loso, mile sikic,  maja matijasevic, mirko suznjevic?",
      "votes": {
        "upvoters": [
          "Anonimity (BoJack)",
          "amnael"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "8554": {
      "poster": "Kikyy99",
      "content": "@laranotreallycroft#6093 Domazetku imao, i sada mi je i mentorica za zavrsni, Iskreno, 0 problema, super zadovoljan. Zajebao sam tisucu puta, te dobio tisucu i prvu sansu. Uvijek je sve objasnila, dala smjernice i upute, definirala okej rokove i uvijek bila opcenito razumna i susretljiva. Nije zahtjevna i ne tjera na rad, ali ako si entuzijastican moze zadati i po potrebi i pomoci sa zahtijevnijom temom.\n\nBtw - ovo podrucje bioinformatike -- ja sam kontao da ce to imati vise veze s biologijom. A to je zapravo ono ASP na steroidima gdje se radi sa A, C, G, T umjesto X, Y, Z, W ili gdje su imena fileova imena proteina. Sam mali warning da ne budes razocaran/a",
      "votes": {
        "upvoters": [
          "ALovelace",
          "Anonimity (BoJack)",
          "BigZ1",
          "Bobicki",
          "KitKat (H(x))",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "cajaznun",
          "idontwannabemyself",
          "laranotreallycroft",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293323": {
      "poster": "BugsBunny",
      "content": "@\"Kikyy99\"#p8554 A kakav je preddiplomski projekt kod nje?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293347": {
      "poster": "Log3 (Jahač Kali Yuge)",
      "content": "@\"BugsBunny\"#p293323 Na što točno misliš? Područje koje se obrađuje, težinu projekta i završnog rada, koliko je ona stroga...?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293377": {
      "poster": "BugsBunny",
      "content": "@\"China numba wan!!\"#p293347 Ma bilo sto. Kako projekti izgledaju, teme/grupni rad/tezina... Za zavrsni otp znam, ali ako imas kakav info dobro bi mi doslo. Kolika je uopće navala kod nje, trebam li već slati mail?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293400": {
      "poster": "Log3 (Jahač Kali Yuge)",
      "content": "@\"BugsBunny\"#p293377 Projekt ovisi od godine do godine. Ove , a mislim i prošle godine se radilo kao na nekoj primjeni strojnog učenja u klasifikaciji bolesti pomoću Weka-e. Na projektu radite svi koji ste kod nje na preddiplomskom, ali msm da se nudi i opcija da se grupirate ako vam se baš razilaze interesti (ovo bolje da pitaš nju u mailu). Ništa strašno, makar bih ti preporučio da ako se dogovoriš s njom za mentorstvo, prije odabira teme za projekt odabereš o čemu želiš pisati u završnome radu tako da joj daš prijedlog da se u sklopu projekta kreneš baviti tom temom i posljedično olakšaš pisanje završnog, a ne da bezveze trošiš vrijeme na nešto što vidiš prvi i zadnji put u životu. Bodovanje projekta je bilo i više nego korektno, oko toga ne moraš imati apsolutno nikakve brige.\n\nOve godine je uzela 5-ero studenata na preddiplomskom. Kolika je navala isto vjv ovisi o generaciji, ali kao i sa drugim mentorima, nemoj si to ostavljati za zadnji čas jer je prošle godine potkraj lipnja imala sve popunjeno. Što se tiče tema na završnom najbolje je da si pogledaš na dabru popis radova gdje je ona bila mentor, s time da se u zadnje vrijeme nudi studentima i mogućnst tema iz pordučja strojnog učenja u bioinformatici.\n\nOčekuje da radiš kontinuirano, koliko god to malo bilo, ali te ne bude prekoravala ako nisi napravio što si trebao. Sastanci su u pravilu svaki tjedan, nekad dva. Ak ćeš imat još kakvih pitanja slobodno reci.",
      "votes": {
        "upvoters": [
          "BugsBunny"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "293413": {
      "poster": "BugsBunny",
      "content": "@\"China numba wan!!\"#p293400 Super! Hvala ti puno:)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}