{
  "title": "Mentor: Stjepan Groš",
  "creator": "Hrvoje (Hrvoje45)",
  "slug": "mentor-stjepan-gros",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "6831": {
      "poster": "Hrvoje (Hrvoje45)",
      "content": "Stjepan Groš, Marin Golub, netko drugi, općenito sigurnost (računala, sustava i slično), iskustva, savjeti?",
      "votes": {
        "upvoters": [
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "9400": {
      "poster": "Cvija",
      "content": "@Hrvoje#6831 Što se tiče Stjepana Groša, on traži da baš radiš, na to mislim da mu moraš svaki tjedan slati bilješke i obrazložiti što ćeš napraviti do idućeg tjedna (ne znam rade li to drugi mentori). Osim toga, teme koje kod njega dobiješ za završni ponekad nisu fiksne. Pod tim mislim da ono što ti je tema završnog rada to moraš napraviti, ali to je samo okvirno, tj. dosta ćeš istraživati i ako se nađe nešto što možeš implementirati, to ćeš vjerojatno i implementirati. \n\nZahtjeva da dosta komuniciramo s njim, što je po meni i u redu. Ovo sve govorim iz osobnog iskustva, trenutno sam kod njega i svaki tjedan po nekoliko sati radim na završnom radu. Pod radim mislim istražujem (trenutno).\n\nDosta je susretljiv i spreman pomoći čak i ako se pogubiš u tome svemu. Čini se strog, ali možeš mu reći i upitati što god te zanima, a ako ne stigneš nešto napraviti, neće te grditi zbog toga.",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "in1",
          "nnn (dinoo)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272760": {
      "poster": "Mariox",
      "content": "tl;dr: pomoći će kad tražiš pomoć, susretljiv je do normalne razine i ima sistem koji funkcionira\n\nza završni projekt (semestar prije završnog rada) sam imao temu koju sam sam predložio. Za završni sam imao temu koju su on (i njegov asistent) predložili. Tjedne bilješke su obavezne, i ima neke bodove za svaki tjedan. Ti bodovi su uvedeni ja mislim samo za one koji planiraju sto manje moguće radit pa da mentor ima nešto konkretno da ocjenjuje takve. Za mene i pretpodstavljam i ostale koji normalno rade nije nikad ni spominjao te bodove ili konačni broj bodova. Preporučam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}