{
  "title": "Mentor: Ante Đerek",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "mentor-ante-derek",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "6849": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Hrvoje#6831 Mislim da ti je na faksu najjači profesor za sigurnost Đerek. Srećom uz njegovu sposobnost ne dolazi i autizam, a i nisam čuo loše stvari o njemu ni kao profesoru, ni kao mentoru. Osobno sam osim predavanja imao jedan exchange s njim u vezi labosa iz PPJ, dobio sam dojam da je strog, ali i pravedan i susretljiv. Ovako ko osoba na predavanjima je znao biti malo edgy xD",
      "votes": {
        "upvoters": [
          "Filemon",
          "Hrvoje (Hrvoje45)",
          "InCogNiTo124",
          "McKovalski",
          "Svarog (Veles)",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "chuuya (temari)",
          "in1",
          "ink",
          "miss_anthropocene (neunist.iva)",
          "nnn (dinoo)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42633": {
      "poster": "Erpeg",
      "content": "jel ima neko iskustva sa prof Đerekom\n\njedino sto sam do sad vidio je ovo @micho#25856",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42635": {
      "poster": "InCogNiTo124",
      "content": "@Erpeg#42633 I summon @Svarog",
      "votes": {
        "upvoters": [
          "Erpeg",
          "Svarog (Veles)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "42705": {
      "poster": "Svarog (Veles)",
      "content": "@Erpeg#42633 Da, imao sam ga na preddipl. seminaru, projektu i završnom. Dopušta slobodu odabira teme (ako je naravno vezana uz njegovo područje interesa, naime sigurnost, naročito ona koja se odnosi na raspodijeljene sustave poput blockchaina i sl.), također će te rado usmjeriti i predložiti nekoliko tema.\n\nŠto se tiče njegovog principa rada i metodologije, učestalost sastanaka raste kako radovi postaju složeniji i formalniji (tako smo tjedno imali kratke sastanke za završni rad kako bi pratio razvoj i mogao dati prijedloge, dok su za seminare bili dva obvezna checkpointa, a sve ostalo po dogovoru ako me sjećanje ne vara). Zadaje okvirne rokove koji se mogu pregovarati i micati po potrebi te je obziran spram naših drugih predmetnih obveza. Sastanke se isto tako mogu odgoditi po potrebi ako se ništa nije uradilo od prošlog bez ikakvog negodovanja. U tom bih ga smislu opisao da je opušteno formalan, on se oslanja da su studenti dovoljno odgovorni te ne vrši dodatne pritiske.\n\nAko imaš još kojih pitanja, slobodno se javi. Rado ću biti od pomoći",
      "votes": {
        "upvoters": [
          "Emma63194",
          "Erpeg",
          "InCogNiTo124",
          "[deleted]",
          "[deleted]",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "295230": {
      "poster": "MaliPan",
      "content": "Zna netko kolko mu treba otp da odgovori na mail za mentorstvo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "295258": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"MaliPan\"#p295230 Don't want to let you down, ali koliko sam čuo od kolega prošlih godina koji su kod njega, on popuni svoju kvotu vrlo rano. Legende kažu da mu do 1.3. ostane možda 1 ili 2 mjesta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "the_old_bear_"
        ],
        "tuga": []
      }
    },
    "295267": {
      "poster": "Log3 (Jahač Kali Yuge)",
      "content": "@\"Alfetta\"#p295258 Lol ne, prošle godine se ljudima koji su mu se prethodno mailom javili za mentorstvo, javio tek na početku 9. mjeseca sa molbom za  detaljnijim opisom čime se žele baviti i prijepisom ocjena.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "295269": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@\"ᚾᛟᚱᚦᛗᚨᚾ\"#p295267 Vjerojatno ovisi od godine do godine, u mojoj generaciji su rano popunili ljudi kvote, sad je možda izmijenio taktiku radi FER3\n\nU svakom slučaju se bolje što ranije javiti jer nije bezvezni mentor",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)",
          "Log3 (Jahač Kali Yuge)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "295446": {
      "poster": "MaliPan",
      "content": "@\"ᚾᛟᚱᚦᛗᚨᚾ\"#p295267 da, evo odgovorio je da mu se javim na jesen\n\nmislite da se isplati cekat ili da se nekom drugom javim?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}