{
  "title": "Mentor: Igor Sunday Pandžić",
  "creator": "turunturu (Cement)",
  "slug": "mentor-igor-sunday-pandzic",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "9526": {
      "poster": "turunturu (Cement)",
      "content": "Ima netko iskustva sa Sunday Pandzicem?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ]
      }
    },
    "9710": {
      "poster": "Amali (Amajli)",
      "content": "@turunturu#9526\n\nWell, nez kaj tocno trazis so here's what I remember.\n\nBio mi mentor na pdp, osobno nisam nes pretjerano pametno radila za zavrad, al ima svakavih raznovrsnih tema makar ih se bas sad vise i ne sjecam (msm da ima negdje stranicu nekih proslih radova njegovih studenata iako nez sad vise jel ima za zavrad il samo PPP).\n\nBio je dosta opusten oko svega no ja sam imala neku easy temu i 0 nadgledanja jer mi nije nikaj zavodski trebalo, al msm da je oko samih radova opusten generalno i dostupan je za pitanja. Jednostavno mi je ostao dojam - chill. Prepusta studentu da mu se javlja koliko hoce, a ne mora uopce do samog kraja (ili vec po potrebi oko rokova predmeta Zavrad) i to nam je bas rekao sam da je imao studente koji su prosli bez da su se culi citav semestar; dakle sva organizacija je na tebi, a on je dostupan za pomoc i pregled rada ako treba.\n\nMislim da je generalno podrucje grafika, VR, stvarcice s Visage tehnologijom (pracenje lica, ociju...).\n\nPPP smo imali Kinect igru npr, iako je Kinect mrtav i ima najgoru mogucu dokumentaciju i onak jako malo primjera i previse neodgovorenih pitanja i problema po forumima i S/O, no okej. Mozda se moze i nes VR kod njega, znam da se bar moze za zavrad. Za PPP nas je doduse bilo od vise mentora skupa (bilo nas je 8, od 3 mentora lol) i sve je islo Suznjevicu - pitanja, dokumentacija na pregled, i sl.\n\nZavrad su bili\n- VR + lag = experience?\n- tri teme s Visageom (pracenje ociju i crtanje pomocu ociju, detekcija lica i crtanje naocala na lice, detekcija lica i pracenje lica te renderanje virtualnog okruzenja na temelju toga*)\n- jedna vrsta renderanja grafike (shaderi basically al bilo je kind of simplistic i basic i neki minimalni uvjeti lol, to je moje)\n\n\\* Zamisli FPS + oruzje/pogled se okrece lijevo desno ovisno o polozaju glave. Ima irg stvarcica u tom (ima jedan labos s tim pogledom n shit lol, perspektiva i tako to), sjecam se matrica hahah so basically visage+irg? Prema prezi se cinilo da nije sam koristen engine i njihov 3D shit\n\nEdit\n\nProbala sam nac stranicu al nisam previse motivirana, kind of sam sigurna da je nekaj s hotlabom al ono na ferwebu je broken, bar na mobu, a nisam ni ziher da je bilo hostano na ferwebu\n\nNazalost nemam te stare mejlove \\:S",
      "votes": {
        "upvoters": [
          "Amon",
          "Ducky",
          "Hrvoje (Hrvoje45)",
          "Svarog (Veles)",
          "turunturu (Cement)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ]
      }
    },
    "9733": {
      "poster": "Marenix",
      "content": "@turunturu#9526 \n\nNa hotlabu imaš teme i neke stare radove koji su se radili. Sam otvaraj na laptopu, jer na mobu ne radi, ne znam zašto",
      "votes": {
        "upvoters": [
          "Amali (Amajli)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "51784": {
      "poster": "Amali (Amajli)",
      "content": "@aerius#51563 za sundaya ez forum search, man\n\n@Amali#9710 @Marenix#9733",
      "votes": {
        "upvoters": [
          "aerius"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}