{
  "title": "Mentor: Damir Pintar",
  "creator": "Joji",
  "slug": "mentor-damir-pintar",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "10113": {
      "poster": "Joji",
      "content": "@Rene#9582 Pintara sam imao na projektu i seminaru, a sad ga imam i na završnom radu. Generalno je jako opušten i daje puno slobode studentima. Pokriva jako širok spektar tema, od klasične izrade aplikacija do big date i strojnog učenja. Za projekt smo kolege i ja radili implementaciju nekih algoritama strojnog učenja, što mi je dosta pomoglo da shvatim kako rade ispod haube, a za završni rad radim analizu sentimenta na tweetovima, što je tema obrade prirodnog jezika.  Na projektu nije provjeravao napredak, a za završni je samo rekao da ga probamo napisati bar tjedan dana prije roka za predaju da ga može pročitati prije konačne predaje. Osobno sam zadovoljan i mislim da je odličan izbor ako želiš ući u svijet strojnog učenja i analize podataka. U tom slučaju preporučam i njegovu vještinu Osnove programskog jezika R.",
      "votes": {
        "upvoters": [
          "2more (Shooshur)",
          "Filemon",
          "Rene",
          "indythedog",
          "menace_master"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "167434": {
      "poster": "MEasy",
      "content": "Ima li neko iskustva s Damiron Pintaron.. ili mozda prijedlog nekog za Big Data i opcenito podrucje di se vise radi s podacima\n\nHvalaa",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "167478": {
      "poster": "Joji",
      "content": "@MEasy#167434 Ovdje imaš moj odgovor od prošle godine: @Joji#10113. Još da se updateam, Pintar je nedavno dobio neki projekt punog naziva: Sustav umjetne inteligencije za autonomni nadzor i upravljanje sigurnosti cloud okruženja – AI DEFENDER pa će dio završnih i diplomskih radova biti na tu temu.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "MEasy",
          "gamigugi"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "292207": {
      "poster": "Vonj",
      "content": "@\"NailAndGear\"#p292202 \n\nZa ostale ne znam, Pintar sigurno ne trazi upisivanje bilo kojeg kolegija.\n\nJa sam na projektu radio  analize velikih skupova podataka (Recommender sustavi), a na zavrsnom sam ML radio, bez da sam upisivao SAP,  tako da se moze bez problema.\n\nSAP je koristan, ali po meni nije sad to The predmet. Ako ti vec bude nes trebalo od toga, mozes uzeti Walpolea i proci na svoju ruku.",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}