{
  "title": "Mentor: Stjepan Bogdan",
  "creator": "zeroth",
  "slug": "mentor-stjepan-bogdan",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "11717": {
      "poster": "zeroth",
      "content": "Ima netko iskustva sa Stjepanom Bogdanom?",
      "votes": {
        "upvoters": [
          "ink"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12005": {
      "poster": "NekocBraca",
      "content": "@zeroth#11717 I summon @Kranich",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12064": {
      "poster": "Kranich",
      "content": "@zeroth#11717 \n\nJa sam kod profesora Bogdana, za sada sam imao seminar, projekt, završni i trenutno diplomski seminar. Meni osobno je super kod njega. Bogdan je dosta opušten i smiren, takva je i atmosfera kad si s njim na sastanku tak da tu nema stresa.\n\nKada biraš teme za npr. završni dobijes asistenta s kojim zapravo sve radis i s kojim si u kontaktu (ja sam i s asistenitama imao samo pozitivna iskustva i koliko znam generalno su svi super, al your mileage may vary). S Bogdanom onda svakih par tjedana bude neki sastanak s gdje se lijepo popriča i on da neke savjete. Kao teme generalno radis nesto sto ce njima (LARICS-u) isto biti korisno (mozes pogledat njihove projekte na webu (https://larics.fer.hr/)).\n\nPrediplomski projekt radiš u grupi, generalno oko 8 studenta, i tu se cesto radi nesto s dronovima (on vam dodijeli temu) da se naucis raditi u okolinama vezanim uz robotiku.\n\nZavršni sam biraš temu s dosta velikog popisa projekata u larics-u koji ne moraju nužno biti kod Bogdana (Orsag, Kovačić i ostala ekipa iz LARICS-a su svi na popisu i smiijes ih izabrat bez problema). Teme idu od dronova (toga njavise), robotskih ruka, multirobotskih sustava, computer vision , raznih algoritama i optimizacija itd. Osobni mi je zavrsni stvarnu uzeo puno vremena i nije bilo jednostavno, ali mi je to bilo do sad najzanimljivije iskustvo na faksu.\n\nUglavnom kod njega ces morat ulozit dosta truda, ali su teme stvarno svakakve i ako te zanima robotika, zelis o tome ucit i imas volju radit svakako preporucujem.",
      "votes": {
        "upvoters": [
          "ALovelace",
          "Bobinator",
          "NekocBraca",
          "[deleted]",
          "krle",
          "zeroth"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12103": {
      "poster": "NekocBraca",
      "content": "@Kranich#12064 a nisi spomenuo da se dosta njegovih studenata zaposli u gideon brothers, a i da je tebi pomoglo za nac posao u struci",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)",
          "InCogNiTo124"
        ],
        "wtf": [
          "Kranich"
        ],
        "tuga": []
      }
    },
    "12107": {
      "poster": "Gussy (huba buba)",
      "content": "@NekocBraca#12103 kakovi su to jevreji",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12111": {
      "poster": "zeroth",
      "content": "@Kranich#12064 Puno hvala",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "12366": {
      "poster": "Bobinator",
      "content": "@Kranich#12064 Znas li mozda kako oni inace stoje sa slobodnim mjestima? tj jel da se samo prijavim kad dode vrijeme za to ili mi je pametnije poslat mail nekad ranije i pitat ako bi mogao kod njih?",
      "votes": {
        "upvoters": [
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}