{
  "title": "Mentor: Jan Šnajder",
  "creator": "Deks",
  "slug": "mentor-jan-snajder",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "19896": {
      "poster": "Deks",
      "content": "Jan Šnajder iskustva?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "19897": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "@Deks#19896 @Asura",
      "votes": {
        "upvoters": [
          "Deks"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "19901": {
      "poster": "Asura (Asura)",
      "content": "@Deks#19896 \n\nNadam se da znas da za Snajdera moras napisati CV, motivacijsko i proci intervju. Ako ti to nije turnoff onda  mozemo dalje.\n\nSnajder je jako lezeran mentor, nece te nikad pritiskat s rokovima. Tokom seminara ce biti skroz lezerno i necete se skoro nikad ni vidit. Na projektu ipak krene neko ocekivanje pa se mozda i susretnete svakih par tjedana. Sto se tice diplomskog rada, moglo bi biti sastanaka na tjednoj bazi.\n\nAko te zanima NLP, nemas opce dvojbe jer je to jedini izbor. Makar taj jedini izbor je jako dobar izbor iz mog iskustva.\n\nTakodjer neces imati puno obveza o upisivanju predmeta, vjerojatno ce ti preporuciti da upises najlakse predmete.\n\nEDIT1:\n\nZaboravio sam reci jednu bitnu stvar, najvise ces morati raditi sam, nemoj ocekivati puno pomoci. Snajder ima previse obaveza. Pod sobom ima nekoliko doktoranada i masu studenata.\n\nEDIT2:\n\nSjetio se opet jos bitnije stvari. Uglavnom, koga god zanima NLP, najveci benefit ce biti ovo. Prisustvo na TakeLab-ovom slacku. Tamo Snajder salje sve moguce NLP ponude za studente iz svih dijelova svijeta + moze se postaviti bilo kakvo pitanje u vezi NLP-a  i dobiti instantan odgovor od ostalih ljudi na kanalu.",
      "votes": {
        "upvoters": [
          "Deks",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "20584": {
      "poster": "[deleted]",
      "content": "@Deks#19896 Meni je prof. Šnajder mentor od projekta, nisam ga imao na seminaru, a sad kod njega radim završni.\n\nProjekt je bio dosta ležeran, kao ekipa (u tom trenutku nas 8) birali smo temu s kojom ćemo se baviti i zatim smo se podijelili u 2 tima koju su svaki za sebe radili na tome. Teme su bile takve da je zapravo svatko mogao raditi svoj dio posla i proučiti ono što ga više zanima, bilo to klasično strojno učenje, duboko učenje ili bilo što drugo u kombinaciji sa NLPom. Svaki tjedan smo imali sastanak na kojem smo kao tim davali izvještaj o tome što smo radili i što planiramo, ali to nije bilo ništa ozbiljno, već čisto ovako da imamo osjećaj da stalno nešto radimo. Dok smo radili projekt znali smo imati mini predavanja iz nekih stvari iz područja strojnog učenja i NLPa, što dođe zgodno kad krećeš učiti nešto novo. Na ocjenjivanju projekta bio je darežljiv. \n\nZa završni rad nas je pitao što nas zanima i okvirno čime se želimo baviti, bitno je da ima iole veze sa NLPom i stvarno nudi širok spektar tema. Isto imamo sastanak svaki tjedan, čisto da kažemo što radimo i što planiramo i pitamo što nas zanima ako imamo nekakvih problema. Kad vam je prof. Šnajder mentor ubaci vas u TakeLab Slack i to je odlična stvar. Možete uvijek pitati za pomoć oko bilo kojeg dijela završnog, a i neka generalna pitanja vezana za kodiranje ili bilo što, tako da to nadomjesti to što on sam baš i nema vremena na bacanje.\n\nRačunajte da se morate dosta rano javiti, čini mi se da sam mu ja negdje u ovo vrijeme godine slao mail, možda i ranije.\n\nI rekao bih da mu ocjene nisu bitne kad se javite.",
      "votes": {
        "upvoters": [
          "Deks",
          "Lyras",
          "Quentin"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "26658": {
      "poster": "Aloko (Ardeo)",
      "content": "Jel nekom odgovorio Jan Snajder i kakav je bio odgovor?",
      "votes": {
        "upvoters": [
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "26661": {
      "poster": "Lyras",
      "content": "@Aloko#26658 Poslao sam mu upit, onda me tražio CV, poslao sam mu to te mi se javio da ce me kontaktirati za intervju u idućih par tjedana",
      "votes": {
        "upvoters": [
          "Aloko (Ardeo)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "26684": {
      "poster": "Aloko (Ardeo)",
      "content": "Jel itko zna kako izgleda taj intervju kod Šnajdera?",
      "votes": {
        "upvoters": [
          "mariak (kaiak)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "mariak (kaiak)"
        ]
      }
    },
    "26689": {
      "poster": "Lovren97",
      "content": "@Aloko#26684 Dođeš kod njega u laboratorij i bit ce ti on i vjv jedan od asistenata (sad ce vjv to biti online). Atmosfera je relaksirana i neće te ispitivati o gradivu ili slicno, već će uglavnom pitati samo o tebi i sto te zanima i zasto zelis njega za mentora i imas kakve ideje mozda sto bi volio raditi. Zatim ce reci sve o TakeLabu i cime se bave i tako. Sve u svemu jako opušteno.",
      "votes": {
        "upvoters": [
          "Aloko (Ardeo)",
          "NekocBraca"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "janeromero (Serial Number Q5U4EX7YY2E9N)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "30212": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "U kojem formatu treba biti CV za Šnajdera?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "30273": {
      "poster": "Lovren97",
      "content": "@ErnestHemingway#30212 mislim da mu nije to bitno. Ja kad sam slao sam slao u europassu, no mislim da mu mozes i drugaciji format.",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "janeromero (Serial Number Q5U4EX7YY2E9N)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "30275": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@Lovren97#30273 A što si sve stavio od informacija jer malo mi je debilno navoditi studentske poslove za mentorstvo",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "30279": {
      "poster": "Amali (Amajli)",
      "content": "@ErnestHemingway#30275 Zas bi pobogu bilo debilno? Ak trazi CV, oce vidjet sta si radio u podrucju njegovog rada - to su projekti, a ako si radio u tom podrucju onda i poslovi. Poslovi u tom podrucju samo dodatno pokazuju da si radio vec na necemu takvom. Ako je posao nes **nepovezano** s podrucjem, to naravno nema previse smisla, al ista stvar vrijedi i za prijave za posao.",
      "votes": {
        "upvoters": [
          "InCogNiTo124",
          "MiqeloS"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "30284": {
      "poster": "Lovren97",
      "content": "@ErnestHemingway#30275 ma i ja tada nisam imao nikakva postignuca al sam napisao ove studentske poslove i slicno... mislim da ti njemu nije to toliko vazno, koliko intervju i motivacijsko :)",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "janeromero (Serial Number Q5U4EX7YY2E9N)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "43711": {
      "poster": "Lyras",
      "content": "Šnajder je napravio selekciju",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Asura (Asura)"
        ],
        "wtf": [],
        "tuga": [
          "soplagaitas (sopla)"
        ]
      }
    },
    "44122": {
      "poster": "Masperado",
      "content": "Bit će ovo duži post, no evo nakon što sam proša sve i svašta na ovom faksu, dat ću i svoje razmišljanje o mentorima. Diplomirat ću na računarskoj znanosti, evo za dva tjedna kod Marije Seder, a preddiplomski sam završio kod Šnajdera.\n\nChapter 1 - Šnajder: \n\nŠnajdera sam dobio na seminaru (predmet sa FER2 koji je ukinut na FER3) gdje su se mentori dobivali prema prosjeku, sustav vam ih je sam dodjeljivao, prvi izbor mi je bio Čupić, a drugi Šnajder, svog voljenog Marka nisam dobio nažalost. Suradnja sa Šnajderom na seminaru je bila dobra, radio sam prvi put umjetnu inteligenciju i strojno učenje, iznimno pametne stvari za nekog s druge godine, ništa ja nisan tada razumia što se dešava u tim algoritmima, ali seminar (određivač političke orijentacije) sam uspješno izradio. Za projekt sam radio igru asocijacije koja je funkcionirala na Word2Vec sličnostima, realno bez neke pretjerane pameti. Preddiplomski sam radio analizu Reddit korisnika po religijama, manje više čista statistika. Kroz sve ovo vrijeme sam ja manje više zadovoljan sa Šnajderom, iako mi je nekad nije najbolje sjedala suhoparnost i strogo poslovni odnos koji ima sa studentima. Također, Šnajder nije baš ljubitelj ljudi koji rade uz faks, zbog toga i pokreće silne TakeLab intershipe i to, čovjek smatra da je smisao fakulteta znanstveni rad. Ne dijelim to mišljenje baš, ne radi mi se baš za 5500 kuna kao asistent na FER-u kad random rođo programer radi za 8000 kn bilo di u Zagrebu. Sljedeće godine upisujem diplomski, nemam ništa sa Šnajderom prvi semestar osim što mi predaje Strojno Učenje. Te godine (2018/19) sam pao na plagijatima na Strojnom učenju, jebiga rođaci. Sićan se suđenja, tamo u D-337 side Šnajder, Čupić i Alagić i svima drže bukvicu. Palo nas je 50 na plagijatima te godine, nitko nije bio disciplinski prijavljen, osim što su poništeni bodovi iz labosa pa sam morao upisati predmet dogodine. No, imao sam i razgovor sa Šnajderom u vezi mentorstva gdje sam se ja osjećao primoranim otići pa sam otišao naravno, a u glavi će mi uvik ostati rečenica: \"Josipe, ako poželite odustati od faksa, to je isto u redu\". Adio, Jane, moja priča s tobom je gotova.\n\nChapter 2 - Marija Seder:\n\nZamislite, nalazite se u jako čudnoj poziciji. Student ste računarske znanosti, cijeli ZEMRIS zna da ste plagirali Strojno i APR te trebate pronaći drugog mentora. Nije baš lijepa pozicija. Srećom, imao sam poznanstva na ZARI-u te sam tako došao do Marije Seder. Marija me prihvatila kao njenog studenta, iako je znala za moje plagiranje, nije joj to smetalo. Za seminar i kasnije za diplomski radio sam duboko potporno učenje vezano uz robotiku. Kad god mi je trebalo nešto, uvijek sam je mogao pitati, bilo na slack ili dođi kod nje u ured, isto tako s asistentima. Nemam nijedne zamjerke, fenomenalan odnos sa studentima, kad bi opet bira, opet bi otiša kod Marije, već na preddiplomskom.\n\nChapter 3 - Usporedba: \n\nOno što sam napokon vidio kod Marije, a i na samom zavodu je taj prijateljski odnos koji imaju sa svojim studentima, na ZEMRIS-u je uvijek sve onako strogo poslovno, evo ti zadatak, radi ga, ako ti treba pomoć, zakaži termin dva tjedna unaprijed jer radimo puno i previše toga pa nemamo vremena za ništa. Sjećam se koliko nekih glupih stvari sam morao sam istraživati, čisto jer nebi mi imalo smisla ići na konzultatcije kad se moram tjedan dana unaprijed zakazivati. Iskreno, žao mi je sada što nisam odmah otišao kod Marije, spasilo bi me dosta živaca koje nisam ni primjetio da gubim na preddiplomskom. Problem kod ljudi kao što su Šnajder i Čupić, naravno pričam čisto s mentorske strane, je to što imaju previše stvari koje rade odjednom. Vrhunski su predavači, drže puno predmeta te su takoreći od jutra do sutra na FER-u. Oni iskreno uživaju u svom poslu, obožavaju predavati i prenostiti znanje. Odlični su za ići kod njih na predavanja, za čitanje njihovih materijala, no za biti njihov student i nisu baš po mom mišljenju. Ne mogu vam se posvetiti, ne mogu vam pomoći u ključnim trenutcima te će te biti prepušteni sami sebi. Mentor vam treba biti podrška i savjetnik tijekom studiranja, a ne samo netko tko će vam zadavati što trebate raditi. \n\nChapter 4 - Savjet budućim generacijama:\n\nPročitajte moja iskustva, ali na kraju slušajte sebe. Za vidjeti što koji mentor radi, najbolje vam je otići na stranice predmeta diplomski rad ili završni rad, stisnuti tamo na Raspored obrana i gledati teme završnih, odnosno diplomskih. Ovo pišem naravno za računarce što ću reći od sada na dalje. Ako se želite baviti računalnim inženjerstvom, onda uzmite Hoffmana ili nekog sličnog, stvarno nemam doticaja s tim područjem. Ako želite na telekomunikacije, nemojte, na kraju ćete završiti FER i raditi u nekoj firmi kao neki programer, ljudi upišu telekomunikacije jer su najlakši smjer na računastvu. Programsko inženjerstvo je ono što će većina ljudi raditi nakon faksa (pa tako vjerojatno i ja), no nemojte to upisati. Gradivo koje se tamo predaje nije vam toliko korisno, sve to možete naučiti sami ili kroz zaposljenje. Programiranje kao takvo je prašinarski i repetitivan posao. Bolje otiđite na Računarsku znanost (ili pak Data Science ako uvedu taj smjer na diplomskom), osim što ćete znati programirati, znat ćete razmišljati malo bolje o nekim stvarima i kužiti programiranje na boljoj razini. Predmete koje bi ja upisa na trećoj godini FER3 su SAP i Java1, a u ljetnom Oblikovni Obrasci i Java2. Ako vam je pak dosta Jave, upišite SAP i Kvantna računaala, a u ljetnom Skriptne i Programiranje za robote.  Ako želite moje preporuke za mentore, Čupić i Šnajder nisu to. Moje preporuke za mentore su Marija Seder, Ivan Marković, Jakobović, Šegvić, Golub, Hrkač i Delač. Ako ne znate kako se javiti mentorima, evo i generičkog maila: \n\nPoštovani,\n\nMoje ime je [redacted], student sam 2. godine računarstva na FER-u. Sljedeće godine planiram upisati Projekt i Završni rad te bi želio imati Vas kao mentora. Trenutni prosjek mi je 4.2, od programskih jezika znam Python i Javu te me zanima duboko potporno učenje. Možete li mi reći imate li vi kakve preduvjete da bi postao Vaš student?\n\nSrdačan pozdrav, [redacted]\n\n\nEto, toliko od mene, nadam se da sam bio kratak.",
      "votes": {
        "upvoters": [
          "1vq",
          "ALovelace",
          "Al_Pakino (Al Pakino)",
          "Aloko (Ardeo)",
          "Anavi",
          "BaboTrojka",
          "BigBoi",
          "BreadCat",
          "Dave",
          "Elbakyan (interlo)",
          "Emma63194",
          "ErnestHemingway (Alfetta)",
          "Filemon",
          "Galke",
          "Goliathus",
          "GranAutismo",
          "Haki",
          "InCogNiTo124",
          "Jimothy",
          "Joji",
          "Krisle",
          "MEasy",
          "McKovalski",
          "Mikki",
          "Mioch",
          "MrHead (vandal)",
          "Mrcina (Yoso)",
          "Pineo",
          "Portus",
          "PrisonMike (Števo)",
          "Red_Baron",
          "Sans",
          "Satanael",
          "Schm0sby",
          "Suki7",
          "Sulejman",
          "Tinx (pingvin)",
          "Trolololica",
          "Vasili (Fasili)",
          "Vishnjevac",
          "WickyWinslow",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "adrian7000",
          "amnael",
          "aperture",
          "cajaznun",
          "cloudies",
          "feudalac",
          "ghost (ksi)",
          "ikerkaferkass",
          "in1",
          "indythedog",
          "jobi (azex)",
          "joj (poni)",
          "kix7 (Fish99)",
          "klukas",
          "leff",
          "lucylu",
          "medjai",
          "member",
          "neksi (filip)",
          "otacon (senpai)",
          "pez (ip)",
          "rija",
          "rk8",
          "soplagaitas (sopla)",
          "tamnodrvo96",
          "vanna_li",
          "xeqte"
        ],
        "downvoters": [
          "[deleted]"
        ]
      },
      "reactions": {
        "haha": [
          "G-bear",
          "Jimothy",
          "STAGGER_LEE",
          "__builtin_popcount (std::popcount)",
          "ivicato",
          "luba",
          "member",
          "menace_master"
        ],
        "wtf": [
          "allophone"
        ],
        "tuga": []
      }
    },
    "44123": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "> @Masperado#44122 Josipe, ako poželite odustati od faksa, to je isto u redu\n\nBruh\n\n> @Masperado#44122 upišite Kvantna računaala\n\nal u vezi ovog, nek se ljudi ne nadaju da će previše naučit na ovom predmetu, pogotovo ne kvantno programirat haha",
      "votes": {
        "upvoters": [
          "Amali (Amajli)",
          "InCogNiTo124",
          "Red_Baron",
          "[deleted]",
          "member",
          "tamnodrvo96",
          "xeqte"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "Amali (Amajli)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "286201": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"Asura\"#p286184 ti ocito ne razumijes kako funkcionira mentorstvo kod snajdera",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "286202": {
      "poster": "[deleted]",
      "content": "@\"Alfetta\"#p286201 Šnajder mu je bio mentor.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286203": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"Asura\"#p286184 zar nije da snajder uzima odreden broj studenata koje rasporedi docovima predocovima i slicno po labu i onda ti ljudi rade sa studentima umjesto njega direktno, a ne da se ti javis docovima i predocovima direktno",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "286228": {
      "poster": "Asura (Asura)",
      "content": "@\"Alfetta\"#p286203 \n\nNije to bilo tak uvijek (tipa prije 2god bi Šnajder bio dosta involviran osobno). No i dalje možeš pokušati starim putem. Broj mjesta koje Šnajder uzima je ograničen, ali ako te netko želi uzet pod svoj wing, može se upast. Bilo je takvih slučajeva i vjerujem da će biti opet ako se ukaže prilika.\n\nEdit: Stvari se dosta poboljšavaju, po meni je ovo kada dobiješ podmentora najbolja stvar do sada, što je kombinacija prijašnjih opcija.",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286232": {
      "poster": "Asura (Asura)",
      "content": "Jedna jako dobra stvar kod Snajdera je to sto slusa kritike studenata i zeli poboljsati kvalitetu nastave pa tako i mentorstva. Trenutna sitacija je takva da na kraju ispadne da ulazis u agregator s nizom strucnjaka u N podrucja i onda dobijes mentora koji ti najbolje odgovara za ono sto odaberes raditi. Ako imas viziju tocno koji dio NLP-a zelis raditi, i svidio si se doktorandu koji to radi, jedino tada bi imao validan razlog upada mimo uobicajenog nacina.",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)",
          "[deleted]"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "286248": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"Asura\"#p286228 i stand corrected",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}