{
  "title": "Mentor: Lea Skorin-Kapov",
  "creator": "mentally_disturbed_llama",
  "slug": "mentor-lea-skorin-kapov",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "23492": {
      "poster": "mentally_disturbed_llama",
      "content": "@Tinx#23440 Lea Skorin-Kapov, po meni sve što mentor treba biti - vrlo profesionalna i očekuje da radiš sve kako treba i na vrijeme, ali ako nešto zezneš ili ne napraviš ima razumijevanja. Bavi se raznim područjima: VR, AR, WebRTC, Cloud Gaming, puno radova joj je o iskustvenoj kvaliteti - ako guglaš MUEXLab možeš naći sve čime se bave. Na projektu nas je bilo studenata od tri mentora sa ZTEL-a, uz Leu još Mirko Sužnjević i Maja Matijašević, ostavili su mi sličan dojam kao i Lea, da su opušteni, ali očekuju rad. Na projektu smo bili podijeljeni u dva tima - jedan tim je radio AR aplikaciju, a drugi VR igricu unutar koje je upitnik za ispitivanje iskustvene kvalitete. Na projektu je bilo malo zahtjevno jer smo imali sastanke gotovo svaki tjedan i to u 9 ujutro na kojima smo morali prezentirati napredak u prethodnom tjednu i planove za dalje. Na završnom nema toliko forsiranja oko tjednih izvještaja i dosta je opuštenije, sastanci su otpilike jednom mjesečno. Također na raspolaganju su asistenti koji su stvarno jako dragi i spremni pomoći, a moguća je i suradnja s nekim tko radi doktorat iz nekog od navedenih područja. Još jedna stvar koja možda ne sjeda najbolje svima je da jako cjepidlače oko same forme rada i pravopisa, sve mora biti točno po onim uputama na FERWebu, ali meni to nije bio problem jer sam i sama perfekcionist što se toga tiče. Ja sam kod Lee završila slučajno, dobila sam ju za seminar, svidio mi se rad s njom i odlučila ostati iako mi područje nije nešto previše zanimljivo, ali nisam htjela riskirati s traženjem novog mentora, a ionako me ništa posebno nije pretjerano zanimalo. Sve u svemu, ako hoćeš nekog sa ZTEL-a zato što se priča da je kod njih lagano onda ne preporučam ovu ekipu, ali ako hoćeš ZTEL jer te to zanima ili ti treba mentor koji će te tjerati da radiš koliko-toliko redovito onda svakako uzmi nekog od ovih koje sam spomenula.",
      "votes": {
        "upvoters": [
          "Hrvoje (Hrvoje45)",
          "Njet",
          "elbarto",
          "idontwannabemyself"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}