{
  "title": "Mentor: Martina Kutija",
  "creator": "Feelcool",
  "slug": "mentor-martina-kutija",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "25448": {
      "poster": "Feelcool",
      "content": "@XkLo#19884 Najpoznatiji na automatici su Bogdan i Kovačić. Oni imaju masu studenata(zajedno 15+) i kolko sam cuo zadaju ti puno previse posla. Oni su više za robotiku. Jedan od popularnijih mentora je iSumina, on je sa zavoda ZESA i ima hrpu studenata koji se bave automatizacijom(PLCi). Sad ono što ja znam iz svojeg iskustva. Ja sam kod  prof. Kutije. Ona ima samo nas troje s 3. godine. Ful je angazirana po pitanju studenata i jako se trudi. Trudi se objasnit 1na 1 30 puta ako treba, ako nesto ne kuzis. Ona je isto s zavoda ZESA, bavi se prvenstveno motorima, ali i automatizacijom. Nju svakako preporucam! Ne znam kakav je Kovačić mentor, ali ko profesor uzasan, ima uzasan predmet (ESA- 5. semestar), uzasno predaje tak da osobno nebi preporucio.",
      "votes": {
        "upvoters": [
          "Bobinator",
          "Klembuksna",
          "XkLo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45513": {
      "poster": "Feelcool",
      "content": "@LUJXIV#44365 Osobno kod prof. Martine Kutije sam. Ima fakat puno posla u vezi faksa i van faksa, ali je maksimalno predana svom poslu i jako cijeni svoje studente. Na početku ti da par tema(2-3),  ali možeš doći i s nekom svojom idejom/temom. Traži onako srednje, ne previše, ne premalo, ali treba odraditi posao koji ti da kako spada. Osobno mi se sviđa kod nje što cijeni vrijeme koje ti daješ u te radove te nije tip profesora koji će ti dat zadatke samo da ti da nego ti daje zadatke zato jer smatra da imaju neku svrhu i donekle su korisni. Bavi se motorima i PLC-ima (prvenstveno motori). PREPORUČAM SVAKAKO.\n\n  Sad što sam čuo od drugih studenata:\n\n Sumina- svake godine vrlo slični/isti zadaci s ne previše posla, uvijek ima puno ljudi i ne bavi se previše s tobom.\n\n Erceg- okej lik, čuo sam samo jedno mišljenje o njemu, nije bilo ni pozitivno ni negativno. Da ti što da odradiš i ne stresira se previše.\n\nIleš- predobar profesor, duša od osobe. Vjerujem da je jako dobar mentor.\n\nMatuško- dobar profesor, također vjerujem i dobar mentor.",
      "votes": {
        "upvoters": [
          "GranAutismo",
          "LUJXIV"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}