{
  "title": "Mentor: Zvonko Kostanjčar",
  "creator": "InCogNiTo124",
  "slug": "mentor-zvonko-kostanjcar",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "26941": {
      "poster": "InCogNiTo124",
      "content": "@Kaladonter#26832 inace s obzirom da se to moze smatrati nekom vremenskom sekvencom, mozda ti Kostanjcar moze pomoci. On se bavi primarno financijama ali posto je to isto vremenski niz _mozda_ se neke tehnike mogu upotrijebit za sport. Javi mu se mailom i pitaj, to je najsigurnije",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "37832": {
      "poster": "lovro (l123)",
      "content": "Ima li tko iskustva s Zvonkom Kostanjčarom?",
      "votes": {
        "upvoters": [
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)"
        ],
        "wtf": [
          "AVRFreak"
        ],
        "tuga": [
          "nairobi (light_grandma)"
        ]
      }
    },
    "270682": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog učenja)",
      "content": "@\"l123\"#p37832 Bump",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "270689": {
      "poster": "Jeff",
      "content": "Mislim da ga je na dretvi \"mentori\" netko opisao kao lošeg. Nešto da mu je pred kraj završnog rekao da puno toga promijeni i da je bilo nekih dilema oko prolaza.\n\nPozitivnih sigurno ima, ali pogledajte dretvu mentori. Znam da je jad i bijeda search, ali jbg.",
      "votes": {
        "upvoters": [
          "bodilyfluids (Dragi prijatelj strojnog učenja)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272254": {
      "poster": "at5611",
      "content": "@\"l123\"#p37832 Ja sam sad kod njega, sad sam na diplomskon i meni je odlican. Ako se zelis bavit financijama onda msn da je on najbolji odabir, ako vec znas sta tocno zelis radit daje poprilicnu slobodu, ako ne znas bas onda ponudi par zanimljivih tema. Jedino sta neces sa njim direktno radit nego ces dobit nekog asistenta, al to je jos bolje jer dobijes asistenta koji se bavi podrucjem na kojem ti radis (meni je tema zavrsnog bila market-making i asistent je bija na doktoratu na temu market-makinga). Ne zahtjeva da ikakve predmete upisujes i nema nekih rokova tokom semestra, nego se sve dogovoris sa asistentom i radis kako ti odgovara. Znam da je bija neki post o losim iskusvima sa njim ali ja nisan to primjetija, msn za taj zavrsni sam se potrudija ali ako se mislis provuc vjv ce ti vecina profesora srat. Tkd ako te zanimaju financije preporucujem.",
      "votes": {
        "upvoters": [
          "lovro (l123)",
          "madoxx"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "kix7 (Fish99)"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "296473": {
      "poster": "dieselpower0120",
      "content": "@\"at5611\"#p272254  mene zanima mentorstvo kod kostanjcara mozes li mi mozda malo detaljnije opisat kako stvari funkcioniraju kod njega sto sve trazi itd.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "296477": {
      "poster": "dieselpower0120",
      "content": "iskustva sa Zvonkom Kostanjčarom?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "296590": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog učenja)",
      "content": "@\"dieselpower0120\"#p296477 nisam kod njega, ali ako te primi možeš očekivat da nećeš radit s njim nego s njegovim doktorandima i post-docovima. Nemoj to shvatit kao manu tho, koliko shvaćam, iskustva s njima su vrlo pozitivna.\n\nVjerojatno nećeš imati veliku fleksibilnost pri odabiru teme, pa ak te ne zanimaju financije i/ili machine learning, Kostanjčar nije za tebe.",
      "votes": {
        "upvoters": [
          "dieselpower0120"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "296604": {
      "poster": "dieselpower0120",
      "content": "@\"Precious Bodily Fluids\"#p296590 iskreno nije mi ni krucialno da bas radim s njim dok god mogu nekome se javit pitat ako negdje zapnem, upravo me i to zanima pa mi nije problem",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}