{
  "title": "Mentor: Klemo Vladimir",
  "creator": "tuka",
  "slug": "mentor-klemo-vladimir",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "27481": {
      "poster": "tuka",
      "content": "@johndoe12#23919 Ja sam kod Kleme vec 3 semestra, trenutno kod njega pisem zavrsni. On se uglavnom bavi big data, sustavima preporucivanja, kolko sam vidjela, vecina radova je otprilike na tu temu. Ja nisam htjela nista programirati za zavrsni vec napisati istrazivacki rad, sama sam smislila temu i njemu je to sve skupa bilo super, dao mi je totalnu slobodu. Tako da ako ti vise pase samostalan rad, on je super mentor. Nije bas previse/uopce ukljucen u cijeli proces, na pocetku semestra mi je preporucio neku literaturu i rekao da mu se javim svako tolko da vidi kak napredujem. \n\nSve u svemu, ako zelis vise pomoci i angazmana od mentora, onda on nije osoba za tebe, ali ako ti vise pase sloboda, svakako ga preporucam, jako normalan i simpatican.",
      "votes": {
        "upvoters": [
          "Amon",
          "Lusy (MGJ)",
          "johndoe12 (enaiks)",
          "slip"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "144154": {
      "poster": "slip",
      "content": "@tuka#27481 \n\n> Ja nisam htjela nista programirati za zavrsni vec napisati istrazivacki rad, sama sam smislila temu i njemu je to sve skupa bilo super [...]\n\nKak to ide sa istraživačkim radom; što radiš ako ne programiraš?",
      "votes": {
        "upvoters": [
          "a_ko_si_ti"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "247772": {
      "poster": "tuka",
      "content": "@\"slip\"#p144154 znam da ekstra kasno odgovaram, ali evo :) \n\nZa završni rad možeš uzeti neku temu, detaljno je istražiti i onda u radu predstaviti to što si našao i koje zaključke možemo izvući. Ja sam npr. objašnjavala neke algoritme i kako se oni koriste, koje su moguće posljedice i primjene i slično. \n\nZa diplomski mislim da to nije dovoljno, već mora biti neko empirijsko istraživanje, ali naravno ovisi od mentora do mentora",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}