{
  "title": "Mentor: Mario Kušek",
  "creator": "Mulder",
  "slug": "mentor-mario-kusek",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "28284": {
      "poster": "Mulder",
      "content": "kušek, ježić, pripužić, podnar žarko\n\nmišljenja, dojmovi? jel ima još profesora kojima se mogu javit za iot/android?",
      "votes": {
        "upvoters": [
          "miss_anthropocene (neunist.iva)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "28310": {
      "poster": "[deleted]",
      "content": "@Mulder#28284 \n\nkušek drži iot i čuo sam neka iskustva na završnom radu i kažu da je okej",
      "votes": {
        "upvoters": [
          "Mulder"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "28336": {
      "poster": "Dell",
      "content": "@Mulder#28284 \n\nJa sam kod Kušeka. Imaš tjedne sastanke gdje popričate malo s njim i asistentima što se radili prošli tjedan. Ako ne stigneš nešto stvarno nije bed i nikada nisam čuo da se Kušek na nekog naljutio ili da mu je prigovaro nešto. Ovako kao osoba je meni osobno genijalan, jako se lagano zapričati s njime i onda skužiš da već sat vremena sjediš kod njega u uredu. Sada na diplomskom seminaru nam je rekao da sami smislimo teme vezano uz IoT i onda si mogao birati hoćeš da ti seminar bude cijeli teoretski ili želiš i neki praktični rad, ubiti sve se da dogovoriti. Mislim da je dobar izbor za mentora ako želiš nešto raditi kontinuirano te također znaš da imaš mentora koji će ti pomoći ako zapneš negdje. Na mailove odgovara najčešće isti ili sljedeći dan, ako je baš u gužvi možda ćeš čekati par dana.\n\nPodnar-Žarko mi je super kao profesorica te vidi se da zna znanje, ali ne znam kakva je kako mentor.",
      "votes": {
        "upvoters": [
          "Mulder",
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "304177": {
      "poster": "Crawler22",
      "content": "Kada mu se treba javiti otprilike, kakva bude popunjenost? Kada otprilike odgovori na mail, da znam hoću li slati u međuvremenu drugima mail ili ne\n\nZa Kušeka pitam",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}