{
  "title": "Mentor: Mario Cifrek",
  "creator": "Widlar",
  "slug": "mentor-mario-cifrek",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "33588": {
      "poster": "Widlar",
      "content": "@RedJohn#33343 Cifrek je zakon, trenutno sam kod njega na ZR. Radi se kontinuirano, svaki tjedan su sastanci i u stalnom si kontaktu s njim i asistentom. Na projektu u zimskom semestru svatko radi svoj zadatak jer kod njega ima ljudi sa svih smjerova, a najviše sa ERI-ja. Na projektu se upoznaš sa načinom rada i služi ti kao neki uvod u ZR, također su svaki tjedan sastanci na faksu. Cifrek i Željka rade zajedno, tako da su na tim sastancima svi koji su kod njega i svi koji su kod Željke (ona je isto super). Ako radiš neki hardware dobit ćeš pristup i svoje vlastito mjesto sa opremom koja ti treba za izradu projekta/ZR u laboratoriju na ZESOI. Tamo možeš biti od pon-pet, 8-17, dolazit i odlazit kad hoćeš. I on i njegovi asistenti su uvijek voljni pomoć - prije par dana sam s njim radio PCB-ove na zavodu, a kolegi je pomogao i u lemljenju komponenti. Također, možeš računat da će ti se javit na mail u roku 24h, ako ti je baš hitno javljaju se u roku 2-3h.  \n\nPopis mogućih tema kod njega je stvarno širok i kroz projekt će se nastojat prilagodit tvojim željama i preferencijama, a uglavnom cilja na primjenu u biomedicinskom području, iako ne mora nužno biti tako. \n\nAko te još nešto zanima, slobodno pitaj.",
      "votes": {
        "upvoters": [
          "MordorGuy",
          "RedJohn (Angela Martin)",
          "ljama_glama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "37173": {
      "poster": "ljama_glama",
      "content": "@Widlar#33588 jel se mozes javit u pm ili postaviti poruke pa da mogu zapoceti razgovor? imam par pitanja",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "170328": {
      "poster": "Kixxy",
      "content": "Mario Cifrek?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "170705": {
      "poster": "LanaRelej (Lana Relej)",
      "content": "@Kixxy#170328 Bavi se obradom signala i hardverom, najviše primjenama u medicini (tipa snimanje i obrada EKG-a). Kao mentor je vrlo pristupačan i ugodan. Vidi se da baš voli svoj posao i uvijek rado odgovara na pitanja i nejasnoće. Na početku semestra ćete se dogovoriti oko teme projekta/rada ovisno o tvojim interesima. Pokazat će ti čime su se bavili drugi studenti i kako to funkcionira na zavodu. Projekt i rad će prilagoditi tvojem predznanju tako da što više naučiš, al da se opet stalno ne mučiš i udaraš glavom o stol. Ako odeš više u hardver, možeš očekivati i rad u labosu na faksu (ovisno o epidemiološkoj situaciji vjerojatno). Očekuje kontinuiran rad (tjedni sastanci), ali koliko ti obaveze redovnih predmeta dopuštaju. Kad su ispiti nema sastanaka i ne očekuje da tada radiš (naglašavam ovo jer sam čula da kod nekih nije tako).\n\nPuno više ga zanimaju tvoji interesi nego ocjene. Uglavnom, sve preporuke.\n\nTakođer, puno surađuje s profesoricom Željkom Lučev Vasić koja je isto sa ZESOI-ja i bavi se sličnim temama, pa i nju uzmi u obzir.",
      "votes": {
        "upvoters": [
          "BrownPerson (Bambi)",
          "Filemon",
          "Grumio",
          "jolemjer",
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "170770": {
      "poster": "Widlar",
      "content": "@Kixxy#170328 @Widlar#33588",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272424": {
      "poster": "Filozof",
      "content": "Mario Cifrek kao mentor i ima li netko iskustva sa mijenjanjem mentora tijekom godine?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272437": {
      "poster": "MarokMarsci (Collapse Enjoyer)",
      "content": "S obzirom da su si Cifrek i Krois dost dobri to je samo jos jedan razlog za odabrat Cifreka",
      "votes": {
        "upvoters": [
          "Filozof",
          "Red_Baron",
          "ivicato",
          "madoxx",
          "tekamolo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}