{
  "title": "Mentor: Željka Mihajlović",
  "creator": "crocorax",
  "slug": "mentor-zeljka-mihajlovic",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "36961": {
      "poster": "crocorax",
      "content": "jel zna ko sta o Zeljki Mihajlovic?",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "37371": {
      "poster": "garderain",
      "content": "@crocorax#36961 Meni je ona mentor jos od prediplomskog seminara. Imam samo pozitivna iskustva. Ni za seminar, ni za zavrsni nema nekih stalnih sastanaka. Obicno organizira jedan na pocetku kada se upoznate, pokaze sto su radili studenti prije i slicno. Ako te zanima grafika i dodes s nekom svojom temom jako joj je drago (prokomentira nekad da je mozda ambiciozno/preopsezno, ali nece te zaustavit ako zelis radit vise). S druge strane, uvijek ima i spremne teme ako ne znas sto bi radio. Na diplomskom sada nije trazila nikakve posebne predmete da moras upisat. Na projektu smo se jedino malo vise sastajali, ali tema je bila zanimljiva tako da nije bio neki problem. Uvijek ju mozes pitat za konzultacije, da ti pogleda rad koji pises i kaze svoje dojmove. I zena je generalno izrazito draga ovako kao osoba. All in all, tople preporuke, tho kolko znam kod nje zna biti guzva (nasa generacija smo svi jos bili na seminaru kod nje, pa smo nastavili). Ak te jos nesto zanima, pitaj slobodno.",
      "votes": {
        "upvoters": [
          "[deleted]",
          "__builtin_popcount (std::popcount)",
          "crocorax",
          "member"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "46656": {
      "poster": "feudalac",
      "content": "Zna li netko mozda ima li jos mjesta kod Zeljke Mihajlovic",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "46716": {
      "poster": "[deleted]",
      "content": "@feudalac#46656 Ja sam joj se prosle godine javio na pocetku sestog mjeseca i tada je vec bila puna (znam kolege koje je jos prije toga odbila), no mene je primila jer sam vec bio kod nje na seminaru (ovog nema na FER3). Ipak, koliko cujem, ove godine je uvela neki razgovor prije selekcije pa moguce da ima jos slobodnih mjesta, iako sumnjam. U svakom slucaju ne kosta te nista da joj posaljes mail, odgovorit ce ti kroz dan-dva max.",
      "votes": {
        "upvoters": [
          "__builtin_popcount (std::popcount)",
          "feudalac"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}