{
  "title": "Mentor: Jurica Babi캖",
  "creator": "feudalac",
  "slug": "mentor-jurica-babic",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "42142": {
      "poster": "feudalac",
      "content": "Jurica Babi캖 iskustva mozda? Koliko mu znaci prosjek?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "43160": {
      "poster": "[deleted]",
      "content": "Je li Jurica Babi캖 ikome odgovorio? Ima li jo코 mjesta kod njega?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "43162": {
      "poster": "GetSchwifty (_2D_)",
      "content": "@FERella#43160 \n\nOdg je meni, odmah isti dan (iako je bio vikend), rekao je da me mo쬰 primit, dog sam sastanak ovaj tjedan, cini mi se da mu prosjek i nije toliko bitan, ja imam 3,6 i nije nista rekao. 游땑",
      "votes": {
        "upvoters": [
          "[deleted]",
          "pustimestat"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Suki7"
        ],
        "tuga": []
      }
    },
    "275864": {
      "poster": "pustimestat",
      "content": "@\"_2D_\"#p43162 \n\nI jel ti on mentor bio? Iskustva, preporuke?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275873": {
      "poster": "Fruit_kid",
      "content": "@\"pustimestat\"#p275864 \n\nMeni je mentor ove godine i stvarno svaka preporuka za njega, bar meni odgovara njegov na캜in rada. Vi코e puta tijekom semestra sam mu se obratila za pomo캖/savjet/smjernicu i svaki put mi je dao korisne informacije. Ako ne 쬰li코 캜est kontakt s mentorom, nego si vi코e onaj tip da ga ne 쬰li코 vidjet cijeli semestar, Jurica nije za tebe, ali meni odgovara da prati napredak svaki tjedan. Nez vi코e 코to da ka쬰m pa samo pitaj ako te jo코 코to zanima",
      "votes": {
        "upvoters": [
          "pustimestat"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275891": {
      "poster": "pustimestat",
      "content": "@\"Fruit_kid\"#p275873\n\nA kako funkcionira biranje teme kod njega, moras bas nesto vezano za njegovo polje ili kako to ide? Za preddiplomski pitam.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275907": {
      "poster": "Fruit_kid",
      "content": "@\"pustimestat\"#p275891 Ja sam na preddiplomskom pa nisam jo코 bila kod njega na razgovoru za zavr코ni, ali za projekt ti znam re캖. Bila sam spojena sa studentima od 콯eljke Car i Podobnika i radili smo na temu asistivne tehnologije, tako da, da, radi코 ne코to vezano za njegovo polje (jedno od onih podru캜ja koja ima navedeno na svojoj stranici). 캛ovjek je stvarno svestran i svime se bavi pa mu na razgovoru mo쬰코 re캖 코to te to캜no zanima pa 캖e ti odabrat projekt u skladu s time. Ja sam mu bila rekla da me interesira asistivna tehnologija pa me zato spojio s grupom profesorice Car koja se tako캠er bavi tom temom.",
      "votes": {
        "upvoters": [
          "pustimestat"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275912": {
      "poster": "pustimestat",
      "content": "@\"Fruit_kid\"#p275907\n\nOdlicno, hvalaaa ti puno na odgovoru 游땕游땕",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275931": {
      "poster": "GetSchwifty (_2D_)",
      "content": "@\"pustimestat\"#p275864 Je, sla쬰m se sa svim navedenim gore, svaka preporuka. 맚o se ti캜e teme za zavr코ni, meni je predlo쬴o temu jer ja nisam imala ideja. Znam i neke ljude koji su imali svoje ideje za neke aplikacije i onda su radili to. 맚o se ti캜e diplomskog, on ti navede neka podru캜ja kojima su se on ili asistenti koji rade s tobom bavili i o kojim vi코e znaju, ali nisu zatvoreni samo za to. Uglavnom, tra쬴 od tebe da razmisli코 코to tebe zanima i 코to bi volio raditi i onda to poku코a prilagoditi na neku od tema kojima se oni bave (dru코tvena uklju캜enost, dru코tvene mre쬰, analitika podataka).",
      "votes": {
        "upvoters": [
          "pustimestat"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}