{
  "title": "Mentor: Marko Horvat (ZPR)",
  "creator": "Edrudo",
  "slug": "mentor-marko-horvat-zpr",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "42478": {
      "poster": "Edrudo",
      "content": "Jel itko cuo ili ima neko iskustvo o Marku Horvatu, docent sa ZPR-a. Predlozio mi ga je Boticki kada sam mu se javio zato što on više nema mjesta.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45569": {
      "poster": "Nocna_smjena",
      "content": "Neko za Marka Horvata sa ZPR-a? (postoje 2 Marka Horvata da se ne zbunite) Čuo sam se s prof. Botičkim i preporučio mi je prof. Horvata ali njegovo ime nije na popisu službenih mentora",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302488": {
      "poster": "pustimestat",
      "content": "Ima netko iskustva?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302495": {
      "poster": "matrica",
      "content": "Ukratko, jako fleksibilan oko tema (njegovo podrucje bi bile emocije i svemir, ali nije nužno ostati u podrucju) - nemojte bas ocekivati  support tokom rada, najvise fokusa postavlja na zavrsni dokument. Ali sukladno tome, ni ocekivanja mu nisu prevelika i nece vas “gnjaviti” tokom semestra. Nekima moguci Downside - vjerojatno ce od vas ocekivati da pisete papere za konferencije. Dobra strana: radi na dosta projekata pa se mozda mozete ukljuciti u nesto fora i novo.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302536": {
      "poster": "Nocna_smjena",
      "content": "@\"pustimestat\"#p302488 iskreno ne znam. Uglavnom se bavi AI podrucjem kao sto je kolegica malo prije rekla. Clanak za konferenciju ces vjv radit u sklopu projekta R sto je po meni plus jer vjv to ima neke tezine u cv-u. Ne tjera te da se moras javljat svako malo. Zna bit picajzla i ponekad se zna desit da njegovi komentari nemaju veze s vezom. Rokova i naputaka za ocjenjivanje se drzi veoma ozbiljno tako da tu svasta moze bit. Ne bi rekao da je dobar mentor ali opet ne mogu rec da je los.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}