{
  "title": "Mentor: Marija Seder",
  "creator": "lul",
  "slug": "mentor-marija-seder",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "44064": {
      "poster": "lul",
      "content": "Marija Seder, Ivan Petrovic iskustva ?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "45219": {
      "poster": "Krisle",
      "content": "_(Buraz mi je završio diplomski prošle godine pa evo prenosi svoja iskustva)_\n\nPreddiplomski Marija Seder:\n\nPotvrđujem gore navedenu tvrdnju kolege @Masperado#44122  o Mariji Seder. Htio bih još samo napisati malo više o njoj. Uzima u zadnje vrijeme jako puno računaraca jer je trend da R-ovaca ima više nego E-ovaca. Jako je pristupačna i sve se s njom da dogovoriti. Za projekt i završni rad smo kolega i ja ukomponirali jednu super temu, navigirali smo robota preko mobitela. Tu je bilo jako puno programiranja u nama dobro poznatim tehnologijama i jezicima (Android, Java itd.) što je nama kao PIISovcima odgovaralo. Inače, ona se bavi robotikom primarno što nije najzgodnije možda za nekog tko ne bi htio to raditi/istraživati. Downside toga je da nema preširok spektar tema te ako nemate neku svoju ideju za projekt ili završni/diplomski, vjerojatno ćete morat nekaj takvog pod mus uzet. Meni se dogodila identična situacija za diplomski te sam bio primoran mijenjati mentora jer ona nije imala neke teme za ponuditi pa smo išli tražiti neke firme da njima rješavamo projekte, ali također su teme bile loše definirane pa smo kolega i ja zajedno promijenili mentora. Moram je pohvaliti što je prihvatila to bez problema, čak nam je i došla na obranu :)\n\n\n\n\nDiplomski Bojan Franc:\n\nBojan je na FERu inače vanjski suradnik pa se bavi s mnogo stvari. Kod njega smo razvijali aplikaciju za vatrogasce. Koliko sam shvatio, on gleda na budućnost tog rada/projekta i želi na neki način da faks profitira od toga pa ako želite jednog dana raditi na faksu, on je odličan entry point. Što se tiče pristupa rada na diplomskom, agilno je razvijanje projekta - sastanci svakih tjedan dana, definiraju se zadaci i javlja se feedback. Kao čovjek je opušten i pomalo smotan (kao i svaki FERovac/programer) pa smo imali par propuštenih sastanaka, nedefiniranih situacija/stvari, no to je sasvim bilo razumljivo jer se nije bavio toliko mentorstvom inače. Kolega je ostao raditi na faksu, a ja ošo svojim putem. Pro tip: ako ga uzmete, probajte ne raditi toliko taj semestar jer je malo alergičan na studente kaj rade full-time za vrijeme diplomskog pa smo imali par rasprava oko toga. :D",
      "votes": {
        "upvoters": [
          "Masperado",
          "[deleted]",
          "member",
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}