{
  "title": "Mentor: Vedran Mornar",
  "creator": "itsdend",
  "slug": "mentor-vedran-mornar",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "44852": {
      "poster": "itsdend",
      "content": "Netko preporuke mentora za game development/backend, ugl. fokus na c/c++, te ako netko ima iskustva s Mornarom.. dobro bi došla",
      "votes": {
        "upvoters": [
          "viliml"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302493": {
      "poster": "anon00",
      "content": "Vidim da je u toku trazenje mentora pa evo i mali osvrt na Mornara\n\nDakle lik je toliko chill da vam cesto nece niti odgovoriti na mail ili ce i sam zaboraviti na neki rok, ali srecnom je on mentor pa se rokovi toliko ne odnose na njega\n\nTo je onaj negativan dio, a pozitivno (barem meni) je da je toliko chill da mu je svejedno sto radite i kako radite. \n\nPrihvaca bilo kakav prijedlog teme (jedino je dao napomenu da to bude neka full stack aplikacija razumne složenosti - dakle baza+bk+front, ali moguce da prihvaca i druge teme - to nezz). \n\nJa sam njemu poslao mail za prijelog teme koju je prihvatio i nakon tog smo se vidili na obrani - to je to od nase interakcije 😆 \n\nZa seminar mu je bilo sasvim svejedno o cemu pisete, a vjerujem da nije bas ni gledao same seminare. \n\nTako da ako trazite nekog tko ce vas ostaviti na miru da odradite zavrsni/seminare kako vama odgovara onda svaka preporuka. Ponekad ce vas malo zivcirati sto ne odgovara na mail pa treba poslati 2-3 maila, ali to je to. \n\nPojma nemam kakav je kad ga treba zatraziti za pomoc oko zavrsnog jer je nisam trazio.\n\nBtw sto se tice odabira predmeta on se tu ne petlja tako da odaberete predmete koje vama odgovaraju i on to odobri",
      "votes": {
        "upvoters": [
          "Ducky",
          "SuperSjajan3",
          "shoshakis (teshna)",
          "tamnodrvo96"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "304198": {
      "poster": "anon00",
      "content": "@\"Casio\"#p304176 Ako ti vrdoljak ne dopusti, mislim da je Mornaru to sasvim okej tema.\n\nBivši kolega s posla je prije 3 god kod njega obranio diplomski zavrsni, a tema mu je bila sustav za vođenje rezervacije apartmana (dakle full stack app (msm da je imao i mobilnu aplikaciju)",
      "votes": {
        "upvoters": [
          "Casio"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}