{
  "title": "[KOMPRO] O predmetu",
  "creator": "Majmanko",
  "slug": "kompro-o-predmetu",
  "tags": [
    "FER",
    "Komunikacijski protokoli"
  ],
  "posts": {
    "138060": {
      "poster": "Majmanko",
      "content": "Iskustvo 2020/21\n\nPrvi ciklus se uglavnom rade dijagrami stanja te petrijeve mreže. Taj dio je bio uživo. Zadnja dva predavanja u prvom ciklusu se radi IPv6 (preko teamsa je bilo). Drugi ciklus protkoli usmjeravanja, pokretna mreža, obrađuje se 2g, 3g, 4g, 5g te na kraju m2m i iot malo.  Taj ciklus se preko teamsa održavao i predavanja se ne snimaju.\n\nŠto se ispita tiče, svakako je preporuka skupit što više bodova na MI jer je lagano gradivo, a drugi ciklus nije težak već ima masu gradiva pa je s time i ZI automatski teži. U ZI ulazi i gradivo MI, ali fokus je na 2. ciklusu. \n\nPredmet ima i 3 zadaće. Prva je crtanje Petrijeve mreže u CPN toolsu, laganih 4 boda, druga je protokoli usmjeravanja u Imunesu, 12 bodova  te  zadnja zadaća napisati nešto o nekom protokolu u 5g mreži, 4 boda. Sve u svemu, laganih 20 bodova.\n\nPostoje i bodovi za aktivnost (5 bodova), to se davalo u prvom ciklusu na izlaske pred ploču. Kasnije je Ježić davao neke opcionalne zadaćice za te bodove. Tipa odgovoriti na pitanja iz prezentacija. Također lagani bodovi.\n\nŠto se labosa tiče, trebalo je modelirati DHCP pomoću promele i CPN toolsa. No ti bodovi ne ulaze u bodove predmeta već profila.",
      "votes": {
        "upvoters": [
          "Hunet",
          "Krama13"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272527": {
      "poster": "ljama_glama",
      "content": "@\"Majmanko\"#p138060 Kako izgleda usmeni?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272616": {
      "poster": "Majmanko",
      "content": "@\"ljama_glama\"#p272527 ima u onom threadu Gradivo kaj me Ježić pitao prošle godine. Bio je online usmeni.",
      "votes": {
        "upvoters": [
          "ljama_glama"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}