{
  "title": "[EIIT] Poslovi - ponuda i potražnja",
  "creator": "bubbly",
  "slug": "eiit-poslovi-ponuda-i-potraznja",
  "tags": [
    "Oglasi",
    "Posao"
  ],
  "posts": {
    "246770": {
      "poster": "bubbly",
      "content": "![](assets/2021-10-26/00012.jpg)",
      "votes": {
        "upvoters": [
          "InCogNiTo124"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282308": {
      "poster": "BigZ1",
      "content": "Traži se audio inženjer!\n\nRiječ je o tvrtki Omega Akerholdt. Bave se primarno građevinom gdje imaju inženjere koji se bave mjerenjima vlage, gustoće, zvuka po zgradama, termografijom i sličnim stvarima jer imaju neke patente za te aparate pa imaju skoro pa monopol nad snimanjima starih crkvi i zaštićenih dobara. Jos se bave i energetikom i zaštitom, a znam da se žele proširiti da imaju i svoj neki arhitektonski dio, ali su jako voljni slušati sve nove ideje za razvijanje novih poslova, odjela, i slicno. \n\nTrebaju inženjera akustike koji bi radio s njima ta snimanja i proračune, i terenski rad vjerojatno jer su stalno na terenu.\n\nStranica je na norveškom, ali može se lako prevesti na google translate.\n\nBilo bi potrebno preseljenje, a plaća je po norveškim standardima. Pružaju bilo kakvu potporu koju mogu pružiti prilikom preseljenja. \n\nJako su uspješni kao tvrtka, a posao im samo raste. Ugodni su ljudi i znaju engleski dobro. Trebaju ljude koji su završili master, jer u Norveškoj imaju manjak audio inžinjera s masterom, zato traže strance.\n\nPosao je jako zanimljiv, dinamičan, kreativan i nudi dobre uvjete. \n\nGuglajte i pošaljite CV!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282309": {
      "poster": "BigZ1",
      "content": "@\"BigZ1\"#p282308 \n\nInace ovo je od moje frendice frendica pisala poruku jer sam ferovac pa saljem ovo u slucaju da nekog zanima.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}