{
  "title": "[OOS] Razumijevanje gradiva predmeta",
  "creator": "grga_it_is (it_is_what_it_is)",
  "slug": "oos-razumijevanje-gradiva-predmeta",
  "tags": [
    "FER",
    "Osnove obradbe signala",
    "Pitalice"
  ],
  "posts": {
    "247956": {
      "poster": "grga_it_is (it_is_what_it_is)",
      "content": "Poštovane kolege i kolegice,\n\npotaknut nerazumijevanjem što se zapravo događa na ovom predmetu odlučio sam kreirati **Poll** kojim želim čuti vaše mišljenje.\n\nNaime smjera sam _Znanost o podacima_ i svi predmeti koje imamo na modulu u 1. semestru su iznimno korisni, i sve je užitak učiti (Strojno, Uvod u znanost o podacima, Statistička anliza podataka, ma sve...), ali ovaj predmet je obvezan na ovom modulu ali nigdje ne vidim poveznicu ovog premeta  s DS-om (radimo audio signale, nema udzbenika signali u DS, radimo audio filtere, profesor kaže da je teško naći primjere vezane uz DS, i sl.). Jako mi ga je mrsko učiti jer ne razumijem uopće što se događa na njemu, odakle krenuti, imam osjećaj da bih trebao znati sve što i elektrotehničari da bih razumio što profesor objašnjava.\n\nČinjenica je da se profesor trga objašnjavajući, da nas pita razumijemo li ovo, da se oznoji objašnjavajući nam o čemu se radi, vidi se da je čovjek dobričina i da voli to što radi, ali opet nekako mislim da ovom predmetu nije mjesto na ovom modulu jer nikako se ne može povezati s njim, ali i užasno je kompleksno gradivo i zahtjeva izuzetno veliku količinu predznanja o signalima.\n\nStoga bih molio kolege da se izjasnite što vi mislite o ovom predmetu (koji se izvodi tek drugu godinu, u prošloj godini su imali 6 studenata), što mislite o tome što je ovaj kolegij za nas OBVEZAN, razumijete li išta?\n\nDa bih vidio jesam li ja jednostavno nesposoban za taj predmet ili je realno nedefiniran...",
      "votes": {
        "upvoters": [
          "oneTwo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "247964": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog učenja)",
      "content": ">nigdje ne vidim poveznicu ovog premeta s DS-om \n\nNe slusam predmet pa ne mogu komentirati o \n\nkorisnosti ovisno o izvedbi, ali mislim da ima smisla da je obrada signala obavezna za data science. Velik dio podataka su time seriesi i njih možeš promatrati kao vremenski signal kojeg je potrebno analizirati i pripremiti u oblik pogodan za što god je da želiš napraviti.",
      "votes": {
        "upvoters": [
          "Lyras",
          "grga_it_is (it_is_what_it_is)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "247971": {
      "poster": "grga_it_is (it_is_what_it_is)",
      "content": "@\"Precious Bodily Fluids\"#p247964 \n\nSve ja to razumijem i to se koristi kod recimo obrade govora za raspoznavanje, ali to sve stoji ali ne u smislu da mi to sve moramo od prije znati i da nemamo primjere vezane baš uz DS. Valjda bi poanta kolegija bila da nas u to uvedu.",
      "votes": {
        "upvoters": [
          "oneTwo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "247978": {
      "poster": "oneTwo",
      "content": "@\"Precious Bodily Fluids\"#p247964 Mislim da nije problem u tome što učimo o signalima, nego o načinu na koji je taj predmet osmišljen i kako se provodi. Čini mi se da nisu uzeli u obzir naše predznanje o tom području i način na koji će većina nas upotrebljavati znanje o signalima u budućnosti. Imam osjećaj kao da slušam predmet s E smjera i da sam preskočila 5 predmeta koji su preduvjet za ovaj predmet.",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)",
          "Gulbash",
          "Lyras",
          "cloudies",
          "dh333",
          "gana",
          "grga_it_is (it_is_what_it_is)",
          "ppooww (pp)",
          "snowman",
          "wesley"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}