{
  "title": "[POSINT] O predmetu",
  "creator": "mgd",
  "slug": "posint-o-predmetu",
  "tags": [
    "FER",
    "Poslovna inteligencija"
  ],
  "posts": {
    "264479": {
      "poster": "mgd",
      "content": "Dojmovi o poslovnoj inteligenciji? Težina/korisnost? Koliko oduzima vremena?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "264580": {
      "poster": "PiqueBlinders (zisku)",
      "content": "@\"mgd\"#p264479 labosi oduzimaju podosta vremena, rekao bi 2-3 dana po labosu (ali nose 50 bodova), a ako ih napises s razumijevanjem ispit je na istu foru tako da se da skupit bodova. Dan ucenja i sa rjesena 2 labosa napisao sam MI za 60%. \n\nAko te baze podataka ne odbijaju bas je zanimljiv i koristan predmet.",
      "votes": {
        "upvoters": [
          "cloudies",
          "mgd"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "272469": {
      "poster": "MsBrightside",
      "content": "@\"Lyras\"#p268647 Poslovna nije baš webdev, samo jedan labos je takav, ostatak ti je da ćeš min dva labosa u sql-u bit. Ako te zanimaju skladišta podataka preporučam, predavanja su meni dosta zanimljiva. Jedino što ima 6 labosa i ako imaš taj semestar puno drugih labosa dosta je naporno pogotovo što labosi nose 50% bar je tako bilo na fer2 verziji predmeta, ne znam koliko je drugačije na fer3. Sve u svemu dosta zanimljiv predmet, ali ako ne voliš bavljenje sa podacima i oblikovanje skladišta podataka nemoj upisivat čisto zbog količine labosa.",
      "votes": {
        "upvoters": [
          "Lyras"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275949": {
      "poster": "cajaznun",
      "content": "@\"NISAM ASISTENT\"#p275773 mislim da su svi navedeni predmeti novi, osim poslovne inteligencije.\n\nEvo kratki dojam o **Poslovnoj inteligenciji** koju sam slusao ove godine. Predavanja su uzivo i drzi ih mekterovic. Meni su predavanja bila zanimljiva, Mekterovic je super profesor za poslusati. Predmet se bavi skladistima podataka, zvjezdastoj strukturi baze podataka, OLAP, ETL, vizualizacija podataka.... Posto volim baze, predmet mi je bio odlican. E sad,  predmet ima 6 domacih zadaci, razlicitih tezina. Svaka zadaca nosi  drugaciji broj bodova, onoliko koliko je teska, ukupno 50 bodova. Prva, cetrvta i peta dosta lagane - rijese se u jedno popodne (4h sata posla). Druga DZ je najbitnija jer se sve daljne zadace nadovezuju na nju. U njoj cete napraviti svoje skladiste podataka. Ispiti MI i ZI nose svaki 25 bodova i jako su slicni toj drugoj DZ jer na njima isto treba napraviti skladiste podataka, sto je dosta naporno i dugo, ali po mom iskustvu, ispite ispravljaju jako blago.  Za drugu i trecu DZ treba dosta vremena, tipa dva dana tako da racunajte na to. Sesta DZ nemam pojma sto je jer sam skupio dovoljno bodova, pa je nemoram raditi (navodno je i ona teska). E, morate imate Windows jer radite sa MS SQL serverom i raznim programima kao sto su MS Access, Excel, Microsoft Analysis Services, SQL Server Integration Services, Tableau...\n\n Uglavnom, preporucam predmet, zadace znaju biti naporne, ali nose 50% ocjene. Ispiti nisu teski. Ako budete ikad radili na backendu sa velikim kolicinama podataka i ogromnim bazama, svakako ce biti korisno",
      "votes": {
        "upvoters": [
          "MsBrightside",
          "Sele"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282508": {
      "poster": "Nocna_smjena",
      "content": "Kolko je zahtjevan ovaj predmet? Ja imam peh da imam jos jedan predmet koji se odrzava u isto vrijeme kao ovaj tako da bi bio na 0 predavanja ovog predmeta.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "282920": {
      "poster": "MsBrightside",
      "content": "@\"Nocna_smjena\"#p282508 nije toliko zahtjevan, zanimljiv je i ok, ali preporucam ic na predavanja, mekterović super predaje, a prezentacije nisu najdetaljnije tako da nepohađanje predavanja znatno produži učenje po mom mišljenju. Iako možeš preživjet i bez",
      "votes": {
        "upvoters": [
          "Nocna_smjena"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}