{
  "title": "[OKOSL] 4. domaća zadaća - 2021/2022",
  "creator": "ErnestHemingway (Alfetta)",
  "slug": "okosl-4-domaca-zadaca-20212022",
  "tags": [
    "FER",
    "Osnove korištenja operacijskog sustava Linux",
    "Zadaće"
  ],
  "posts": {
    "264986": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "DZ4. Kako pola skripte odraditi kao jedan korisnik i onda se prebaciti da dio skripte odradujem kao drugi korisnik pa se vratiti na prvog. Ne vidim nacina da se to napravi",
      "votes": {
        "upvoters": [
          "yabk"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "265011": {
      "poster": "yabk",
      "content": "Ni ne ocekuje se da se to napravi. Za ovu zadacu, rjesenje zapravo nije funkcionalna skripta vec na skriptu gledajte samo kao na tekstualnu datoteku u kojoj predajete rjesenja.\n\nUskoro cemo u pdf zadace dodati tu napomenu.\n\nHvala na primjedbi!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "265015": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"yabk\"#p265011 Ja sam uspio rijesit da mi radi kao drugi korisnik pola skripte, ali nisam siguran jel to legalno rjesenje. Kao jesu sve onelineri, ali sustinski nisu",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "265165": {
      "poster": "yabk",
      "content": "@\"Alfetta\"#p265015 \n\nAjde rade napisi najjednostavnije moguce rjesenje, a mozes u komentar ispod staviti to rjesenje s kojim bi skripta radila za koje nisi siguran sto se tice legalnosti.\n\nTo je cisto zato sto ispravljaci ispravljaju zadatak po zadatak, a ne zadacu kao cjelinu. Npr. ispravljac koji vam ispravlja 15. zadatak ne vidi rjesenja vasih ostalih rjesenja, tako da ako nisi siguran u legalnost rjesenja na taj nacin koji radi, rade takvo rjesenje si spremi u komentar, a kao rjesenje predaj najjednostavniju naredbu koju bi koristio u kontekstu interaktivnog rada u terminalu, a ne neke skripte.\n\nDogodine budemo dodatno prepravili ovo tako da nema zabune.",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}