{
  "title": "Mentor: Ivan Marković",
  "creator": "Dux",
  "slug": "mentor-ivan-markovic",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "268840": {
      "poster": "Dux",
      "content": "Ivan Marković kao mentor. Može mi netko napisati par rečenica. Ima li netko bolji što se tiče robotike?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "294020": {
      "poster": "bolero",
      "content": "Ivan Marković kao mentor za mobilnu robotiku i umjetnu inteligenciju? I kakav je opcenito kao profesor i osoba?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302454": {
      "poster": "Cika",
      "content": "@\"bolero\"#p294020 Dosta chill, kao profesor odličan, kao mentor se ne trudi previše uspostaviti komunikaciju sa studentima, ali susretljiv ako ga pitaš nešto konkretno. Radit ćeš s asistentima većinu vremena tako da kao mentor je nebitan, bitno ti je da dobiješ dobrog asistenta. Temu za rad izabireš sam ili ti je dodijeli asistent, Marković će samo očekivati da ga obaviještavaš o napretku na tjednoj bazi. Ne znam postoji li bolji, možda Marija Seder.",
      "votes": {
        "upvoters": [
          "bolero"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "304167": {
      "poster": "bolero",
      "content": "@\"Cika\"#p302454 Hvala. Da li mi on dodjeli asistenta ili to sam biram nekako? I dal imas preporuku koga uzet od asistenta ili koga nikako ne uzet?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "304170": {
      "poster": "Cika",
      "content": "@\"bolero\"#p304167 Mentor ti dodjeljuje asistenta i asistent će stupiti u kontakt s tobom kad dođe vrijeme za to. Vjerujem da su svi asistenti na zavodu ok tako da ne moraš previše brinuti, a i uvijek se možeš dogovoriti s njima ukoliko imaš neki problem. Savjet je da se ne ustručavaš pitati asistenta sve što te zanima.",
      "votes": {
        "upvoters": [
          "bolero"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}