{
  "title": "[PEVUI] Gradivo",
  "creator": "DukeFiction",
  "slug": "pevui-gradivo",
  "tags": [
    "FER",
    "Primjena elektromagnetskih valova u in쬰njerstvu"
  ],
  "posts": {
    "274987": {
      "poster": "DukeFiction",
      "content": "Ima li netko mo쬯a savjet kako spremati zavr코ni i usmeni?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275025": {
      "poster": "KR7 (Detective Schmosby)",
      "content": "@\"DukeFiction\"#p274987 Zavrsni samo pogledaj na stranici predmeta **Primjenjeni elektromagnetizam** prijasnje ispite i auditorne, tu se nemas kaj brinut uvijek su lagani zadaci jer prof Hrabar ti da konacnu ocjenu samo na temelju usmenog ispita, a za usmeni prodi kroz biljeznicu ako si vodio/la kakve biljeske i probaj odgovorit na onih 20tak pitanja. Na usmenom voli postavljati takva pitanja da vidi kako razmisljas ,da vidi jesi li shvatio/la gradivo. Isto nemas se kaj bojat usmenog, tih sat vremena provedenih s prof Hrabarom 1 na 1 mi je najugodnije iskustvo na ovom faksu. Ako ne znas neki odgovor uvijek te proba navuc i pojasnit ako treba.",
      "votes": {
        "upvoters": [
          "DukeFiction",
          "tb153"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275083": {
      "poster": "DukeFiction",
      "content": "@\"Detective Schmosby\"#p275025 hvala od srca na informacijama! Pola predavanja nisam mogao prisustvovati zbog mijenjanja rasporeda pa nisam znao odakle da nadoknadim te nedostatke. Samo jo코 da pitam isplati li se za odgovore na pitanja s weba gledati one \"bilje코ke\" u repozitoriju jer nema ba코 literature? Hvala jo코 jednom!",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275092": {
      "poster": "zeroth",
      "content": "@\"DukeFiction\"#p275083 Te bilje코ke su doslovno ne캜ija bilje쬹ica tako da ako 캜ita코 to je kao da si zapisivao na predavanjima ali nisi ni코ta slu코ao 코to nije tako lo코e kao 코to se iz prve 캜ini",
      "votes": {
        "upvoters": [
          "DukeFiction"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275145": {
      "poster": "KR7 (Detective Schmosby)",
      "content": "@\"DukeFiction\"#p275083 Slicna situacija je bila i sa mnom prosle godine, odgovore sam izvlacio iz tih biljeski, s neta i iz Bartoliceve knjige Mikrovalna elektronika. Ovo je jedinstven predmet gdje se ne ocjenjuje ucenje napamet zadataka s auditornih, nego bas razumijevanje gradiva tako da si pogledaj na yt videe za gradiva koja ti nisu intuitivno sjela. Razumijevanje maxwellovih jednadzbi je trecina posla pa ti preporucujem da krenes od toga. Probat cu nac svoje neke biljeske pa sheram ovdje, mozda pomogne.",
      "votes": {
        "upvoters": [
          "DukeFiction",
          "tb153"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275177": {
      "poster": "DukeFiction",
      "content": "@\"Detective Schmosby\"#p275145 Hvala puno! To bi bilo izvrsno! 游때",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}