{
  "title": "[SBP] O predmetu",
  "creator": "Systematic (Firecracker)",
  "slug": "sbp-o-predmetu",
  "tags": [
    "FER",
    "Sustavi baza podataka"
  ],
  "posts": {
    "275010": {
      "poster": "Systematic (Firecracker)",
      "content": "> @\"branimir1999\"#p274994 Sustavi baza podataka - napredne baze podataka, iako mi se cini da je ovo vec obradeno na BP\n\nDa ti odmah razbijem sliku, nije obradjeno. Cini se tako, ali predmet ulazi u dubinu BP i optimizaciju pisanja querija, što se dogadja u pozadini i slične stvari. Zanimljivo je, ali predmet nije lagan i ima dosta posla oko njega",
      "votes": {
        "upvoters": [
          "Mars (mars_)",
          "[deleted]",
          "abc123",
          "branimir1999"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275071": {
      "poster": "keykey",
      "content": "@\"Firecracker\"#p275010 jel to kazes zbog labosa? jer koliko mi se cini, nema ih vise (nepostojanje labosa profila)",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "275073": {
      "poster": "Systematic (Firecracker)",
      "content": "@\"keykey\"#p275071 da, labosi su bili najveći dio posla. mislim da su se bodovi samo prepisivali, tako da će možda labosi ostatit dio predmeta",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "291586": {
      "poster": "iNavy (mornar Ica)",
      "content": "koliko je rok iz ovog predmeta teži od kontinuiranih ispita",
      "votes": {
        "upvoters": [
          "Djani",
          "Kennedy",
          "Mike (Klaud Konzultanta)",
          "Parazit",
          "Rope (Rops)",
          "Svudec",
          "lucylu"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "305151": {
      "poster": "Kennedy",
      "content": "Kakav je ovaj predmet na roku?",
      "votes": {
        "upvoters": [
          "Djani",
          "FERonja",
          "HARAmara (decko_sa_balkana)",
          "JeleeII",
          "LucidDreamer",
          "Parazit",
          "Rope (Rops)",
          "Svudec",
          "alp (monte)",
          "itsdend",
          "mmmmDa (Ban Levačić)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306887": {
      "poster": "_moonlight_ (moonlight)",
      "content": "### Sustavi baza podataka (SBP)\n\n>! Za ovaj sam kolegij čuo da je jedan od najtežih na PIIS smjeru, ali kako od ove godine (21/22) nema labosa rekao bih da je najlakši, jer su jedine komponente kolegija MI + ZI koji se mogu proći šablonski. Ako tražite kolegij za kojeg ne morate ništa raditi kontinuirano već ga želite ostaviti za rokove, onda je to ovaj kolegij, premda postoje i lakši kolegiji.\n\n>SBP je nastavak na kolegij \"Baze podataka\" s preddiplomskog premda postoji kolegij koji se zove \"Napredne baze podataka\" ali naziv vara. Ako vas zanima kako je ono što ste naučili na Bazama podataka implementirano detaljnije, SBP je savršen kolegij za to. Na kolegiju se objašnjava kako se točno obavljaju SQL upiti, govori se o sustavu za obnovu podataka, transakcijama, kontroli istodobnog pristupa te osnovana distribuiranih baza podataka. Nisam nešto zainteresiran za baze podataka ali su mi sva videopredavanja koja sam gledao bila zanimljiva jer su prezentacije jako kvalitetne i Zakošek lijepo sve objasni (premda je nekad malo spor al ok). Prezentacije imaju glavu i rep, smislen poredak, sve je detaljno napisano. \n\n>Za proći ispit nije ni potrebno baš znati gradivo jer dođe dosta šablonskih zadataka koji se lako riješe, prosjek ove godine na MI je 19.5/35 (prag na MI je 14 bodova), a na ZI 32.5/45 (prag na ZI je 18 bodova). Postoji i usmeni koji nosi 20 bodova, ali Zakošek ponudi svim studentima da im se bodovi iz MI + ZI jednostavno skaliraju na 100 bodova, pa ako ste iz MI+ZI osvojili 40 bodova onda imate prolaz. To je bila tradicija ove i prošlih godina da Zakošek ponudi premda ne piše u prezentaciji ništa o tome, ali mislim da će tako i nastaviti sljedećih godina.\n\n\nTežina: 4/10\n\nKorisnost: 7/10, 9/10 ako vas zanimaju Baze\n\nPreporuka: Da",
      "votes": {
        "upvoters": [
          "Cubi",
          "Ducky",
          "Lusy (MGJ)",
          "Urmum (mamaRu)",
          "_moonlight_ (moonlight)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}