{
  "title": "[STOPRO] O predmetu",
  "creator": "abc123",
  "slug": "stopro-o-predmetu",
  "tags": [
    "FER",
    "Stohastički procesi"
  ],
  "posts": {
    "276313": {
      "poster": "abc123",
      "content": "ima li netko neku info o predmetu stohasticki procesi",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276315": {
      "poster": "[deleted]",
      "content": "@\"abc123\"#p276313 StoPro se održava već duži niz godina, po FER3 programu je malo izmijenjen jer nemamo SiS ali nije pretežak\n\nako smatramo da je SAP nastavak na VIS u smjeru statistike, onda je STOPRO nastavak na VIS u smjeru slučajnih procesa - čitaj varijable koje se mijenjaju u vremenu\n\nkao matematika nije najteži kolegij, ali je recimo (po meni) zahtjevniji od NumMat\n\nmoguće je raditi i seminar i preći preko 100 bodova pa uopće nije problem položiti",
      "votes": {
        "upvoters": [
          "abc123"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277885": {
      "poster": "kix7 (Fish99)",
      "content": "Jel zna netko nesto o predmetu stohasticki procesi?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277902": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"Fish99\"#p277885 Ako ti se svidio SAP i misliš si: \"Jebote pa taj ViS i nije bio tako loš upisat ću i ovo\", nemoj. Predavanja drži Lenka Mihoković koja je od početka poznata po tome da su joj predavanja smrtno dosadna i suhoparna, a iako je gradivo dosta zanimljivo samo po sebi i potencijalno vrlo korisno, primjeri koji se obrađuju na predavanjima su na razini telefonske govornice i reda u bolnicama i nije nimalo zanimljivo.",
      "votes": {
        "upvoters": [
          "kix7 (Fish99)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277915": {
      "poster": "klukas",
      "content": "@\"Fish99\"#p277885 Mogu toplo preporučiti upis predmeta. Slušao sam ga prošle godine i bilo je iznimno ugodno iskustvo. Postoje KPZ-ovi koji su najavljeni i idu pred kraj ciklusa i uglavnom su jednostavni i izvuče se dosta bodova na njima. Prošle je godine na oba KPZ-a bilo moguće ostvariti i iznad predviđenih 10 bodova rješavanjem dodatnih zadataka, čime se nagrađuju studenti koji malo bolje shvaćaju gradivo, no ti zadaci su bili potpuno opcionalni pa se nije kažnjavalo nikog tko ih nije rješavao.\n\nNa materijalima predmeta ima hrpa starih riješenih KPZ-ova i ispita pa učenje za ispite nije teško. Ispiti sami po sebi nisu trivijalni, no ocjenjivanje nije osobito strogo pa nećeš biti na gubitku tu.\n\nPredmet je općenito dosta teorijski orijentiran, i dobar dio učenja će se svesti na shvaćanje koncepata, ima manje rješavanja zadataka nego npr. na Numeričkoj matematici koja je dosta praktično orijentirana. No predmet ćeš upisivati ako te zanima ovo područje pa ni učenje teorije ne bi trebalo biti neki problem. Meni su predavanja bila iznimno ugodna i većina se koncepata može pohvatati na njima.\n\nMoguće je izraditi i seminar od 15 bodova za dizanje ocjene, teme su proizvoljne, pa se i tu možeš zabaviti ako imaš takvih ambicija, u arhivi obavijesti na stranici predmeta možeš vidjeti teme seminara od prošle godine, dosta zanimljive stvari.\n\nSve u svemu jedna chill, ugodna, ne preteška matematika. Gradivo je spiritualni nastavak V dijela ViS-a, na početku se detaljnije obrađuje uvjetna vjerojatnost, pa funkcije izvodnice u vjerojatnosti, zatim se krene na slučajne procese, pa Markovljeve lance, i onda još Poissonov proces, Markovljev proces, procesi obnavljanja, teorija repova i Brownovo gibanje. Drugi ciklus je dosta zahtjevniji od prvog, ali rekao bih i uzbudljiviji, napetiji. Ako ti je ViS bio zanimljiv te ako te zanima jedan malo teoretskiji matematički kolegij, svakako bih preporučio upis Stohastičkih procesa.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "278050": {
      "poster": "Harweyy",
      "content": "Polozio sam predmet s 4, Lenka kao predavac mi je relativno bila ocajna ali sam pogledo sva video predavanja koja nam je objavila. Na ispitima i kpzovima se vrlo lagano skupe bodovi, te jako blago ocjenjuje. Kada sam se spremao za zavrsni sam slucajno googlajuci naletio na neku skriptu na netu na engleskom i skuzio da zena od tud vadi zadatke za ispit, na zavrsnom su se cak 4 zadatka pojavila od tud doslovce prevedena google translatom s engleskog na hrvatski. Moje neko misljenje je da je predmet koristan ako su te zanimali vis i sap i ako zelis neki korisnu matematiku upisat. Imao sam osjecaj da se zena vodi s premisom da imamo jako veliko predznanje tako da sam par puta moro nes dodatno istrazit da bi mi bilo jasno. Osobno bi preporucio ljudima da upisu predmet.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "278052": {
      "poster": "Harweyy",
      "content": "@\"Harweyy\"#p278050 Harvard ima video predavanja nekog profesora o poissonovim procesima koji su mi puno bolje objasnili to gradivo kada smo dosli do njega.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}