{
  "title": "[MMUI] O predmetu",
  "creator": "rpa (vndrpmp)",
  "slug": "mmui-o-predmetu",
  "tags": [
    "FER",
    "Matematičko modeliranje u inženjerstvu"
  ],
  "posts": {
    "276680": {
      "poster": "rpa (vndrpmp)",
      "content": "## **Matematičko modeliranje u inženjerstvu**\n\nJako zanimljiv i zabavan predmet (ovo je prva godina da se predmet održavao), preporučujem svakome tko voli više matematičke predmete. Predmet drži Bojanjac sam (premda piše na stranici predmeta da je Bukal također nositelj, ali njega nismo vidjeli ni čuli cijeli semestar) tako da su predavanja vrlo kvalitetna i skroz opuštena jer čovjek jako dobro objašnjava složene koncepte na način da bi 5-godišnjak shvatio prakse matematičkog modeliranja. Uglavnom, na predavanjima je super atmosfera, potiču se rasprave i kritičko razmišljanje i stvarno ne postoji glupo pitanje. Gradivo predmeta obuhvaća kako modelirati određene pojave ili sustave, od modeliranja vertikalnog hica do modeliranja pandemije SIR modelom. Neke od lekcija koje se obrađuju su teorija perturbacija, dimenzijska anliza, modeliranje homogenih sustava i zakoni sačuvanja.\n\nOd predznanja potrebna je linearna i matan2 (najviše diferencijalne jednadžbe i redovi), no ukoliko se ne sjećate baš najbolje tih gradiva isto se ne trebate brinuti jer ćete se podsjetiti svega u zadacima. MI i ZI oboje nose po 30 bodova, te još postoje 4 domaće zadaće koje nose 4x10 = 40 bodova. Ako vam se neda rješavati zadaće, možete umjesto toga napraviti neki seminar iz kojega možete onda dobiti do 40 bodova (seminar zamjenjuje zadaće ako ih ne želite rješavati), no svakako preporučam rješavanje zadaća pošto na MI i ZI budo vrlo slični zadaci. Također, ukoliko vam na kraju semestra fali par bodova za prolaz ili niste zadovoljni ocjenom, možete se s profesorom dogovoriti za usmeni da si poboljšate ocjenu. U biti, imat ćete onu onu ocjenu za koju si želite naučiti na kraju semestra.\n\nPošto je ove godine (2021./22.) predmet išao prvi put, imali smo samo profesorova rukom pisana i skenirana predavanja (koja su bila vrlo korisna u učenju za ispite i rješavanju zadaća), a iduće godine bi trebala biti gotova i službena skripta.\n\n**TL;DR**: Super zanimljiv predmet za one koji vole matematiku, vrlo opuštena atmosfera\n\nTežina: **5 / 10**\n\nKorisnost: **7 / 10**\n\nBih li preporučio/la predmet: **Da**",
      "votes": {
        "upvoters": [
          "Christoph_Schwab",
          "regnum"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}