{
  "title": "[HMO] Završni ispit - 2021/2022",
  "creator": "Bato (Morski Pas)",
  "slug": "hmo-zavrsni-ispit-20212022",
  "tags": [
    "FER",
    "Heurističke metode optimizacija",
    "Ispiti"
  ],
  "posts": {
    "276780": {
      "poster": "Bato (Morski Pas)",
      "content": "Ulazi li predavanje 11b. Case Studies u ZI",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276787": {
      "poster": "Ziher",
      "content": "@\"Morski Pas\"#p276780 dobro pitanje, da se nadovezem: koje je gradivo ispita (ulazi li samo drugi ciklus)?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "276796": {
      "poster": "tonkec",
      "content": "@\"Ziher\"#p276787 https://www.fer.unizg.hr/_download/repository/HMO-2021-2022_syllabus_ENGL.pdf",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277050": {
      "poster": "saitama",
      "content": "Po meni ponasanje asistenata je bilo jako lose. Ovaj koji nas je cuvao je jos bio okej, reko je studentu da stavi masku ovaj nije htio (iako je izmedu toga i dolaska drugog asistenta stavio masku onako alibi na bradu) i kad mu je receno da mu se ispit nece bodovati student je reko okej nek se ne boduje pustite me da pisem. Dok ovaj drugi asistent, iskreno ne znam kaje tom liku u glavi, uletio nakon 5 min i kreno se derati ko nije stavio masku i tako 3-4 puta nakon sto mu je ovaj asistent koji nas je cuvao reko koji je to student dolazi do njega krene se derati i krene mu cupati ispit iz ruke nakon ceg se student digo jer je drzo ispit u ruci, asistent pita njega oces se tuci i nakon sto je on njega to pito student je reko ajde, asistent se sasro i krenuo je zvat nekog i govori na telefon da je tu student koji ga oce tuci,a on je taj koji je to pitanje prvi povukao. Ne branim studenta ako su pravila da se treba imati masku onda je trebo odma staviti masku, ali da asistent na FER-u iscupa ispit iz ruke i pita oces li se tuci je po meni jos sramotnije ponasanje od ovog sto je student napravio.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}