{
  "title": "[AUDTEHA] O predmetu",
  "creator": "AlaBuc (BCC)",
  "slug": "audteha-o-predmetu",
  "tags": [
    "FER",
    "Audiotehnika"
  ],
  "posts": {
    "277244": {
      "poster": "AlaBuc (BCC)",
      "content": "Kakav je ovaj predmet, netko zna? Mislim ga upisati kao izborni na trećoj godini preddiplomskog. Vidim da je jezgreni predmet na diplomskom na smjeru Audiotehnologije, pa me zanima je li možda težak za položit. Slušao sam audio elektroniku sad u ovom semestru a vidim da se dosta stvari nastavlja na to...",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277247": {
      "poster": "AlaBuc (BCC)",
      "content": "Netko ima informacija o audiotehnici? Kakva je za položit?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277447": {
      "poster": "[deleted]",
      "content": "Ja sam slušao dok je još bila korona pa je nastava bola koncipirana da smo pisali neke seminare. Ne znam kako je inače, ali mislim da ti nijedan predmet sa ZEA nije težak za položiti. Bonus bodovi ako te stvarno zanima područje jer se po meni automatski lakše uči nego neki drugi predmeti.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "277471": {
      "poster": "Viks",
      "content": "slusala sam ovaj predmet nakon korona godine\n\nlabosa imas 4, dodes tamo nesto izmjeris  i odgovoris na pitanja iz uputa kod kuce\n\nasistent ti pomogne objasnit sto se desava da lakse odgovoris na pitanja, skroz chill atmosfera\n\nispiti su bili online tho, to je dosta olaksalo stvar jer si moga pretrazivat prezentacije, ali nema bas zadataka za rijesavanje (ima nesto na materijalima ako se dobro sican)\n\nispiti su samo zadaci, nisu teski nimalo, ucila bi dan prije i na kraju imala 4\n\nsve u svemu, skoro pa meme predmet",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}