{
  "title": "Mentor: Dario Bojanjac",
  "creator": "Fchwpo",
  "slug": "mentor-dario-bojanjac",
  "tags": [
    "FER",
    "Mentori"
  ],
  "posts": {
    "279180": {
      "poster": "Fchwpo",
      "content": "Je li nekome Bojanjac bio mentor? Dojmovi i osvrti su dobrodosli",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "279328": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "@\"Fchwpo\"#p279180 Ja ti mogu reci kao asistenta (dok je jos bio) - izuzetno strpljiv, ponovit ce vise puta i na vise nacina dok ne skuzis, ne ostavi te da se mucis do beskraja. Znam da sada ima dosta studenata kao mentor, drago mi je i zbog njih i zbog njega :) Ako si kod njega, nemoj se ustrucavati pitati za dodatno objasnjenje ili pomoc. Covjek stvarno cijeni rad i uvijek ce naci vremena za pomoci bez obzira koliko imao natrpan raspored.",
      "votes": {
        "upvoters": [
          "Christoph_Schwab",
          "Fchwpo",
          "Jeff",
          "Kuhar",
          "Kushim",
          "spampers (majmunska boginja)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "279332": {
      "poster": "Jeff",
      "content": "@\"Frågan har inget svar.\"#p279328 \n\nSlažem se sa kolegom. Sa strane predavanja i auditornih koje je držao je čovjek na kojeg bih se osobno mogao ugledati. Po objašnjavanju i znanju. Koliko očekuje da radiš ne znam, nadam se da će neki kolege koji ga imaju doći. No vjerujem da se možete dogovorit ako ne stigneš iz nekog razloga nešto odraditi jer je meni djelovao kao razumna osoba, ali kontinuiranog rada će sigurno biti i to očekuj, ali mislim da te to ne mora preplašiti. Realno bi na svakom projektu i završnom trebao biti kontinuirani rad jer tada stigneš riješiti sve nepredvidive probleme i stigneš sve pitati.",
      "votes": {
        "upvoters": [
          "Christoph_Schwab",
          "Fchwpo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "279334": {
      "poster": "thelonewanderer (Du är inte min chef!)",
      "content": "@\"Jeff\"#p279332 Definitivno te nece ganjati bicem jer nije takva osoba, ali ocekuje da imas bar nekog samozalaganja. I nece te potopiti jos dublje \"if you're in a bad spot\". I potvrdujem da se moze dogovoriti s njime ako ne stignes (source: me, zadace proslog semestra).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "279343": {
      "poster": "[deleted]",
      "content": "čovjek vodi podkist sta vise rec, 10/10 mentor",
      "votes": {
        "upvoters": [
          "Christoph_Schwab",
          "Kuhar",
          "McKovalski",
          "thelonewanderer (Du är inte min chef!)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [
          "Fchwpo"
        ],
        "tuga": []
      }
    }
  }
}