{
  "title": "[TEOEST] O predmetu",
  "creator": "Daho_Cro",
  "slug": "teoest-o-predmetu",
  "tags": [
    "FER",
    "Teorija estimacije"
  ],
  "posts": {
    "281900": {
      "poster": "Daho_Cro",
      "content": "Pitanje za starije kolege: kakav je ovaj predmet? Ne znam ima li nekih promjena u odnosu na FER2 program, ali zanima me općenito organizacija, literatura itd.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "281944": {
      "poster": "Fast-and-Fourierous",
      "content": "@\"Daho_Cro\"#p281900 Predmet je kombinacija _Slučajnih procesa u sustavima_ i _Vjerojatnosti i statistike_. Gradivo je matematički detaljno, prezentacije su opširne i izgledaju zastrašujuće na prvu, no profesor stvarno dobro objašnjava i nije nimalo dosadno. \n\nIspiti su puno lakši od očekivanog, ponavljaju se stalno svi zadaci i nisu teški za naučiti, ako ti je čisto do prolaza. Nakon pismenih ispita ima usmeni dio (čak i na MI i ZI) koji se piše odmah nakon i odnosi se na izvode nekih formula i slično. Ako se ne varam ima i neki prag na tomu, no ne sjećam se više.\n\nLabosi su zanimljivi, ima ih 3-4, rade se u Matlabu i Simulinku, a odnose se na neke stvarne primjene, primjerice identifikacija parametara nekog fizičkog sustava, estimacija položaja vozila pomoću Kalmanovog filtra i slično. Odgovori vezani uz labos se pišu u neki pdf izvještaj koji dobiješ. Također su bili neki mali blicevi vezani uz labose.\n\nSve u svemu, predmet se na prvu čini konceptualno strašno, no stvarno nije, a ekipa koja predaje je draga i jako susretljiva. Osobno sam dosađivala jednom asistentu redovito oko jednog labosa i čovjek mi je objašnjavao sve step-by-step što trebam napraviti bez ikakve primjedbe, a profesor s predavanja je isto bio jako dobar.",
      "votes": {
        "upvoters": [
          "Bobinator",
          "Daho_Cro",
          "Upforpslone"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}