{
  "title": "[NLA] Izvedba - 2021/2022",
  "creator": "Goliathus",
  "slug": "nla-izvedba-20212022",
  "tags": [
    "FER",
    "Numerička linearna algebra"
  ],
  "posts": {
    "282910": {
      "poster": "Goliathus",
      "content": "Može li mi netko napisati što je rečeno na uvodnom predavanju, glavne informacije, nisam mogao doći na uvodno predavanje. Tražio sam na intranetu i moodleu, ali nisam nikakve informacije našao",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "283064": {
      "poster": "klukas",
      "content": "@\"Goliathus\"#p282910 O tome kako će izgledati ispiti nije bilo riječi, vjerojatno još ni profesor nije odlučio. Labosi nose 10 bodova, nisu obvezni i organizirani su kao praktična predavanja. Recimo jučer smo imali 1. labos i prošli smo diskretizaciju diferencijalne jednadžbe kako bi se dobio linearni sustav, i onda smo radili Jacobijevu iterativnu metodu za rješavanje takvog sustava i potom smo je programski implementirali. Pretpostavljeni jezik za labose je Matlab, ali možeš radit u Pythonu. Na kraju svakog ciklusa se dijeli max. 5 bodova iz labosa, na način da ćemo vjerojatno dobiti neki zadatak za implementirati i potom ćemo ga prezentirati i odgovarati u tom terminu. Kodove s 1. labosa će asistentica objaviti na FERwebu.\n\nNa 1. predavanju smo prošli malo kroz neku motivaciju predmeta, zatim smo ponovili što je linearni operator, njegov matrični prikaz, i onda smo ponovili što su svojstvene vrijednosti i svojstveni vektori. Pred kraj smo počeli Jordanovu formu no imao sam dojam da ćemo to detaljnije raditi idući put. Literatura, barem za prvi dio kolegija, je `A. Aglić Aljinović, N. Elezović, D. Žubrinić (2017.), Linearna algebra, Element d.o.o.`, što je knjiga po kojoj je rađen predmet Linearna algebra na FER2 diplomskom. Može se naći po poglavljima na stranici tog starog kolegija, može se dići u knjižnici, a profesor je rekao da će pdf objaviti na stranici predmeta ako se autori slože s tim.",
      "votes": {
        "upvoters": [
          "Goliathus"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "283081": {
      "poster": "Goliathus",
      "content": "@\"klukas\"#p283064 hvala puno na odgovoru!",
      "votes": {
        "upvoters": [
          "klukas"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "304409": {
      "poster": "mp99",
      "content": "Vidim da na moodlu nema devetog tjedna predavanja. Je li tada nije bilo predavanja ili nisu objavili materijale?",
      "votes": {
        "upvoters": [
          "Sicsile"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}