{
  "title": "[DAP] Projekt - 2021/2022",
  "creator": "Tompa007 (ğ“ğ‡ğ„ ğ’ğ„ğ‚ğ‘ğ„ğ“ - ğ‚ğ‹ğ”ğ)",
  "slug": "dap-projekt-20212022",
  "tags": [
    "FER",
    "Dubinska analiza podataka",
    "Organizacija"
  ],
  "posts": {
    "284140": {
      "poster": "Tompa007 (ğ“ğ‡ğ„ ğ’ğ„ğ‚ğ‘ğ„ğ“ - ğ‚ğ‹ğ”ğ)",
      "content": "Jel bi mi neko mogao ukratko opisati Å¡ta trebam raditi za projekt, ili dati neke upute, bolestan sam i nisam na predavanjima bio a nema mi nigdje drugih izvora, pls",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "WP_Deva (IdeGas)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "284293": {
      "poster": "snowman",
      "content": "@\"á¸°à¶§á¸°à¶§Å¡\"#p284140 \n\n![](assets/2022-03-08/00038.png)\n\nSve je preko kagglea\n\nImaÅ¡ 4 komponente:\n1. Rang lista (natjecanje): gleda se tko ce napraviti najbolji model za predikciju NBA utakmica, dataset je na kaggleu. Ovo se radi cijeli semestar samostalno te se na kraju dobivaju bodovi prema rangu na tablici, imas raspodjelu u prezi\n\n2. Tri obavezne biljeÅ¾nice: Zadana su neka pitanja za svaku na koju ti moraÅ¡ dati odgovore. Rekao je asistent da one prate gradivo predmeta i ocjenjuje se koliko si dobro napravio + ispitivanje od strane studenta.\n\n3. Recenzije tuÄ‘ih biljeÅ¾nica i recenzije tvoje biljeÅ¾nice od strane drugih: Ovo je najobiÄniji peer review\n\n4. Dodatne biljeÅ¾nice: MoÅ¾emo uploadati do max. 2 biljeÅ¾nice koje ostali mogu koristiti, moÅ¾e biti bilo Å¡ta od boljeg naÄina uÄitavanja podataka do nekog paketa koji je brÅ¾i ili jednostavniji od numpya, vizualizacije itd. Pogledaj si slajd 'Tijek projekta', tamo je toÄno objaÅ¡njeno Å¡ta se moÅ¾e od dodatnih biljeÅ¾nica uploadati jer ne smiju sadrÅ¾avati dijelove koda koji sluÅ¾e za rjeÅ¡avanje obaveznih biljeÅ¾nica kojima rok joÅ¡ nije proÅ¡ao.\n\nAko ti je jos nesto nejasno slobodno pitaj.",
      "votes": {
        "upvoters": [
          "cloudies"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "285266": {
      "poster": "Tompa007 (ğ“ğ‡ğ„ ğ’ğ„ğ‚ğ‘ğ„ğ“ - ğ‚ğ‹ğ”ğ)",
      "content": "@\"snowman\"#p284293  Hvala ti puno,\n\nEvo malo sam proÄitao sve o tome i prouÄio,\n\nImam jedno kratko pitanje, zanimalo me kako bi to okvirno trebalo izgledati unutar koda, radit cu u Javi, mislio sam ucitat podatke, radit razne malverzacije za obradu podatak(nisam jos siguran s kojim librarijem) i onda samo napravit neki model za predikciju isto nisam siguran koji model koristiti (logistilka regresija, SVM ili nesto tako)\n\nJel to generalno to od projekta ? \n\nHvala ti stari",
      "votes": {
        "upvoters": [],
        "downvoters": [
          "WP_Deva (IdeGas)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "285438": {
      "poster": "feudalac",
      "content": "@\"á¸°à¶§á¸°à¶§Å¡\"#p285266 ak sam dobro skuzila na predavanju, msm da ne mozes u Javi nego mora bit u Kaggle notebooku - https://www.kaggle.com/docs/notebooks",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}