{
  "title": "[FVPP] Izvedba - 2021/2022",
  "creator": "Kiflica",
  "slug": "fvpp-izvedba-20212022",
  "tags": [
    "FER",
    "Formalna verifikacija programske potpore"
  ],
  "posts": {
    "284361": {
      "poster": "Kiflica",
      "content": "Jel itko bio na uvodnom predavanju iz ovoga? Je li se išta promjenilo od FMOUSa i imaju li igdje nekakvi materijali buduci da na stranici predmeta nema nista",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "284382": {
      "poster": "JoKing",
      "content": "Jesi siguran da si ovu temu označio s pravim predmetom. Jer koliko vidim Formalne metode za verifikaciju i sintezu programskih sustava je predmet zimskog semestra. Nova verzija FMOUSa je Formalna verifikacija programske potpore. Uglavnom ako misliš na FVPP (predmet koji je prije bio FMOUS) materijali se nalaze na moodle stranici predmeta. Uvodno predavanje smo imali, a za sva ostala predavanja rekao je da neće biti u terminu od 9-12, nego će eventualno imati konzultacije u terminima od 11-12, a za predavanja da gledamo linkove sa moodlea na youtubeu (za sad je objavljeno za 2. tjedan). Sad što se tiče razlika mislim da je rekao da je u 2. ciklusu nešto promijenjeno gradivo, i nešto za labose (sad dal je jedan labos drugačiji ili je samo promijenjena struktura bodova se ne sjećam).",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "287028": {
      "poster": "Jale (čakijale)",
      "content": "vezano uz nadoknadu zadaće na kraju semestra iz prezentacije, zna li netko jel na to mozemo izaci samo ako smo bas propustili termin ili i ako zelimo ponovno pisat ispit za neku zadacu? I jel mora biti neki opravdan razlog za to sto smo propustili ili samo mozemo doci na to bez ikakvog opravdanja?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302437": {
      "poster": "ZliDule",
      "content": "@\"čakijale\"#p287028 imam isto pitanje kao kolega gore, htio bi produziti rok za ovu trecu zadacu. Da se samo ne pojavim?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}