{
  "title": "[MAP] O predmetu",
  "creator": "Ducky",
  "slug": "map-o-predmetu",
  "tags": [
    "FER",
    "Multivarijatna analiza podataka"
  ],
  "posts": {
    "288775": {
      "poster": "Ducky",
      "content": "jel ovo prvi put da se izvodi predmet ili je preimenovani drugi predmet?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "288905": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog učenja)",
      "content": "@\"Ducky\"#p288775 prvi put",
      "votes": {
        "upvoters": [
          "Ducky"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302404": {
      "poster": "oneTwo",
      "content": "Čisto informativno, jel ima netko kome se ovaj predmet svidio?",
      "votes": {
        "upvoters": [
          "ppooww (pp)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302464": {
      "poster": "ppooww (pp)",
      "content": "@\"oneTwo\"#p302404 kao predmet ne. msm da ima potencijala jer obradujemo stvari koje jos nismo vidjeli na drugim predmetima, al ovo mrcvarenje matematikom do najsitnijih detalja, rastrkani materijali i opcenito neznanje sta se tocno ocekuje od nas na ispitima je ubilo ovaj predmet. barem je to moje misljenje.",
      "votes": {
        "upvoters": [
          "Ducky",
          "Rene",
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "cloudies",
          "dh333",
          "grga_it_is (it_is_what_it_is)",
          "matt (Matt)",
          "oneTwo",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302473": {
      "poster": "Rene",
      "content": "@\"pp\"#p302464 slazem se da me predmet nije oduševio, al moj je dojam baš suprotan što se matematike tiče. Mislim stave oni te neke izraze na slajdove, ali imam osjećaj da se ne prolazi tu matematiku detaljno kao npr. na ViSu i SAPu, a čemu sam se nadao kad sam upisao predmet.\n\nTeme su dosta dobre i korisne, ali ja bih osobno volio da je malo više naglasak na matematici.",
      "votes": {
        "upvoters": [
          "matt (Matt)",
          "ppooww (pp)",
          "sheriffHorsey"
        ],
        "downvoters": [
          "Ducky",
          "grga_it_is (it_is_what_it_is)",
          "oneTwo"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302524": {
      "poster": "sheriffHorsey",
      "content": "@\"Rene\"#p302473 Imam sličan dojam. Ako već stavljaju toliki wall of text na slajdove onda bar da objasne to kako spada da mogu shvatit kad se toliko forsira \"razumijevanje\". Kad sam za međuispit učio, išao sam proučavat izvode tih formula i fakat probat skužit sve, ali nemoguće je to popamtit i naučit kako spada uz ovoliku količinu gradiva. \n\nŠto se pak međuispita tiče nebi ih ubilo da su napravili ogledni ili bar nekako hintali na što se fokusirat i koliko detaljno što učiti. Vjerujem da nisam jedini kojem je međuispit bio čudno osmišljen s obzirom da je predmet sličan klasičnim matematičkim predmetima s preddiplomskog. Također, nikako mi nije jasno toliko forsiranje pisanja labosa u R-u. Svaki labos pišem bar duplo dulje zbog jebanja oko R-ovih nelogičnosti u odnosu na normalne jezike.\n\nJoš bih htio napomenut za buduće generacije da dobro razmisle o upisu ovoga ako su na RZu. Nekoordiniranost ovog predmeta s paralelnim programiranjem je nevjerojatna. Rokovi za labose su gotovo uvijek isti dan i ispiti su isti dan.",
      "votes": {
        "upvoters": [
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "grga_it_is (it_is_what_it_is)",
          "matt (Matt)",
          "oneTwo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "302525": {
      "poster": "Ducky",
      "content": "@\"oneTwo\"#p302404 meni se svidio. Nejdem na predavanja, ali labosi zahtjevaju da zapravo nešto i naučiš. Gradivo mi je zanimljivo. Što se tiče matematike, žao mi je što nisam išao na predavanja, ali naučiš dosta toga od asistenata koji te jedini oko toga mrcvare (što je dobra stvar imo).",
      "votes": {
        "upvoters": [
          "steker"
        ],
        "downvoters": [
          "grga_it_is (it_is_what_it_is)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303444": {
      "poster": "grga_it_is (it_is_what_it_is)",
      "content": "@\"oneTwo\"#p302404 \n\nNe znam odakle krenuti.\n\n**Gradivo je fenomenalno** da se nije prolazilo kroz gradivo kao da idemo na maraton. Dođeš na predavanja i tko god da predaje samo next, next, next... stani malo, polako. Nabacali su teme ne gledajući koliko treba da sažvakaš te teme, prezentacije su objavljene nakon predavanja i onda će se vjv netko čuditi zašto studenti nisu dolazili, pa jer se nisu mogli pripremiti i spremiti pitanja a samo je bilo next next neke nepoznate teme i teške teorije... kako onda da pitam nešto ako ne znam što pitati.\n\nKada sam uzeo Johnsona sve ono što se nalazi na prezentacijama je copy-paste iz te knjige, od riječi do riječi, što nema smisla, koja je onda poanta prezentacije i predavanja. Prezentacije su ispunjene s 1000 formula koje su samo nabacane.\n\nNije bio stavljen ogledni MI pa nismo znali što očekivati na MI (*predmet se prvi put izvodi*). MI gubi poantu kada ti stavi random ispis nekog testa i sada te pita što tamo piše. Nema podsjetnika, a na ZI kao da smo upisali Matematičku analizu 1, samo što se tamo potrude lijepo napisati korak po korak izvode i sve, a ovdje te pitaju teorijsko pitanje i sveukupno 12 bodova nosi. Sada na kraju ZI asistenti su nam trebali odgovarati na pitanja u vezi testa, pa pretpostavljam da su oni sastavljali MI, ali kada su ih kolege upitali za pragove (MI + ZI mora biti 50% bodova) oni nisu niti znali da ima prag. Da se za pretpostaviti da su sastavili ispit ne imajući na umu da mora biti prag 50% u zbroju... Općenito ne vidim poantu da stave prag na MI i ZI kada jedno korisno na ovom predmetu su bili labosi, mada su i oni pisani u R-u što je nepotrebna \"komplikacija\".\n\nViše kolega je zamjetilo da je pristup profesora kao da su radili prezentacije dan prije, potpuno nekoordiniran predmet, svi akteri \"vode svoju politiku\", **nigdje nije naznačeno što treba znati**, a što ne. Naravno da će se naći pojedinci koji će reći da je na studentima da procjene što je bitno, pa je kada bi znali koji bi zadaci mogli doći, kada bi imali skriptu, kada bi bila neka zbirka zadataka, kada bi dolazili na predavanja s pitanjima...\n\nSvatko tko planira upisati ovaj predmet sljedeće godine neka bude oprezan, ako ništa ne promjene mislim da vam je bolje uzeti naslove lekcija koje se obrađuju na ovom kolegiju i lijepo preko ljeta uzeti Johnsona i YT videja i polako prolazit kroz to, a za one koji su na DS smjeru, samo ću reći SRETNO!",
      "votes": {
        "upvoters": [
          "BaboTrojka",
          "Ducky",
          "Lyras",
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "cloudies",
          "diskobanana",
          "oneTwo",
          "ppooww (pp)",
          "sheriffHorsey",
          "steker",
          "wesley"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303447": {
      "poster": "grga_it_is (it_is_what_it_is)",
      "content": "I da mislim da je bilo pitanje o kolegiju a ne o gradivu.\n\nOčito se svima svidjelo gradivo, ali ne i izvedba.",
      "votes": {
        "upvoters": [
          "Ducky",
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "oneTwo",
          "ppooww (pp)",
          "wesley"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303475": {
      "poster": "bodilyfluids (Dragi prijatelj strojnog učenja)",
      "content": "Ono kad nekolicina nekoordiniranih profesora pokusa voditi strojno-like flagship predmet, ali odgode izradu plana predavanja i nastavnih materijala do tjedan dana prije pocetka semestra.\n\nMap u ljusci oraha",
      "votes": {
        "upvoters": [
          "Lyras",
          "grga_it_is (it_is_what_it_is)",
          "lovrisa (一口)",
          "oneTwo",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "ErnestHemingway (Alfetta)",
          "Lyras",
          "sheriffHorsey"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "303488": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"it_is_what_it_is\"#p303444 FYI: MI i ZI nisu slagali asistenti, nego profesori",
      "votes": {
        "upvoters": [
          "grga_it_is (it_is_what_it_is)",
          "lovrisa (一口)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303504": {
      "poster": "grga_it_is (it_is_what_it_is)",
      "content": "@\"Alfetta\"#p303488 \n\nMoje isprike onda asistentima, to sam pretpostavio jer su rekli ako imamo kakvih pitanja oko ZI da njih pitamo.\n\nMislim asistenti su fakat bili fer na labosima i pokazali nam cake \"u praksi kako se radi\" i neke zanimljivosti, to definitivno treba priznat.\n\nAli opet je onda meni malo čudno što od 4 profesora niti jedan nije došao do nas tijekom ispita i pitao ima li tko kakvih pitanja, nejasnoća i sl.",
      "votes": {
        "upvoters": [
          "Ducky",
          "lovrisa (一口)",
          "oneTwo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303505": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"it_is_what_it_is\"#p303504 Da to je čudno, ali kao koji od profesora bi šetao ako je svako svoj dio napravio. Valjda im je bilo jednostavnije dati neke generalne upute asistentima",
      "votes": {
        "upvoters": [
          "lovrisa (一口)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303507": {
      "poster": "grga_it_is (it_is_what_it_is)",
      "content": "@\"Alfetta\"#p303505 \n\nTo je, ali opet kada pogledam svaki ispit na fakultetu su išli 2-3 prof iako je svatko neki zadatak \"zadao\", recimo kod matematičkih predmeta.\n\nNeam pojma, čini mi se kao da je njima ovo sastrane onako predmet hahahahah.",
      "votes": {
        "upvoters": [
          "lovrisa (一口)",
          "oneTwo"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "303514": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"it_is_what_it_is\"#p303507 A msm, asistenti znaju o čemu se radi pa ne vidim neki konkretan problem u tome",
      "votes": {
        "upvoters": [
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "lovrisa (一口)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}