{
  "title": "[SOSIA] 2. laboratorijska vježba - 2021/2022",
  "creator": "ana (anci)",
  "slug": "sosia-2-laboratorijska-vjezba-20212022",
  "tags": [
    "FER",
    "Sigurnost operacijskih sustava i aplikacija",
    "Laboratorijske vježbe"
  ],
  "posts": {
    "297203": {
      "poster": "ana (anci)",
      "content": "Jel netko ovo napravio pa da ima neke smjernice kako radit, ja sam procitala onaj rad i nije mi bas jasno od kud krenut",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "297206": {
      "poster": "indythedog",
      "content": "@\"anci\"#p297203 Ja sam uzeo ona 2 prva preduvjeta koje su nam oni dali (web scraper i autentifikacija kao korisnik) i dodao još jedan svoj, i onda ih jedan po jedan raspisao. Npr. za ovo autentificiran kao korisnik sam stavio da može bit 2 načina za to - pogađanje lozinke ILI krađa sjedničkog tokena, pa sam onda za svaki od tih slučajeva raspisao što treba napadač napraviti da dođe do toga itd. Ugl. najbolji savjet, kreni od vrha prema dnu i ne bi trebalo biti preteško. Ja sam radio tako da imam 3 tipa čvorova - AND, OR i \"obični\". AND roditeljski čvor označava da svi preduvjeti ispod moraju biti ispunjeni da bi se ostvario događaj roditelj, OR da je dovoljno da se samo jedan ostvari. Nadam se da su pod \"koristite više vrsta čvorova\" mislili na to, jer ja osim te 3 vrste nisam našao na neku posebnu vrstu čvorova koji se koriste u stablu\n\nJedino ne znam, labos mi se čini malo prejednostavan, pa ne znam ima li neki catch koji ja nisam skužio ili je fkt dovoljno napraviti stablo sa 15-20 čvorova i tjt?",
      "votes": {
        "upvoters": [
          "ana (anci)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "297207": {
      "poster": "ana (anci)",
      "content": "@\"indythedog\"#p297206 E pa da, nije mi jasno koliko oni zele detaljno da idemo jer je sve dosta povrsno napisano. Ali hvala ti, tako cu nekako i ja onda krenut",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "297210": {
      "poster": "ana (anci)",
      "content": "@\"indythedog\"#p297206 Si javno dostupne podatke kao username, ime, prezime, ... isto gledao kao da su ukradeni ako napadac dode do njih, ili samo tajne podatke?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "297211": {
      "poster": "indythedog",
      "content": "@\"anci\"#p297210 Ne, pretpostavio sam da se ti neki osjetljivi podaci nalaze unutar baze/aplikacije i da napadač mora doći do njih, a ovo ostalo (ime, prezime, username) može koristiti u napadu ako mu pomaže.",
      "votes": {
        "upvoters": [
          "ana (anci)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}