{
  "title": "[UUZOP] O predmetu",
  "creator": "regnum",
  "slug": "uuzop-o-predmetu",
  "tags": [
    "FER",
    "Uvod u znanost o podacima"
  ],
  "posts": {
    "305453": {
      "poster": "regnum",
      "content": "Neki osvrt na predmet vas koji ste polozili?",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "305470": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"regnum\"#p305453 Ako nikad nisi radio nesto takvo, ok pregled svega sta se radi. Izvedba je dosta losa i nakon prvog ciklusa nitko vise nije isao na predavanja. Predmet vecinski organizira Jovic, a to bi ti trebalo reci da je organizacija smece. Nema mi nego samo zi i projekt. Projekt je 20 bodova za replikaciju rezultata iz nekog papera + 20 bodova za nekakvu nadogradnju. Ovo je zapravo najbolji dio predmeta ako skupis dobru ekipu i ako asistent bude dobar. Ja sam imao nesrecu pa sam uzeo jako los paper sto je bilo onda kasnije dosta tesko za nadogradit. Zavrsni ispit je masivni shitshow bio jer smo pisali na faksu na fakultetskim racunalima i iskljucili su nam internet da nemozemo trazit po stacku i onda su sami pucali u nogu jer nismo mogli na moodleu rjesavat ispit, nego su nam dijelili dataset preko usb sticka. Sve u svemu shitshow.",
      "votes": {
        "upvoters": [
          "Fica (Prof)",
          "WickyWinslow",
          "bodilyfluids (Dragi prijatelj strojnog učenja)",
          "regnum"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "steker"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "305502": {
      "poster": "sheriffHorsey",
      "content": "@\"Alfetta\"#p305470 Samo da se nadovežem da su skužili da su sjebali na zi. Predmet sam pustio za zimski rok i tamo je organizacija ispita bila puno bolja. Jupyter i moodle su normalno radili, ali po defaultu su ti sve ostale stranice blokirane. Da se razumijemo, završni ispit zahtijeva punu koncentraciju 2 i pol sata i nije najlakši za dobro napisat, ali nije teško skupit za prolaz. Mislim da razumiju da je premalo vremena za riješit sve zadatke pa su nešto blaži pri ocjenjivanju. Super je što te ne tlače s kontinuiranim radom (barem mene nije moj asistent) i što je velik fokus na praktičnom radu.",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)",
          "FERonja",
          "matt (Matt)",
          "regnum"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "305534": {
      "poster": "regnum",
      "content": "znaci moze se samostalno radit, nisu bitna predavanja? @\"sheriffHorsey\"#1213 @\"Alfetta\"#p305470",
      "votes": {
        "upvoters": [
          "matt (Matt)",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "305546": {
      "poster": "ErnestHemingway (Alfetta)",
      "content": "@\"regnum\"#p305534 Što su to predavanja iz UUZOP-a?",
      "votes": {
        "upvoters": [
          "Fica (Prof)",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [
          "regnum"
        ],
        "wtf": [],
        "tuga": []
      }
    },
    "306467": {
      "poster": "feudalac",
      "content": "@\"regnum\"#p305453 evo i jedno drugacije misljenje od mene. \n>! Osobno jedan od drazih predmeta na diplomskom, ako te zanima to podrucje. Naravno, prvo provodenje predmeta pa je imalo svoje mušice, ali sve u svemu dosta dobro. \n\nNe pretrgas se od posla, ne trebas na predavanja, a ipak naucis nes. Predmet sto se tice teorije daje uvodni pregled u podrucje koji ide vise u sirinu nego dubinu za razliku od klasicnih ferovskih predmeta. Slicno tako je i predmet Dubinska analiza podataka. Malo je naporno ucit za ispit, ali mislim da je opcenito korisno znat koje metode uopce postoje i koji su njihovi usecaseovi pa imas neku referencu u buducnosti kad se susretnes s nekim zadatkom. \n\nProjekt je super i najbolji dio predmeta jer se prvi dio radi samostalno, a drugi u grupi pa nema situacije da netko u timu totalno nema pojma sto se dogada jer su svi vec morali proc prvi dio sami. Meni jedno od boljih iskustava timskog rada na faksu. Osim toga je super za primjeniti znanje sa strojnog na nekom konkretnom problemu, ako za to jos nisi imao priliku. \n\n**TL;DR:** nije naporno, a korisno",
      "votes": {
        "upvoters": [
          "1vq",
          "regnum",
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306480": {
      "poster": "Jale (čakijale)",
      "content": "Jel netko s RZ-a mozda slao molbu da mu priznaju ovaj predmet kao izborni profila?",
      "votes": {
        "upvoters": [
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306550": {
      "poster": "sheriffHorsey",
      "content": "@\"čakijale\"#p306480 isto me zanima, ako ti prođe javi",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306569": {
      "poster": "matt (Matt)",
      "content": "@\"čakijale\"#p306480 @\"sheriffHorsey\"#p306550 \n\n> Vaša molba za priznavanje predmeta Uvod u znanost o podacima u grupu izbornih predmeta profila (18647) nije odobrena.\n\n> Na molbi je napomenuto da manjak ects bodova u spomenutoj grupi nadoknadite pri upisu u idući semestar.\n\nJebes RZ, svi fini predmeti su na ZOP-u\n\nhttps://www.fer.unizg.hr/_download/repository/Promjena_profila.pdf",
      "votes": {
        "upvoters": [
          "ErnestHemingway (Alfetta)",
          "Jale (čakijale)"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": [
          "Jale (čakijale)",
          "sheriffHorsey",
          "steker"
        ]
      }
    },
    "306582": {
      "poster": "Jale (čakijale)",
      "content": "@\"Matt\"#p306569 \n\nNe kuzim, cini mi se sasvim razumno da priznaju taj predmet za RZ, dosta glupo. Hvala na odgovoru, valjda cu probat svejedno pa mozda slucajno prode",
      "votes": {
        "upvoters": [
          "steker"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "307000": {
      "poster": "Jale (čakijale)",
      "content": "@\"sheriffHorsey\"#p306550 Slao mail prodekanici za nastavu, kaze da molba ne bi bila odobrena, da nece priznavati predmete koji nisu navedeni na popisu kao izborne profila",
      "votes": {
        "upvoters": [
          "sheriffHorsey"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}