{
  "title": "[SIGKOM] O predmetu",
  "creator": "_moonlight_ (moonlight)",
  "slug": "sigkom-o-predmetu",
  "tags": [
    "FER",
    "Sigurnost komunikacija"
  ],
  "posts": {
    "306898": {
      "poster": "_moonlight_ (moonlight)",
      "content": "### Sigurnost komunikacija (SIGKOM)\n\n>! Ovo je kolegij s najgorim materijalima na faksu, te jedan od najgorih po organizaciji. Prezentacije nemaju glavu ni rep, ne znaš gdje što počinje, gdje završava. Sve je napisano u nekim polurečenicama i često postoje 3-4 razine indentacije i hrpa teksta za koji ne znaš čemu točno pripada. Ne znam tko je sastavljao prezentacija, možda iz perstektive osobe koja je stručnjak u području imaju smisla, ali za nekog studenta koji se prvi put susreće s tim su prezentacije beskorisne. Nabacana je hrpa pojmova i termina od kojih ne znaš koji su bitni a koji nisu. \n\n>Za MI nije postojala nikoja obavijest kako će se održavati i koje će gradivo ući u ispit. Valjda nositeljima ima više smisla da im deseci studenata šalju mail s istim pitanjem nego da postave obavijest. MI i ZI nose svaki po 45 bodova, dok labosi nose 10 bodova. Predavanja nisu obvezna, a koliko sam čuo niti korisna. Za labose riješavate zadatke u IMUNES-u (https://gitlab.tel.fer.hr/sigkom/sigkom-lab) koji nisu nešto zahtjevni, samo možete zapeti na dosta stvari (ali studoši dretve pomažu). Ne bih rekao da sam mnogo naučio iz labosa, upute za njih su osrednje, nisu loše kao prezentacije ali isto manjka objašnjenja. MI je bio u formatu otvorenih pitanja i prosjek je bio 23.3 / 45, dok je ZI bio dosta lakši jer su sva pitanja bila na zaokruživanje pa je prosjek bio 31.45 / 45. Prosjek na labosima je 7.86 / 10, pa bih rekao na kraju da je ovaj kolegij bio dosta lagan, ali prije ZI-a sam imao strah da ga neću uspjeti riješiti jer sam mislio da će biti svo gradivo kolegija i da će pitanja biti kao na MI-ju. Ovaj se kolegij održava po prvi put pa nije čudno da je tako loše izveden, ali nekako sumnjam da će biti napretka jer nositelji ne daju dojam kao da ih je briga za organzaciju kolegija.\n\nTežina: 3/10\n\nKorisnost: 2/10\n\nPreporuka: Nikako",
      "votes": {
        "upvoters": [
          "FERonja",
          "Jaster111",
          "Rope (Rops)",
          "_moonlight_ (moonlight)",
          "anon00",
          "nnn (dinoo)"
        ],
        "downvoters": [
          "Sulejman"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306911": {
      "poster": "Sulejman",
      "content": "Predavanja su zanimljiva i korisna. Oni koje ne zanima sigurnost, stvarno im ništa neće bit zanimljivo. Mikuc će vam pričati više o gradivu i preporučam da odete bar na njegovo predavanje o firewall-u jer će vam trebat za labos i za ispit, a puno lakše je shvatit od profesora nego sa prezentacija. Vuković je skroz flegma i doslovno prek pol vremena priča o događajima iz stvarnosti te su zato i preze koje on predaje jako siromašne. \n\nMI je problematičan ak ne znate kenjat na pitanjima slobodnog odgovora, a ZI je jako lagan (prosjek 31/45, nitko manje od 40%).\n\nSve u svemu, ako vam se neda na predavanja nemojte upisat predmet, jedino ako već znate puno o sigurnosti, onda će vam vjerojatno bit najlakši do sad. \n\n**Težina: 2/10**\n\n**Koristnost: nakon SRS-a, nije baš koristan**\n\n**Preporuka: Super predmet za popunit kategoriju 'Izborni predmeti profila', ako se ne želite previše mučiti**",
      "votes": {
        "upvoters": [
          "Jale (čakijale)",
          "ruza0001 (rozy)"
        ],
        "downvoters": [
          "FERonja",
          "_moonlight_ (moonlight)"
        ]
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306912": {
      "poster": "ruza0001 (rozy)",
      "content": "@\"moonlight\"#p306898 iskreno ovo za napredak bas i nije istina, ekipa je napravila najkreativniji ZI koji sam do sada vidio na ovom faksu, što je samo po sebi dokaz da su isli unaprijediti nešto i dati malo kreativniji format od \"navedite ovo, nabojite ovo, objasnite ovo\". Lagan predmet za proci s jako malo ulozenog vremena, ako nekome treba izi predmet u semestru.",
      "votes": {
        "upvoters": [
          "Daeyarn",
          "Erpeg",
          "Hrvoje (Hrvoje45)",
          "Jale (čakijale)",
          "JoKing",
          "PaleAle",
          "Sulejman",
          "SuperSjajan3",
          "blablajar",
          "mesojed (sofronijevicevPrst)",
          "nnn (dinoo)",
          "samurai (samuraj)",
          "tempest"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    },
    "306914": {
      "poster": "Sinusan",
      "content": "@\"rozy\"#p306912 \n\nSlažem se s ovim, ako nastave s formatom kao u završnom ispitu predmet će biti top.",
      "votes": {
        "upvoters": [
          "Sulejman"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}