{
  "title": "[FVPP] O predmetu ",
  "creator": "Jale (캜akijale)",
  "slug": "fvpp-o-predmetu",
  "tags": [
    "FER",
    "Formalna verifikacija programske potpore"
  ],
  "posts": {
    "307008": {
      "poster": "Jale (캜akijale)",
      "content": "### Formalna verifikacija programske potpore \nSvi stari osvrti na predmet (u FMOS dretvi) su to캜ni. Dosadno i beskorisno gradivo. \n\nTri su zada캖e, od toga za dvije za pripremu morate napisati rukom odgovore na pitanja i onda dolazite na labos pisati kratki ispit o sadr쬬ju zada캖e. Tre캖a zada캖a je implementacija SAT rje코ava캜a i nosi 20 bodova (i do 8 bonus bodova), super za skupiti bodove ali ima malo gnjava쬰 s implementacijom. Ne bi trebalo biti prekomplicirano, no mukotrpno je za debuggirati ako se negdje zezne코. Nakon odgovaranja asistent/profesor ukopcaju USB u vas laptop kako bi prebacili izvorni kod labosa na njega, jer za코to bi ne코to moglo i캖i preko maila/moodlea/teamsa kad vam mogu jednostavno doci i zabiti u laptop USB koji je netom prije bio u 20 drugih laptopa 游뗵.\n\nNa ispitima se skupe neki bodovi na zadacima, teoriju je nemogu캖e nau캜iti jer, osim sto je neopisivo dosadna, prezentacije su lose. Postoje PDF-ovi s objasnjenjima zadataka i video auditorne na YT (sva predavanja su snimljena na YT isto), to je dobro barem. \n\nNije te쬬k predmet, samo je jako dosadan i velika je tlaka u캜iti ga. Ne bih preporu캜io predmet nikome, osim kolegama s RZ-a koji tra쬰 najlak코i prolaz u 2. semestru za jezgreni predmet profila (nez kakav je AVSP po te쬴ni, no to ima ograni캜enje na broj upisanih studenata) jer su vam alternative Duboko, IRG i Oblikovni (te쬴 predmeti). Pretpostavljam da je jedini razlog 코to je ovaj kolegij uop캖e upisalo dovoljno studenata da se odr쬴 to 코to su ljudi s RZ-a htjeli izbjeci te teze predmete. \n\nTe쬴na: 4/10\n\nKorisnost: 0/10\n\nPreporuka: **Ne**, osim ako tra쬴te najlaksi RZ jezgreni",
      "votes": {
        "upvoters": [
          "gladiator"
        ],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}