{
  "title": "Prestanak rada Studoša",
  "creator": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
  "slug": "prestanak-rada-studosa",
  "tags": [
    "Službeno"
  ],
  "posts": {
    "307139": {
      "poster": "micho (M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽)",
      "content": "Dana 03.07.2022., u kasnijim noćnim satima, Studoši prestaju s radom. Od ovog trenutka nadalje, prestaje mogućnost objavljivanja, te će se sadržaj pospremiti, obraditi i objaviti na [GitHubu](https://github.com/studosi/dump) u dolazećim danima. Podatke je potrebno anonimizirati, i maknuti direktne razgovore iz podatkovnog skupa. Sve ostalo bit će na prijenavedenom linku.\n\n# Originalna ideja\n\n>! []()\n\n> Originalna ideja Studoša bio je fakultetski forum za cijelu Hrvatsku. FER2Net je svakako pokazao potencijal koji internetske zajednice mogu imati u smislu poboljšanja studiranja. Još i prije nego što je bilo poznato da će se FER2Net ugasiti počeo sam raditi na Studošima, koji su se tad još zvali Kampus.\n\n> Motivacija je bila ta što sam neko vrijeme bio permabannan s FER2Neta, te nisam imao pristup Now playingu u kojem je jedna osoba objavljivala pjesme koje su mi konstantno davale lude playliste. Htio sam ponovno slušati te bangere.\n\n> Usred razvoja (plan je bio otvoriti forum paralelno s FER2Net na ljeto 2020.), FER2Net se ugasio i ja sam u što bržem roku skinuo, uredio i podigao materijale i forum, čini mi se u 2 tjedna.\n\n> Ideja je tijekom vremena evaluirala u klaster foruma sa zajedničkim brendom, i povezivanje istih mehanizmom gostova među forumima. Ideja je pitchana ljudima s raznih fakulteta - prvi pitch je bio za\n\n>! []()\n> - farmaciju\n> - medicinu\n> - PMF\n> - KIF\n\n>! []()\n\n> dakle, srodni, STEM fakulteti. I recepcija je bila pozitivna. Prije kretanja u razvoj ekstenzije za goste, negdje na početku 2021. godine, ideja je konkretnije prikazana drugim ljudima. Tad se znalo o čemu se radi, dakle, koje bi bila obaveze, zahtjevi, mogućnosti - i na sami spomen odgovornosti inicijalni entuzijazam je dosta pao. Kroz vrijeme je nekim ljudima dano korištenje @\"M̵̧̩͑̀͝î̶͍̉ć̴̝̾́̀o̶̺̟̣͂̽\"#1 računa, tj. dana im je mogućnost imitacije. Vrlo brzo su zainteresirani rekli da je to sve malo preintenzivno ili im je prestalo biti interesantno. I tako, smisao Studoša bio je već mrtav oko 4. mjeseca 2021., kad sam i ja uvelike prestao s podrškom.\n\n> Zaključak je bio da iako plan u toj formi nije bio ostvariv, ipak sam želio održati forum do trenutka diplomiranja jer su tada stvari izgledale lijepo. Nedavno je bio rok za predaju diplomskog, tako da je kraj mojeg studiranja na vidiku. Ali zašto onda ne dati to nekome drugome da vodi?\n\n# Zašto Studoši neće nastaviti\n\n>! []()\n\n> Inicijalno je to nekako bila i ideja. Neki znaju da sam nekoliko puta, kao odgovor na kritike, nudio drugima neka onda uzmu forum i pretvore ga u tu super stvar u koju žele da on bude. Naravno, nikad nije bilo odgovora. Logična ideja bi bila dati to @\"mornar Ica\"#269 , pa onda nek on radi s njim što hoće. No tijekom vremena sam shvatio da u principu ne želim da se moj rad asocira s novijim generacijama.\n\n> Nove generacije FER-a su me razočarale, vjerojatno isto kao što je i moja generacija razočarala starije generacije. Između ostalog, kultura varanja, vrijeđanja, tj. generalno nepoštovanja, generacijski sraz općenito, različite vrijednosti su ono što me odbija da nešto ionako puno mana, kao što su Studoši, promijeni ruke. Mlađe generacije ionako imaju Discord. Mislim da im platforma kao Flarum neće puno značiti dok im Discord ne makne slobodu koja im je trenutno bitna. Mislim da micanje youtube playera, prodavanje podataka i potencijalno sudjelovanje u botnetu trenutno nije toliki dealbreaker. A ja definitivno ne želim da me se asocira s generacijom s kojem se u maločemu slažem.\n\n> Uz to, vjerujem da Studoši trebaju umrijeti. Vjerujem da ono što ljudi trebaju ili žele se svodi na uslugu, koja onda nije zajednica, i ona na neki način mora biti profitabilna do mjere da se svim tim \"prljavim stvarima\" bavi netko osim studenata. Moje je mišljenje da studenti FER-a, kao i općenito fakulteta, jednostavno nisu zainteresirani za ulog resursa da bi se nešto održavalo. Daljnje filozofije čija je to krivica po meni nisu potrebne. Poanta je da Studoši, koji su zamišljeni kao zajednica uz dobrotvorni rad i bez paywallova, nisu kompatibilni s takvim tipom proizvoda.\n\n> U konačnici, mislim da vođenje ovoga od strane studenata nije pravi način. Kroz ove 2 i pol godine konstantno sam bio stavljen u poziciju gdje nisam prijatelj nikome - nisam prijatelj studentima jer im ne brišem postove gdje se vidi varanje, gdje se vrijeđa nekog pa se kasnije žali, nisam prijatelj profesorima jer tu i tamo moram i njih odbiti da se makne neki sadržaj preko kojeg se prepisuje i jer sam domaćin stranice na kojoj ima postupaka koje bih kao student FER-a morao prijaviti stegovnom, da nema zakona koji štite privatnost. I svejedno sam bacio u vatru puno poznanstava i prijateljstava jer se sralo gdje se jelo i jelo gdje se sralo.\n\n> Vođenje ovakve stranice mora biti u formi totalne anarhije ili autoriteta kojem ne smeta biti neprijatelj. No onda se postavlje pitanje - tko će na njoj biti ako nema zaštite od svađe, ili ako je taj neprijatelj npr. FER koji će ljude sankcionirati? Mislim da je sam koncept ovakve stranice uz moderne norme i očekivanja u konfliktu s servisima kao Whatsapp, Instagram, Discord, Telegram itd. jer ti servisi pružaju mogućnosti koje ova stranica nikad ne bi mogla, a razvodnjavaju populaciju. Ako se obistine glasine da KSET planira nešto slično ovome u suradnji s FER-om, možda možemo vidjeti kako 2. scenarij funkcionira.\n\n# Što sad?\n>! []()\n\n> Ono što preostaje napraviti je objaviti dump tema u nekom formatu koji se da obraditi. To će vjerojatno biti neki JSON ili CSV, ili više njih. Nisam još siguran koliko ću to pretprocesirati, no poanta je da će se sadržaj moći očuvati.\n\n> Postaje puno stvari na materijalima koji nisu na Gitu. I tu se očekuje spajanje kroz ove dane, no moguće je da će biti spojeno odjednom mrvicu kasnije jer planiram ići na more, na kojem nemam dobru vezu, pa ću stvari pospajati offline, a pushati kad dođem do boljeg interneta.\n\n> Svakako postoji i lista repozitorija koji se trebaju urediti (na koje je bio stavljen neki materijal, ali nisam odmah sredio i ostatak repozitorija). I to će se napraviti, samo pitanje kroz koliko vremena. Ne želim ništa previše obećavati jer nisam radio procjene.\n\n> Finalno, domenu vjerojatno neću obnavljati. GitHub će vjerojatno stajati bar mjesec dana nakon što završim sve s materijalima. A onda će se sve to obrisati, pa bi bilo dobro napraviti backupe. Ne bi trebalo biti previše brige jer će ići obavijest preko [GitHubu](https://github.com/studosi/dump) o konačnom datumu brisanja Gita.",
      "votes": {
        "upvoters": [],
        "downvoters": []
      },
      "reactions": {
        "haha": [],
        "wtf": [],
        "tuga": []
      }
    }
  }
}